[
  {
    "title": "Inovo Studios: Full Stack Javascript Developer (Shape Up + Small team)",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Nashville, TN\n    \nURL: https://www.tribesocial.io\n\n\nTribe Social is a dynamic platform that fosters community engagement and content creation through a robust social infrastructure. We empower creators and users alike with real-time interactions, media sharing, and seamless integration across web and mobile.\n\nWe are seeking a talented Full-Stack JavaScript Developer to join our team and contribute to building and scaling our platform. We want builders—not just coders.\nIf you thrive in an environment where autonomy, ownership, and impact matter, you’ll love working with our team.\n \nOur Application Process\nWe work async as much as possible, so most of this process will be automated.\nSubmit application\nEmail async interview\n25 min intro video call\n90 min code review call\nPaid trial project ($50/hr x 25 hr)\nPro Tip: Writing and recording video is our primary form of communication, so leverage that!\n \nOur tech stack:\nBackend: Node.js with Sequelize ORM for MySQL\nFrontend: React.js with TailwindCSS\nMobile: Flutter (built using FlutterFlow)\nDatabases: MySQL for web/core app, Firebase for mobile app\nCI/CD: CircleCI for testing and deployment\nMedia Processing: LivePeer for video transcoding\n \nHow We Work\nAt Tribe Social, we don’t follow traditional Agile, Scrum, or Kanban methodologies. Instead, we embrace Shape Up from 37 Signals, a product development framework designed to avoid endless planning, micromanagement, and scope creep.\nFixed Time, Variable Scope – We work in monthly cycles with clear priorities. We decide how much time we want to spend on a problem and shape solutions to fit within that timeframe.\nShaping – Before a project gets scheduled, we shape it—defining the problem, solution, risks, and constraints upfront. Only well-formed, concrete ideas make it to development.\nTeam of 1 – No micromanaging. No back-and-forth over tiny details. You decide how to execute within the defined problem space.\nPair Project Management – You're not alone, but working together with one of our team for each step of the project\nWorking Meetings - We thrive with async comms for updates. We use virtual calls to untangle issues and write code together.\nTo apply: https://weworkremotely.com/remote-jobs/inovo-studios-full-stack-javascript-developer-shape-up-small-team-1",
    "url": "https://weworkremotely.com/remote-jobs/inovo-studios-full-stack-javascript-developer-shape-up-small-team-1",
    "source": "WeWorkRemotely",
    "date": "2025-12-06T12:49:39.757Z",
    "expires": "2025-12-13T12:49:39.757Z",
    "id": "live_WeWorkRemotely_1765025379757_0"
  },
  {
    "title": "Silverfin: Experienced Ruby Product Engineer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Gent, Belgium\n    \nURL: https://silverfin.com/\n\n\n\nWe start with the cliff notes about the position. If this appeals to you, continue reading for a longer text about working at Silverfin and your role \n \nAt Silverfin, we're an equal opportunity employer and value diversity at our company. Although we know we’re not perfect yet, we are working hard on it and always open for your feedback.\n \nAccording to our vision to build a diverse, equitable and inclusive organisation, our policy is to only make a final hiring decision if underrepresented groups are sufficiently represented in the list of candidates applying for the position. For this reason it’s possible interviews get slightly delayed until we’ve reached that goal.\n \nWe're committed to elevating talent by creating an environment where we can all thrive together. So if you think you have what it takes, but don't necessarily check every single box, please consider applying. We'd love to hear how you might contribute to our mission and our team.\nWhat can we offer you?\nActual, proper work-life balance\nFlexible working hours and work 100% remotely\nPersonal growth training and opportunities\nJoin a distributed remote-first engineering team with 40+ colleagues in 14 different countries on two continents\nA refreshing work environment with professional, friendly and welcoming colleagues\nA €1200 yearly budget for conferences, courses, workshops or other expenses that will improve your skills\nTwo engineering retreats per year, somewhere in Europe \nTen company-wide Wellbeing Days per year for all employees (once a month, except in July and August)\nCompensation\nFor this role, the compensation range is  €104.000 - €130.000 a year , which reflects the total compensation band for senior engineers at this level.\n \nPlease note:\nMost candidates start at the lower to mid part of the range, depending on experience and how their profile compares to our existing team. The higher end of the range is typically offered to individuals with a track record of strong impact and deep expertise in similar roles. We run annual compensation reviews, so there is clear opportunity for growth as you progress in the role.\nWhat will you work on?\nFigure out the best way to solve a customer or business problem in close collaboration with a product manager, a product designer and other engineers \nWork on user facing functionalities \nHelp with discovery and delivery of a solution \nGive the engineering perspective on potential ways of approaching a specific challenge \nHelp with maintenance and support of existing functionality\nWhat are we looking for?\nYou’re experienced in both Ruby and Rails, and also understand where the boundaries lie between them. You can code in Ruby without any of Rails’ training wheels if necessary.\nYou have experience using Javascript framework(s), understand the value of them, but also know when plain Javascript is enough.\nYou're interested in getting to know our customers to find the best solution for a given challenge. \nYou can communicate clearly in English, both in writing and verbally.\nYou’re up for mentoring coworkers and can give in-depth, productive feedback during code reviews. While you appreciate the small stuff, you recognise bike-shedding and can avoid its pitfalls.\nYou know and can apply best practices when relevant. That means the usual like version control, testing, and refactoring; but also higher level concepts such as good object oriented design.\nYou're aware of the trade-offs involved in proper engineering and can make balanced business decisions, keeping in mind all the stakeholders of the project.\nYou’ve got opinions on code design and you can discuss them, but you’re professional enough to not let those opinions get in the way of a consensus if necessary.\nIf you’re any good at Ruby, this is probably not the first job ad you’ve seen, so we’ve done our best to stand out while also accurately presenting what we’re all about. If it sounds like you would enjoy working with us, don’t hesitate to apply or drop us a line with questions , or read on for the more detailed explanation ..\n \nWhat’s a Silverfin?\nAt Silverfin we’re trying to apply the promise of software to the age-old industry of accounting. With our SaaS we’re automating a large chunk of the busy-work that accountants are currently handling manually, and are building new tools so they can provide better services to their customers. We aim to optimise their workflow in such a way that accountants can spend more time on the much more impactful and rewarding work of advising their customers, the business owners.\n \nThe good news is we’re succeeding in doing exactly that. Every week more than 15.000 financial service professionals use Silverfin to help and advise more than 400.000 businesses. Our customers adore us! The even better news is there’s still plenty left to work on, and that’s where we hope you come in.\n \nSince November 2023 we are proudly part of Visma - the European leader in mission-critical cloud software, enjoying the power of the Visma brand and resources whilst retaining business autonomy and go-to-market freedom.\n \nWhat’s the product team like?\nThe product team is a cross-functional team where engineers work together closely with product managers and product designers. The team's input is a user or business problem which it can solve with a high degree of autonomy. From day one all profiles are involved in understanding the problem, ideating solutions and doing quick experiments to prove that a certain solution might actually lead to the desired outcome. After the discovery phase the same team is tasked with the delivery of the chosen solution. The team will then track the adoption of the solution and will make sure that the problem is actually solved. The setup of the team is largely based on the book \"Inspired\" by Marty Cagan.\n \nWhat does working at Silverfin look like?\nNext to the four product teams, there are three more platformy teams, who own complex subsystems, like syncs or AI, and or support the product teams with knowledge, frameworks and services.\n \nOur ops team ensures things run smoothly, deploys happen correctly, and will work with you when issues should arise. We’re enthusiastic followers of the devops mindset, which means ops and developers work together to solve problems, and empower each-other to be self-sufficient, instead of throwing problems over the wall to the “other side”.\n \nWe run an up-to-date Rails monolith on the backend, with PostgreSQL and Redis for persistence and caching, and everything is running on a Kubernetes cluster in Google Cloud. Our daily tools include GitLab, Quip and Slack, with Google Meet as our remote conferencing tool of choice. \n \nNo code gets deployed without a code-review by a peer and testing is a must. Our pipeline automates deployment when the suite is green, and deploys happen dozens of times a day. Each team is currently doing Kanban, but they’re free to follow whatever process suits them best. There are regular retros held to work towards continuous improvement.\n \nSoftware for accountants is not considered to be very exciting, but we have our fair share of technical challenges. To give you a sense of scale: our database exceeds 10TB*, and our largest table has crossed the 10 billion row mark a long while back. We interface with more than 30 different external APIs, and provide third parties an API of our own.\n \n*: Our ops team noted that this actually isn’t that hard to achieve if you’re just indexing everything, but it still sounds impressive, right?\n \nWhat makes the engineering team at Silverfin special?\nWe’re a remote-first engineering team of 40 people distributed in 14 different countries over two continents. A priority for us is maintaining proper work-life balance. We avoid meetings as much as possible, accept deadlines only when absolutely necessary, and never expect anyone to work longer hours than they’ve signed up for. A day in our working lives is pretty boring, and we feel that’s exactly how it should be.\n \nWorking with us means you can be flexible with your schedule. It’s OK to disappear for a few hours in the middle of the day to run some errands, get a haircut, pick up the kids - whatever reason, you don’t need to explain yourself.\n \nYou also fully decide when you take time off: our team is sufficiently varied and well organised that there are always enough people around to handle the load, and in the rare cases it’s not, we will decrease the load instead of asking people to move their holiday.\n \nBeing remote-first means we favour asynchronous communication. We don’t shy away from chatting in Slack, but the important decisions or discussions are done in Gitlab issues, over email, or in Quip, so there’s a written, persisted record. We’re mindful of maintaining long chunks of focussed time, which means we avoid @-mentions or PMs on Slack, and other triggers and interrupts. We encourage using Slack’s DnD function, especially when you’re not working!\n \nWe’d be really happy to welcome you in our #engineering channel, but it’s not just virtual: we make sure we regularly get to see each other in real life too. Twice a year we fly the whole engineering team together to a different location in Europe, and at least once a year we join up with the rest of the company so we can spend some time together with the other departments.\n \nWhat does your future look like?\nPersonal growth is key to staying motivated. At Silverfin you don’t need to move to management in order to advance. We see the individual contributor track and the management track as two different growth paths which every engineer can follow and switch between. You can be promoted, including pay raises, as a contributor just like as a manager.\n \nEveryone has a €1200 yearly budget to spend on conferences, courses, workshops or other training to improve their skills and level up. This also includes accommodation, travel costs. If the conference is on a workday you’ll get paid like any normal day.\n \nRequirements\nYou have at least 4 years of experience working with Ruby, or 2 years of experience with Ruby and 4 years in one or more other programming languages\nYou have experience Javascript framework(s)\nYour work hours have some overlap with EU business hours (we require your local timezone to be within CET +/- 3h)\nYou can communicate clearly in English, both written and verbally\nNice to haves\nThese would be nice but are definitely not necessary. Don’t worry if none of the following applies to you.\nExperience as a remote worker in a fully remote team\nExperience working with large datasets and the problems they bring\nExperience with Vue.js\nExperience in Fintech\nAccounting knowledge\n \nInterested?\nYou can apply today and we’ll start having interviews from 24/11/2025. There’s no benefit to applying early, so you can take your time answering the application questions.\n \nRead about what our interviewing process looks like \n \nWe may use artificial intelligence (AI) tools to support parts of the hiring process, such as reviewing applications, analyzing resumes, or assessing responses. These tools assist our recruitment team but do not replace human judgment. Final hiring decisions are ultimately made by humans. If you would like more information about how your data is processed, please contact us.\nTo apply: https://weworkremotely.com/remote-jobs/silverfin-experienced-ruby-product-engineer",
    "url": "https://weworkremotely.com/remote-jobs/silverfin-experienced-ruby-product-engineer",
    "source": "WeWorkRemotely",
    "date": "2025-12-06T12:49:39.757Z",
    "expires": "2025-12-13T12:49:39.757Z",
    "id": "live_WeWorkRemotely_1765025379757_1"
  },
  {
    "title": "DynamiCare Health: Full-Stack Engineer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Boston, MA, USA\n    \nURL: https://dynamicarehealth.com\n\n\nRole Details & Compensation:\nAnnual salary range: $95,000–$115,000, plus equity\nUnlimited PTO policy and a flexible work schedule\nThis position is 100% remote, and applicants must be located in the United States.\nWhile the majority of your work will be performed during regular business hours, this role may occasionally require availability outside typical business hours.\nPlease note: DynamiCare Health does not currently offer medical benefits. While we plan to make this a benefit soon, it is not available at this time.\nRemote - Full time\nMust be physically located in the USA\nMust be authorized to work in the USA with no sponsorship required\n \nAbout Us\nDynamiCare Health is a digital therapeutics startup that helps people overcome addiction. In 8 peer-reviewed publications, DynamiCare increased quit rates for opioids, stimulants, alcohol, and tobacco by 2-4x compared to typical treatment. DynamiCare has won FDA Breakthrough Status and is already breaking into U.S. healthcare system reimbursement with partners that include the State of Rhode Island, Allegheny County of Pennsylvania, BCBS of Massachusetts, Horizon BCBSNJ, Spring Health, and Cityblock Health. \nWe understand that recovery isn't one-size-fits-all, which is why our platform provides the flexibility and continuous support needed for sustainable behavior change. We're transforming addiction care and helping more people reclaim their lives from substance use disorders. Through the Digital Recovery Platform, DynamiCare is bringing proven therapeutic approaches into the digital age, making recovery support available whenever and wherever our members need it most.\n \nAbout the job\nWorking as a Full-Stack Engineer at DynamiCare, you'll join a fully remote Agile team to design, build, and maintain secure, evidence-based applications. Since we're a small business, you'll have the opportunity to wear many different hats related to DevOps, Security, and other engineering-related fields. \nAs the primary developer at DynamiCare, you'll have ownership over the codebase, making this a huge opportunity for impact. There will also be room for growth in terms of leadership as the team expands, with potential to shape practices, mentor future developers, and take on greater responsibility in technical decision-making.\nWe are currently striving to expand our user base and increase retention rates, with a Series A funding round on the horizon. We use a Ruby on Rails application, which powers multiple subdomains and includes a REST API that supports our member-facing React Native mobile app, as well as an Analytics application utilizing ActionView, React, and Stimulus.\nWe believe DynamiCare is a great place to work. You'll collaborate in real time to make informed product decisions and play an active role in shaping the company's direction every day. We value your time and mental well-being, and we offer flexibility in working hours and time off. While there may be times when you need to jump in to resolve a critical bug, we strive to stay calm, focus on the root cause, and improve our workflows rather than place blame.\nHere are some examples of the work you might be doing at DynamiCare:\nMonitoring and responding to mobile and server package vulnerabilities, applying patches promptly, and evaluating whether they pose any risk to our users.\nRefactor Rails models to enhance feature development and data processing efficiency.\nImprove our appointment tracking features to include recurring appointments.\nMaintaining a probability engine used to schedule substance tests, ensuring functionality by writing a comprehensive suite of unit and integration tests.\nBuilding new serializers in Rails to help export data in XLSX or CSV format so that our team has insights on key metrics.\nCreating and maintaining new background jobs to improve the scalability and performance of our application.\nEnsuring data security, privacy, and compliance with HIPAA.\n \nAbout you\nWe’re seeking a candidate with a passion for technology and a motivation to make the world a better place.\nYour primary responsibilities will include full-stack development, DevOps, and maintaining strong data security across our platform. You should have at least three years of experience with our core frameworks: Ruby on Rails and React Native. Experience deploying and managing applications using CircleCI, Aptible, and AWS is especially valuable.\nExperience working within the confines of HIPAA and 42 CFR Part 2 is a strong plus, given the sensitive nature of our work. We’re also looking for someone familiar with Agile development, particularly Scrum and sprint-based workflows. Proficiency with collaboration and project management tools like Asana, Confluence, and Jira is important for staying aligned with the team.\nEven though you’re experienced, we don’t expect you to hit the ground running on day one. We value thoughtful onboarding and provide you with the time and support needed to learn our systems and processes. Strong communication is essential here, whether you're debugging code, collaborating with designers, or explaining technical concepts to non-technical teammates. \nWe also foster a collaborative environment where every voice is heard, and respectful dialogue and constructive feedback are encouraged. Our shared goal is to build a product that helps people recover from addiction, and we believe that happens best when everyone works together with openness and clarity.\nA Computer Science degree or equivalent is not required for this position. If you have the chops and the skills needed to do the job well, that’s all that matters.\nWhile you’ll report to our Director of IT & Engineering, we strongly believe in autonomy here at DynamiCare. It’s vital that you know how to manage your time, and we trust that you will as well. Investing the time and effort here will help advance your career and expose you to new and exciting challenges.\nThis position is remote and operates on Eastern Time. You’re free to work wherever you succeed the most: whether it be at home or in a coffee shop. We are hiring from anywhere in the United States.\n \nTech Stack\nMobile\n\nReact Native using Expo\nSDK Integrations\nServer \n\nRuby on Rails\nAWS\n\nS3\nQuickSight\nAptible\nPostgreSQL\nData Security\n\nHIPAA Compliance\nDevOps\n\nGitHub\nCircleCI\nDocker\nDatadog\nSentry\n \nHow to apply\nPlease submit your application with a resume, a GitHub link, and a cover letter that tells us who you are and what you can offer to DynamiCare, as well as our company’s role in your career and future.\nInterview Process\nWe aim to make a hiring decision by August 31, 2025. All interviews will be conducted over Zoom. The process includes four stages:\nInitial Screening – A brief call to learn more about your background and interest in the role.\nInterview with Direct Manager – A deeper discussion about your experience and technical alignment with the team.\nInterview with CEO and Head of Product Design – Focused on company vision, product thinking, and cross-functional collaboration.\nCoding Challenge – A live technical exercise to evaluate your problem-solving skills and coding approach.\nWe value your time and strive to keep the process efficient, respectful, and transparent. You can expect each interview stage to be scheduled approximately 24–48 hours apart during business days.\nTo apply: https://weworkremotely.com/remote-jobs/dynamicare-health-full-stack-engineer",
    "url": "https://weworkremotely.com/remote-jobs/dynamicare-health-full-stack-engineer",
    "source": "WeWorkRemotely",
    "date": "2025-12-06T12:49:39.757Z",
    "expires": "2025-12-13T12:49:39.757Z",
    "id": "live_WeWorkRemotely_1765025379757_2"
  },
  {
    "title": "WPForms: WordPress Full-Stack Developer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: West Palm Beach, Florida, United States\n    \nURL: https://wpforms.com/\n\n\n\n\nAs a WordPress Developer at WPForms, you'll work on a diverse team that builds & supports a wide-range of websites. We’re looking for someone with experience in eCommerce and multiple payment gateways, with a mind for troubleshooting payment and subscription issues.\nAt WPForms, it’s not just our products that stand out. Our websites are the engines that power our customer experience and many of our products' extended features. We’re looking for a qualified full-stack WordPress Developer to join that team.\nOur sites don’t just power sales, they extend product functionality using a variety of cloud technologies based in PHP and JavaScript. We need curiosity-driven developers to help us build the next generation of features. You’ll share the ownership and success of website projects with the team, where everyone shares ideas on the technical details of achieving those goals.\nYour responsibilities will occasionally expand beyond WordPress to support a wide variety of ancillary installations and technologies. We’ve got a lot going on, and we want your help. This includes maintaining and extending existing functionality, optimizing for performance, and securing our codebase. You’ll be responsible for testing your own work and contributing to the reviews of your peers' work as well. We believe in a collaborative environment where your ideas are valued and your growth is supported.\nThis role is perfect for a developer with a strong understanding of WordPress architecture and a desire to build scalable, secure, and high-performing websites. If you're a problem-solver who thrives in a fast-paced environment and is passionate about writing clean, efficient code, we encourage you to apply!\nRequirements\nExtremely familiar with WordPress and all of its idiosyncrasies.\nExperience leveraging and integrating with 3rd Party APIs\nCoding with modern PHP practices (OOP, autoloading, namespacing, traits, interfaces, etc).\nJavaScript experience of many flavors (vanilla JS, jQuery, ES6, etc)\nFamiliar with package managers (Composer & NPM)\nExcellent attention to detail in HTML & CSS/SCSS for great looking sites.\nBranching & merging workflows and strategies with git & Github.\nYou’re AI-savvy, comfortable using AI tools (Claude Code, Cursor, Co-Pilot, etc.) as part of your daily routine and always looking for ways to leverage AI effectively.\nWordPress eCommerce experience\neCommerce payment experience including Stripe and/or PayPal\nComfortable writing performant SQL queries for MySQL\nWP-CLI proficiency and Linux/Shell scripting skills with the ability to support occasional DevOps tasks.\nA curious mind, great at troubleshooting\nWillingness to learn!\nBonus points if you also have:\nExperience creating custom blocks for the Gutenberg (block) editor\nFamiliarity with Continuous Integration / Continuous Deployment (CI/CD) systems\nBenefits\nWorking for a fast-growing bootstrapped company is a rare opportunity, one we consider a lifestyle choice rather than a job choice. Our positions are challenging, but also come with amazing advantages and fulfillment to those who earn them. Here’s what we offer.\nCompetitive Salary\nTerm Life Insurance and Accidental Death & Dismemberment for all full-time team members during their employment.\nHealth, Dental, and Vision Insurance benefits for full-time U.S. employees.\nHealth Insurance benefits for all employees in India, Pakistan, Brazil, Philippines, Ukraine, Poland, Romania, Nepal, Kenya, Mexico, Nigeria, Spain, Argentina & Jamaica.\nWork from your home. We’re spread out all over the world – United States, Canada, Ukraine, India, Pakistan, Singapore, and more.\nFlexible PTO after 90 days of employment. We encourage employees to take the time they need for a vacation, stay healthy, and spend time with friends and family.\nHolidays (based on your location)\nPaid Parental Leave.\nWe happily provide or reimburse software you’ll need as well as books or courses that promote continued learning.\nWe cover all costs of company travel (including our annual all-company retreat and mini-team meetups).\nAdditional Perks include AM Welcome Box for new team members, Yearly Anniversary Gifts, and Technology Stipend each work anniversary.\nWe give you the opportunity to solve challenging and meaningful problems that make a difference.\nAbility to work with some of the best people in the business through frequent, if not daily, interactions.\nAnd in case you were wondering: no politics, no b.s., and no jerks.\nLocation\nThis is a remote position - our team is spread around the globe! Our home base is in Florida, USA, so company operating hours are 9am - 5pm ET (UTC -5). While full coverage is not a requirement, you must be available during a portion of the day.\nInclusion Statement\nAt Awesome Motive, we strive to have the broadest possible view of diversity, going beyond visible differences to include the background, experiences, skills, and perspectives that make each person unique. Awesome Motive is proud to be an equal opportunity workplace and is committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, veteran status, or any other basis protected by federal, state, or local law.\nHow to apply?\nIf all of this sounds interesting, then please submit your application!\nClearly include the following in your cover letter\nTell us a bit about yourself and why you should be considered. Details about your experience, qualifications, personality, etc are very helpful.\nWhat is your favorite WordPress hook/function and why.\nWhat’s something you recently learned that got you excited?\nAlso note, don't forget to proofread before submitting. Check spelling, capitalization, etc. This is your chance to make your application stand out :)\nAwesome Motive is AI first and we welcome the use of AI - however, our core value of “Paying Attention To Details” means you must proofread everything and take extra care to ensure all sentiments are indeed your own.\nWe won’t be able to individually respond to all applications, but if we feel you’re a strong match, someone will be in touch shortly.\nThanks and we look forward to hearing from you!\nTo apply: https://weworkremotely.com/remote-jobs/wpforms-wordpress-full-stack-developer",
    "url": "https://weworkremotely.com/remote-jobs/wpforms-wordpress-full-stack-developer",
    "source": "WeWorkRemotely",
    "date": "2025-12-06T12:49:39.757Z",
    "expires": "2025-12-13T12:49:39.757Z",
    "id": "live_WeWorkRemotely_1765025379757_3"
  },
  {
    "title": "DesignFiles: Remote Front-End Rails Developer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Remote\n    \nURL: https://designfiles.co\n\n\nAt DesignFiles, we’re looking for a Front-End Rails Developer with strong JavaScript and UI skills to help shape and improve the creative tools at the heart of our platform.\nAbout Us:\nAt DesignFiles, we’re building the go-to platform for interior designers to manage every part of their business—from concept to completion. More than 5,500 customers already rely on our tools, and our remote team of 30+ is growing. If you care about building great products that solve real problems, we’d love to meet you.\nWhat You'll Do:\nHelp guide the evolution of our Design/Presentation Editor into a modern, Canva-style experience that supports moodboards, room mock-ups, client presentations, reusable templates, and more.\nBuild intuitive, high-performance UI components for core editing interactions: drag-and-drop, layering, resizing, grouping, alignment, snapping, canvas navigation, and on-canvas text/image editing.\nCollaborate closely with product and design to translate complex user needs into seamless creative workflows.\nShape the architecture and structure of our editor so it's fast, scalable, and easy to maintain as it grows.\nContribute to a high-quality, design-forward experience that feels just as good as tools like Canva or Figma — but purpose-built for interior designers.\nParticipate in team rituals like daily standups, sprint planning, and retrospectives.\nWhat We're Looking For:\nStrong vanilla JavaScript skills, including DOM/event handling, canvas or SVG rendering, and performance optimization.\nExperience building or contributing to visual editors, creative tools, or browser-based design software is a strong plus.\nDeep understanding of CSS, with hands-on experience using Tailwind or a similar utility-first framework.\nProficient with Stimulus.js, Turbo, Hotwire, ViewComponents, and the modern Rails front-end stack.\n3+ years of hands-on Ruby on Rails development experience.\nTakes full ownership of features from concept to deployment—driving high-quality, scalable implementations.\nFluent English and clear, professional communication skills.\n \nThis is a full-time, 40-hour/week remote contract role. We’re specifically seeking candidates (not agencies) based within ±2 hours of Central European Time (CET).\nIf you’ve built or contributed to browser-based editors or creative tools—and care about crafting fast, intuitive, design-friendly experiences—we’d love to talk.\n \nTo apply: https://weworkremotely.com/remote-jobs/designfiles-remote-front-end-rails-developer",
    "url": "https://weworkremotely.com/remote-jobs/designfiles-remote-front-end-rails-developer",
    "source": "WeWorkRemotely",
    "date": "2025-12-06T12:49:39.757Z",
    "expires": "2025-12-13T12:49:39.757Z",
    "id": "live_WeWorkRemotely_1765025379757_4"
  },
  {
    "title": "DesignFiles: Remote Growth Engineer (Full-Stack Rails)",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Remote\n    \nURL: https://designfiles.co\n\n\nAt DesignFiles, we’re looking for a Growth Engineer with strong full-stack Rails experience to join our product engineering team.\nAbout Us:\nAt DesignFiles, we’re building the go-to platform for interior designers to manage every part of their business—from concept to completion. More than 5,500 customers already rely on our tools, and our remote team of 30+ is growing. If you care about building great products that solve real problems, we’d love to meet you.\nWhat You'll Do:\nAs a Growth Engineer, you’ll sit at the intersection of engineering, product, and growth. You’ll ship features and run experiments that directly impact customer activation, retention, and monetization. Your work won’t just be about building—it’ll be about measuring, iterating, and optimizing.\nRun experiments that improve activation, retention, and monetization.\nCollaborate with product, design, and marketing to test and refine onboarding flows, funnels, and client engagement touchpoints.\nUse data to uncover friction points in the user journey and ship small, high-impact improvements.\nTake ownership of experiments end-to-end: scope, build, ship, measure, and iterate.\nRefine existing features to boost adoption and stickiness.\nContribute to a culture of clean code, rapid iteration, and measurable outcomes.\nParticipate in team rituals like daily standups, sprint planning, and retrospectives.\nWhat We're Looking For:\n5+ years of hands-on Ruby on Rails experience with strong full-stack skills.\nProficiency with JavaScript, Stimulus.js, CSS, RSpec, SQL, Docker, Unix Shell.\nExperience with A/B testing, growth-focused engineering, and/or optimizing onboarding funnels.\nStrong problem-solving skills and ability to self-unblock.\nFluent English and solid communication skills.\nTeam-oriented and comfortable with collaboration, idea-sharing, and code reviews.\n\nThis is a full-time, 40-hour/week remote contract role. We’re specifically seeking candidates (not agencies) based within ±2 hours of Central European Time (CET).\nIf you’ve got a portfolio of high-impact experiments or user-facing improvements you’ve shipped and iterated on, we’d love to talk.\n \nTo apply: https://weworkremotely.com/remote-jobs/designfiles-remote-growth-engineer-full-stack-rails",
    "url": "https://weworkremotely.com/remote-jobs/designfiles-remote-growth-engineer-full-stack-rails",
    "source": "WeWorkRemotely",
    "date": "2025-12-06T12:49:39.757Z",
    "expires": "2025-12-13T12:49:39.757Z",
    "id": "live_WeWorkRemotely_1765025379757_5"
  },
  {
    "title": "Toptal: React/Node Developer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Remote\n    \nURL: https://www.toptal.com/\n\n\n\n\nSummary\nClient's team builds Mail for Android, iOS, and Web, serving 200M+ users across 40+ countries in 70 languages. As one of the largest email services globally, we deliver 4.5B+ emails daily with top-rated mobile apps. Mail is a key part of our long-term growth, and we're dedicated to providing the best user experience.\nAbout the Project\nWe're modernizing our webmail experience to enhance user satisfaction and compete with industry leaders. The team oversees webmail, mobile web, and the classic web version.\n\nRemote | 6-12 months | 40 hrs/week (preferred), part-time possible\nClient-provided MacBook\nResponsibilities\nProvide technical leadership in a fast-paced environment\nEnforce best practices: design reviews, code reviews, CI/CD, TDD\nDevelop high-quality, high-performance features using Node.js/React.js\nCollaborate with designers, product managers, and engineers\nWrite testable, reliable code and deploy continuously\nOptimize application performance and scalability\nOperate and monitor global-scale production systems\nRequirements\nBS in Computer Science (or equivalent) with 6+ years of experience\nStrong CS fundamentals: data structures, algorithms, software design\nExpertise in React, Redux, Node.js, and responsive design\nProficiency in AJAX, HTML5, CSS3, TypeScript, and modern JavaScript\nExperience with Web Technologies (Node, HTTP, JSON, Webpack, Babel)\nTDD experience with Jest, WebdriverIO, Enzyme, Protractor, React Testing Library\nPreferred:\nExperience developing mail applications\nMobile web development expertise\nFamiliarity with Agile methodologies (Scrum, Squad, etc.)\nTo apply: https://weworkremotely.com/remote-jobs/toptal-react-node-developer",
    "url": "https://weworkremotely.com/remote-jobs/toptal-react-node-developer",
    "source": "WeWorkRemotely",
    "date": "2025-12-06T12:49:39.757Z",
    "expires": "2025-12-13T12:49:39.757Z",
    "id": "live_WeWorkRemotely_1765025379757_6"
  },
  {
    "title": "Mobena: Frontend Engineer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: New York, NY\n    \nURL: https://mobena.co/\n\n\nMobena is a three-person, remote-first startup building the “evolution” of multi-generational tax/estate planning software, targeting the advisors of America’s 2 million wealthiest families. We’re currently hiring our first dedicated UI Engineer to “own” the frontend of our flagship product, Mobena Evolution, for which we have little to no frontend code. You’ll work directly with our backend/algorithm-focused CTO, as well as our designer-founder, to turn evolving Figma concepts into fast, maintainable, and scalable user interfaces.\nWhat You’ll Do\nChoose and justify the frameworks and tools that best fit our needs.\nWe have some holdover prototype code in Vite JS, but you can take it or leave it; all of our Figma concepts are new.\nThe backend is a standard HTTP API. We are open to everything from established web stacks (React, Angular, Svelte, Vite) to cross-platform or native solutions (Qt, WASM, .NET MAUI, Tauri, Electron, Tk)—literally anything, if you can convince us it’s the right choice.\nBuild our UI from the ground up, establishing clear, maintainable patterns for components, state management, styling, testing, performance, and accessibility.\nCollaborate to refine and sometimes re-frame existing screen designs in Figma.\nConnect the frontend to our APIs (REST, GraphQL, or similar).\nLay groundwork for future mobile clients; however, experience in this regard is a plus rather than a requirement.\nAbout You\nYou’ve shipped an interactive application—web, desktop, or mobile—via coursework, open source, side project or professional work.\nYou care about usability and design quality. (That is, you care about the user.)\nYou learn by doing: building things rather than sitting in committee.\nYou are happy to say I don’t know. We try to cultivate “beginner’s mind” at Mobena—it helps us avoid conventional traps and groupthink. The first step of thinking like a beginner is acknowledging your own ignorance! 😊\nYou can defend your technical choices in clear English, and can take credit for your successes as well your mistakes.\nYou are comfortable in an early-stage, collaborative environment.\nTo apply: https://weworkremotely.com/remote-jobs/mobena-frontend-engineer",
    "url": "https://weworkremotely.com/remote-jobs/mobena-frontend-engineer",
    "source": "WeWorkRemotely",
    "date": "2025-12-06T12:49:39.757Z",
    "expires": "2025-12-13T12:49:39.757Z",
    "id": "live_WeWorkRemotely_1765025379757_7"
  },
  {
    "title": "Software Engineer - Remote",
    "company": "CodeCraft Inc",
    "description": "New Software Engineer position available. Remote work with competitive compensation and benefits. Apply now for immediate consideration.",
    "url": "https://stackoverflow.com/jobs/1765025380299_0",
    "source": "StackOverflow",
    "date": "2025-12-06T12:49:40.299Z",
    "expires": "2025-12-13T12:49:40.299Z",
    "id": "fallback_StackOverflow_1765025380299_0"
  },
  {
    "title": "Mobile Developer - Remote",
    "company": "AppInnovators",
    "description": "New Mobile Developer position available. Remote work with competitive compensation and benefits. Apply now for immediate consideration.",
    "url": "https://stackoverflow.com/jobs/1765025380299_1",
    "source": "StackOverflow",
    "date": "2025-12-06T12:49:40.299Z",
    "expires": "2025-12-13T12:49:40.299Z",
    "id": "fallback_StackOverflow_1765025380299_1"
  },
  {
    "title": "Data Scientist - Remote",
    "company": "Analytics Pro",
    "description": "New Data Scientist position available. Remote work with competitive compensation and benefits. Apply now for immediate consideration.",
    "url": "https://stackoverflow.com/jobs/1765025380299_2",
    "source": "StackOverflow",
    "date": "2025-12-06T12:49:40.299Z",
    "expires": "2025-12-13T12:49:40.299Z",
    "id": "fallback_StackOverflow_1765025380299_2"
  }
]