[
  {
    "title": "Toptal: Lead Mobile Developer/ Tech Lead",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Remote\n    \nURL: https://toptal.com\n\n\n\n\nJob Description\nOur client is a global media and tech company that connects people to their passions. We reach nearly 900M people around the world, bringing them closer to what they love—from finance and sports to shopping, gaming and news—with the trusted products, content, and tech that fuel their day.\nAbout the Role:\nWe’re seeking a seasoned Lead Mobile Developer/ Tech Lead with experience to guide mobile development efforts across both Android and iOS platforms. This role combines strong technical expertise with leadership skills to deliver high-quality, performant mobile applications and coordinate effectively with cross-functional teams.\nResponsibilities:\nLead mobile development initiatives for Android and iOS platforms.\nCollaborate with other teams to define features, plan implementations, and ensure project alignment.\nArchitect and oversee bespoke feature implementations, ensuring maintainability and scalability.\nEnsure structured communication across engineering and product teams.\nGuide the team in technical decision-making and problem-solving.\nOversee feature delivery, from planning to release, ensuring high performance and code quality.\nRequirements\n8–10 years of professional mobile development experience in Android and iOS\nStrong Kotlin and Android development background, including Jetpack Compose\nProficiency in iOS development (Swift)\nFamiliarity with state management patterns (Flux or similar).\nExperience in performance optimization for mobile applications.\nStrong background in mobile app performance optimization.\nExcellent problem-solving and communication skills.\nNice to have:\nExperience with cross-platform architectural decision-making.\nPrior leadership in a multi-platform mobile team.\nEngagement Highlights:\n- Long term (12+ months ) and full-time opportunity\n- Commitment: We prefer full-time (40 hr/week) but open to considering part-time who can ramp up to full-time in 3-4weeks.\n- Overlap: 5+ hours with PST\nTo apply: https://weworkremotely.com/remote-jobs/toptal-lead-mobile-developer-tech-lead",
    "url": "https://weworkremotely.com/remote-jobs/toptal-lead-mobile-developer-tech-lead",
    "source": "WeWorkRemotely",
    "date": "2025-12-01T18:41:58.873Z",
    "expires": "2025-12-08T18:41:58.873Z",
    "id": "live_WeWorkRemotely_1764614518873_0"
  },
  {
    "title": "Toptal: Backend Java Developer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Remote\n    \nURL: https://toptal.com\n\n\n\nDescription\nOur client is a global media and tech company that connects people to their passions. We reach nearly 900M people around the world, bringing them closer to what they love—from finance and sports to mail, shopping, gaming and news—with the trusted products, content, and tech that fuel their day.\nWe continue to be one of the largest and most recognizable email services in the world. Delivering over 4.5B emails daily, and with consistently top-rated mobile apps. Our Mail is a critical pillar in the company’s long-term growth strategy.\nAbout the Role:\nWe are looking for experienced Back-end Java Developer to join our team and work with one of the leading Mail platform in the world.\nWe are working on a partner migration of our core mail services. Therefore we need to be cloud agnostic, lift and shift existing functionality to the cloud. This involves moving all our applications, code, platforms, and infrastructure to the cloud, optimizing it and modernizing it for future growth.\nAbout You:\nYou are passionate about growing your skills and value high quality application development on modern tech stack and cloud. You will enjoy building the next generation of communication products, web and mobile platforms. You are interested in how best to drive tasks to completion, collaborate to achieve your goals, think through scenarios and edge cases, learn from your leadership, and understand the broader impact of your work.\nIf you are interested in joining a world-class team of passionate people and industry veterans who care about code quality, architecture, design and user experience as much as having fun together, then we’d like to talk to you.\nTasks and Deliverables:\nDevelop and maintain Java-based applications on cloud-based platforms.\nMigration of Java applications and core mail services\nIdentify and implement optimizations, fine-tune / re-architect infrastructure\nIntegration with existing DevOps and CICD pipelines/environments\nImprove future maintainability of the platform and surrounding tools\nDesign and implement solutions that meet business requirements, ensuring scalability, security, and reliability.\nWork with cross-functional teams to develop and deploy complex applications on AWS/GCP.\nLead and mentor other engineers throughout design and development\nRequirements\nStrong back-end experience in software development using Java Object-oriented programming skills\nStrong knowledge of RESTful APIs and microservices architecture\nExperience with AWS or GCP\nUnderstanding of data structures and algorithms\nExperience with Distributed Systems and Large Scale Systems\nStrong computer science fundamentals and knowledge of Design Patterns\nAnalytical and problem solving skills\nSQL and RDS Database\nNice to Have Experience:\nExperience with DevOps tools and practices\nLeadership experience\nEngagement Highlights:\n- Commitment: We prefer full-time (40 hr/week) but open to considering part-time who can ramp up to full-time in 3-4 weeks.\n- Overlap: 6+ hours with PST\n- Client will be sending their own laptop (MacBook) to the talent to use\nTo apply: https://weworkremotely.com/remote-jobs/toptal-backend-java-developer",
    "url": "https://weworkremotely.com/remote-jobs/toptal-backend-java-developer",
    "source": "WeWorkRemotely",
    "date": "2025-12-01T18:41:58.873Z",
    "expires": "2025-12-08T18:41:58.873Z",
    "id": "live_WeWorkRemotely_1764614518873_1"
  },
  {
    "title": "UnitedHealth Group: Software Architect - Hybrid in Minneapolis, MN or Remote",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Minnesota\n\n\nhackajob is collaborating with UnitedHealth Group to connect them with exceptional tech professionals for this role.\n\n Optum is a global organization that delivers care, aided by technology to help millions of people live healthier lives. The work you do with our team will directly improve health outcomes by connecting people with the care, pharmacy benefits, data and resources they need to feel their best. Here, you will find a culture guided by inclusion, talented peers, comprehensive benefits and career development opportunities. Come make an impact on the communities we serve as you help us advance health optimization on a global scale. Join us to start Caring. Connecting. Growing together.\n  \n As a Software Architect at Optum Serve, you will be responsible for designing and implementing robust, scalable, and high-performance software solutions. You will work closely with the Business Architecture Analyst to break down conceptual designs into Software Architecture Diagrams, then work with cross-functional teams to ensure that our applications meet the highest standards of quality and performance. Your expertise in modern design patterns, cloud-native architectures, and Microsoft Azure will be crucial in driving our projects to success.\n  \n You ll enjoy the flexibility to work remotely from anywhere within the U.S. as you take on some tough challenges.\n  \n Primary Responsibilities:\n  \nDesign and develop software architectures using modern design patterns such as SOLID principles and Domain-Driven Design (DDD)\n Collaborate with development teams to create high-quality, maintainable code using .NET and Angular\n Provide technical leadership and mentorship to software engineers, promoting best practices and continuous improvement\n Conduct architectural reviews and ensure alignment with business goals and technical requirements\n Stay up-to-date with the latest industry trends and technologies, and apply them to improve our software solutions\n Work closely with stakeholders to understand their needs and translate them into technical solutions\n  \n  \nYou ll be rewarded and recognized for your performance in an environment that will challenge you and give you clear direction on what it takes to succeed in your role as well as provide development for other roles you may be interested in.\n Required Qualifications:\n  \n8+ years of overall experience in Software design, engineering, and architecture\n 4+ years of experience in an Architect role \n Experience leveraging AI tools in the software development lifecycle in order to improve quality and efficiency\n Experience as a Software Architect or similar role, with a background in software development\n Proficiency in .NET and Angular frameworks\n Solid understanding of networking principles in Cloud environments\n Solid understanding and application of Domain-Driven-Design and Event-Driven-Architecture \n Expertise in modern design patterns, including SOLID principles and Domain-Driven Design (DDD)\n Extensive experience with cloud-native architectures and Microsoft Azure\n Experienced with microservices architecture \n Experienced with containerization and orchestration tools (e.g., Docker, Kubernetes)\n Solid knowledge of integration technologies, middleware, and protocols\n Familiarity with Enterprise Service Bus (ESB) and messaging systems\n Experience with building relationships with business leaders\n If you are offered this position, you will be required to provide extensive personal information to obtain and maintain a suitability or determination of eligibility for a Confidential/Secret or Top Secret security clearance as a condition of your employment\n U.S Citizenship \n  \n  \nPreferred Qualifications: \n  \nBachelor s or Master s degree in Computer Science, Software Engineering, or a related field\n Excellent communication and collaboration skills\n Solid problem-solving skills and the ability to think critically and creatively\n  \n  \nConditions:\n  \nThis position will support Optum Serve s performance of a United States (U.S.) Government contract and will require the successful applicant to access and/or process Non Critical Sensitive information (Personally Identifiable Information PII /Protected Health Information PHI ) from or contained in a U.S. Government IT system\n To fulfill the data and IT system access requirements for this position, the successful applicant will be required to successfully complete a Trustworthy Determination, which will require the successful applicant to: 1) be a U.S. citizen 2) pass a National Agency Check with law enforcement in order to obtain the access privileges required by the position and 3) pass a Credit Check in order to obtain the access privileges required by the position.\n  \n  \n All employees working remotely will be required to adhere to UnitedHealth Group s Telecommuter Policy.\n  \n Pay is based on several factors including but not limited to local labor markets, education, work experience, certifications, etc. In addition to your salary, we offer benefits such as, a comprehensive benefits package, incentive and recognition programs, equity stock purchase and 401k contribution (all benefits are subject to eligibility requirements). No matter where or when you begin a career with us, you ll find a far-reaching choice of benefits and incentives. The salary for this role will range from $110,200 to $188,800 annually based on full-time employment. We comply with all minimum wage laws as applicable. \n  \n Application Deadline: This will be posted for a minimum of 2 business days or until a sufficient candidate pool has been collected. Job posting may come down early due to volume of applicants.\n  \n At UnitedHealth Group, our mission is to help people live healthier lives and make the health system work better for everyone. We believe everyone of every race, gender, sexuality, age, location and income deserves the opportunity to live their healthiest life. Today, however, there are still far too many barriers to good health which are disproportionately experienced by people of color, historically marginalized groups and those with lower incomes. We are committed to mitigating our impact on the environment and enabling and delivering equitable care that addresses health disparities and improves health outcomes an enterprise priority reflected in our mission.\n  \n  \n UnitedHealth Group is an Equal Employment Opportunity employer under applicable law and qualified applicants will receive consideration for employment without regard to race, national origin, religion, age, color, sex, sexual orientation, gender identity, disability, or protected veteran status, or any other characteristic protected by local, state, or federal laws, rules, or regulations.\n  \n UnitedHealth Group is a drug free workplace. Candidates are required to pass a drug test before beginning employment.\n\n\nTo apply: https://weworkremotely.com/remote-jobs/unitedhealth-group-software-architect-hybrid-in-minneapolis-mn-or-remote",
    "url": "https://weworkremotely.com/remote-jobs/unitedhealth-group-software-architect-hybrid-in-minneapolis-mn-or-remote",
    "source": "WeWorkRemotely",
    "date": "2025-12-01T18:41:58.873Z",
    "expires": "2025-12-08T18:41:58.873Z",
    "id": "live_WeWorkRemotely_1764614518873_2"
  },
  {
    "title": "Zencastr: Senior Fullstack Developer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Zencastr\n    \nURL: https://zencastr.com\n\n\nEmpower the voices of the world @ Zencastr. If you want to push the world of podcasting into the future, come join a team who loves to live on the edge! We are a fully distributed team of smart people who are passionate about changing the world one voice at a time.\n \nYou should join us if you:\nHave significant experience with Node.js and good knowledge of JS fundamentals\nHave a good understanding of computer science fundamentals. You might not have gone to school for it, but you know the difference between heap and stack, different time complexities, and which patterns to use and when.\nYou are ambitious. You might want to build your own company one day or have tried to tackle the toughest tech problems just for fun.\nYou enjoy writing Javascript or Typescript\nYou have an eye for performance. Whether thinking about the latest client side bundling techniques, or the proper way to shard a mongo database, you want things to be fast.\nYou are just as comfortable working in a browser context or a node.js runtime\nYou are a team player\nYou have good communication skills\nWhat sets you apart:\nYou have a passion for high performance applications\nYou have significant open source contributions\nYou want to work in a fast growing startup. Which comes with the blood, sweat and tears of working to disrupt an established industry\nYou have empathy for the end user. A spec is a conversation starter, as an advocate for the end user you always are thinking about how to best serve their needs\nYou have an eye for code quality and you strive to uphold best practices in engineering, security, and design\nWhy you should choose us:\nYou’ll be working with world class engineers, Phd’s, and designers in a fully distributed team\nWork in an agile and fast changing environment\nEquity commensurate to your contribution in a profitable company\nHealth insurance\nUnique challenges and the support and talent to solve them\n4 weeks PTO\nFreedom to work where you please\nWhat we’re looking for:\n5+ years of Typescript, React, Node.js development\nStrong document / key-value store knowledge (Redis, MongoDB)\nStrong SQL knowledge\nStrong HTML / CSS / React knowledge\nDemonstrable knowledge of building scaleable consumer based apps\nStrong experience with unit, integration, and load testing\nExperience building APIs\nExperience with cloud APIs (Google Cloud, Digital Ocean)\nBonus points if you have:\nExperiencing working in high traffic, low latency applications\nGood dev ops experience\nDigital Signal Processing experience\nStrong SQL knowledge\n \nHow to apply:\nApply at https://jobs.ashbyhq.com/zencastr/c4c91cc0-c5f9-4773-ab04-d239f9455aee\nWe are flexible! For the right candidate we ask: What do you need to do your best work?\nTo apply: https://weworkremotely.com/remote-jobs/zencastr-senior-fullstack-developer",
    "url": "https://weworkremotely.com/remote-jobs/zencastr-senior-fullstack-developer",
    "source": "WeWorkRemotely",
    "date": "2025-12-01T18:41:58.873Z",
    "expires": "2025-12-08T18:41:58.873Z",
    "id": "live_WeWorkRemotely_1764614518873_3"
  },
  {
    "title": "Speechify Inc: Software Engineer, iOS Core Product",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Florida\n    \nURL: http://www.speechify.com\n\n\nOverview\nWith the growth of our iOS app, being the #18 productivity app in the App Store category and also our recent recognition as Apple's 2025 Design Award for inclusivity, we find the need for a Senior iOS Engineer to help us support the new user base as well as work on new and exciting projects to push our missing forward.   \nThis is a key role and ideal for someone who thinks strategically, enjoys fast-paced environments, passionate about making product decisions, and has experience building great user experiences that delight users.\nWe are a flat organization that allows anyone to become a leader by showing excellent technical skills and delivering results consistently and fast. Work ethic, solid communication skills, and obsession with winning are paramount. \nOur interview process involves several technical interviews and we aim to complete them within 1 week. \nWhat You’ll Do\nOpportunity to lead key engineering and product decisions\nActively shipping production code for the Speechify iOS app\nWork within a dedicated product team\nParticipate in product discussions to shape the product roadmap\nMaintain and enhance the existing complex app architecture\nAn Ideal Candidate Should Have\nExperience. You've worked on products that scaled to a large user base\nTrack record. You have worked on various products from inception to decent traction. You have been responsible for engineering the product\nCustomer obsession. We expect every team member whose responsibilities directly impact customers to be constantly obsessed about providing the best possible experience\nProduct thinking. You make thoughtful decisions about the evolution of your product and support internal teams and designers into taking the right direction\nSpeed. You work quickly to generate ideas and know how to decide which things can ship now and what things need time\nFocus. We’re a high-growth startup with a busy, remote team. You know how and when to engage or be heads down\nTechnical skills. Swift, SwiftUI\nTechnical Requirements:\nSwift Programming Language\nSwiftUI experience\nExperience in Multithreading Programming\nWorking with CI/CD infrastructure\nExperience with Fastlane\nSOLID principles, the ability to write every single class according to SOLID\nExperience with Git and understanding of different Git strategies\nWhat We offer:\nA fast-growing environment where you can help shape the company and product\nAn entrepreneurial crew that supports risk, intuition, and hustle\nThe opportunity to make a big impact in a transformative industry\nA competitive salary, a collegiate atmosphere, and a commitment to building a great asynchronous culture\nWork on a product that millions of people use and where daily feedback includes users sharing that they cried when they first found the product because it was so impactful on their lives\nSupport people with learning differences like Dyslexia, ADD, Low Vision, Concussions, Autism, and Second Language Learners, and give reading superpowers to professionals all over the world\nWork in one of the fastest growing sectors of tech: Intersection of Artificial Intelligence and Audio\nThink you’re a good fit for this job? \nTell us more about yourself and why you're interested in the role when you apply.\nAnd don’t forget to include links to your portfolio and LinkedIn.\nNot looking but know someone who would make a great fit? \nRefer them! \nSpeechify is committed to a diverse and inclusive workplace. \nSpeechify does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status.\nTo apply: https://weworkremotely.com/remote-jobs/speechify-inc-software-engineer-ios-core-product",
    "url": "https://weworkremotely.com/remote-jobs/speechify-inc-software-engineer-ios-core-product",
    "source": "WeWorkRemotely",
    "date": "2025-12-01T18:41:58.873Z",
    "expires": "2025-12-08T18:41:58.873Z",
    "id": "live_WeWorkRemotely_1764614518873_4"
  },
  {
    "title": "Toggl: Senior Backend Engineer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Tallinn, Estonia\n    \nURL: https://toggl.com/jobs/\n\n\n \nWe are looking for experienced Senior Backend Engineers who bring unique skills to our team and help us shape the future of the time tracking industry.\nThe salary for this position is €80,000 annually.\nYou can work from anywhere in the world as long as your main location is between UTC-4 and UTC+8.\nOur team meetings are scheduled between 11:00 and 16:00 UTC. Your availability and commitment to participate in these sessions are essential for effective collaboration and team alignment.\nAbout the Team\nWe are a global team of 140+ awesome people working from over 40 countries around the globe. We hire globally, you work locally — in the heart of London, a beach outside of Río de Janeiro, or a quiet village near Florence, the choice is yours. Every few months we travel to meet up somewhere in the world and spend some quality time together. We place a huge amount of trust in our people, and we measure the outcomes rather than the work itself. Our values fuel our results.\nThe Role\nAs a Senior Backend Engineer, you will be taking ownership of one or more domains of our product and will work closely with other Backend and Frontend engineers using cutting-edge open source frameworks to develop highly-available RESTful services and back-end systems.\nThe main technologies you will be working with are Go, PostgreSQL and Google Cloud Infrastructure.\nYour main responsibilities will be:\ndeveloping, scaling and maintaining some of our backend services including the API, reports and other infrastructure services that manage our product and logistics worldwide\nworking with multiple teams day to day to bring more value to Toggl’s users, covering customer-facing web and native applications and public APIs\ndesigning, breaking down, and completing projects of a medium to large scope with high-level productivity\nlooking for technical problems of existing system/product without guidance and offering solutions\nleading projects with a small group of people, such as hosting weekly meetings, communicating with other partners and stakeholders\nAbout you\nWe would love to hear from you if you strive to solve technical problems of high scope and complexity and have long-standing experience programming in Go.\nIn particular, we are looking for:\nStrong backend engineering experience in Go\nSignificant professional experience with distributed systems, PostgreSQL, and Google Cloud Infrastructure\nExperience with software engineering best practices (e.g. unit testing, code reviews, design documentation)\nExperience with performance and optimisation problems, particularly at large scale, and a demonstrated ability to both diagnose and prevent these problems\nAbility to work cross-teams and improve cross-functional relationships which will facilitate ongoing projects\nEffective communication skills, ensuring regular consensus with peers and clear status updates.\nStrong collaboration skills across the company to define, design, build, and improve the product.\nExperience with data warehouse, analytics systems, Kubernetes at scale, and system architecture at scale.\nEagerness to contribute to the engineering team's growth, including interviewing and mentoring junior engineers, and providing precise, actionable feedback to peers.\nProficiency in the English language, both written and verbal, is required for success in a remote and largely asynchronous work environment\nBenefits\nFreedom to choose when and how much you work - we only measure results\n24 days of paid time off a year, plus your local holidays\nUnlimited sick leave\nIn-person meetups for team-building (expenses covered)\n4-6 weeks paid sabbatical (depending on the tenure)\nLaptop budget up to €2,500 and it renews every 3 years\n€2,000 budget to set up your home office, and additional €300 every year after 3 years of tenure\n€3,000 per year for co-working space membership and/or internet service at home\n€4,000 per year contribution to use for training, workshops, and conferences\n€2,400 per year contribution for any equipment or services to improve and/or maintain your physical and mental health\nSupport for buying tools you need for doing your best work (even eyeglasses if you need a new pair)\n \n \n \nTo apply: https://weworkremotely.com/remote-jobs/toggl-senior-backend-engineer-4",
    "url": "https://weworkremotely.com/remote-jobs/toggl-senior-backend-engineer-4",
    "source": "WeWorkRemotely",
    "date": "2025-12-01T18:41:58.873Z",
    "expires": "2025-12-08T18:41:58.873Z",
    "id": "live_WeWorkRemotely_1764614518873_5"
  },
  {
    "title": "Zigsaw: Web developer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Remote\n    \nURL: http://zigsaw.in\n\n\nWeb Developer\nPosition Summary:\nWe are looking for a skilled Web Developer to join our team. The ideal candidate should have 3 to 5 years of experience in .Net and Node JS languages with a strong portfolio. The candidate should have proficiency in HTML, CSS, JavaScript, and other relevant web development languages. They should possess a strong understanding of responsive web design and mobile-first development. Knowledge of SEO principles and optimization techniques is also required. The candidate should be able to work collaboratively with designers, developers, and other team members.\nResponsibilities:\n\nTranslate business requirements into technical specifications\nDesign, build and maintain efficient, reusable, and reliable code\nEnsure the best possible performance, quality, and responsiveness of applications\nIdentify bottlenecks and bugs and devise solutions to these problems\nHelp maintain code quality, organization, and automatization\n\nQualifications:\n\n3 to 5 years of experience in web development\nProficient in .Net and Node JS languages\nStrong portfolio showcasing web development skills\nProficient in HTML, CSS, JavaScript, and other relevant web development languages\nStrong understanding of responsive web design and mobile-first development\nKnowledge of SEO principles and optimization techniques\nCapable of working collaboratively with designers, developers, and other team members\n\n\nTo apply: https://weworkremotely.com/remote-jobs/zigsaw-web-developer",
    "url": "https://weworkremotely.com/remote-jobs/zigsaw-web-developer",
    "source": "WeWorkRemotely",
    "date": "2025-12-01T18:41:58.873Z",
    "expires": "2025-12-08T18:41:58.873Z",
    "id": "live_WeWorkRemotely_1764614518873_6"
  },
  {
    "title": "ARRK Engineering: Senior Web Developer (m/f/x)",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Cluj-Napoca, 400254 Romania\n    \nURL: http://arrk.com\n\n\n\nSenior Web Developer (m/f/x)\nWHAT TO EXPECT\nApproximately 100 individuals contribute to the Digitalization & Software realm, guiding the digital transformation of companies across diverse industries using the latest technologies and methodologies.\nBuild and maintain high-performance web applications for top automotive manufacturers. Provide technical leadership and mentoring in web development projects. Ensure best practices for superior software quality. Collaborate with customers and partners on requirements and design concepts. Contribute to project acquisition through offers, technical consulting, and capacity planning.\nYOUR TASKS\nDevelopment and maintenance of high-performance web applications for leading automotive manufacturers.\nTechnical leadership and/or mentoring in web development projects.\nEnsure and spread best practices for high quality software development.\nCoordination of requirements and design concepts with customers and project. partners, ability to speak German is a plus\nInvolvement in project acquisition: offers, technical consulting, capacity planning.\nYOUR PROFILE\nExperience in web development with Angular or React and Spring Boot or Node.js.\nGood knowledge of quality standards and professional methodologies in software development, such as Clean Code, TDD, SOLID Principles, etc.\nFirst experience with modern deployment technologies, e.g., Kubernetes, Open Shift, AWS.\nEnjoyment in sharing and spreading technical knowledge with colleagues\nSolid communication skills (also in English, German is a plus).\nInterest in the automotive industry is an advantage.\nYOUR BENEFITS\n  Exciting projects \n Flexible working hours \n Company pension plan \n ARRK Engineering Academy \n Sports and wellness offers \n Pleasant working atmosphere \nCONTACT\n+40 (0) 364 434 – 717\n \n   \n                    ARRK Engineering is part of the international ARRK group of companies and\nspecialized in product development. Within the ARRK group of companies\nwe implement product developments from virtual development to\nprototypes and small series production.\n                    \nCONTACT\n+40 (0) 364 434 – 717\n \n   \n                    ARRK Engineering is part of the international ARRK group of companies and\nspecialized in product development. Within the ARRK group of companies\nwe implement product developments from virtual development to\nprototypes and small series production.\nTo apply: https://weworkremotely.com/remote-jobs/arrk-engineering-senior-web-developer-m-f-x",
    "url": "https://weworkremotely.com/remote-jobs/arrk-engineering-senior-web-developer-m-f-x",
    "source": "WeWorkRemotely",
    "date": "2025-12-01T18:41:58.873Z",
    "expires": "2025-12-08T18:41:58.873Z",
    "id": "live_WeWorkRemotely_1764614518873_7"
  },
  {
    "title": "Software Engineer - Remote",
    "company": "CodeCraft Inc",
    "description": "New Software Engineer position available. Remote work with competitive compensation and benefits. Apply now for immediate consideration.",
    "url": "https://stackoverflow.com/jobs/1764614519411_0",
    "source": "StackOverflow",
    "date": "2025-12-01T18:41:59.411Z",
    "expires": "2025-12-08T18:41:59.411Z",
    "id": "fallback_StackOverflow_1764614519411_0"
  },
  {
    "title": "Mobile Developer - Remote",
    "company": "AppInnovators",
    "description": "New Mobile Developer position available. Remote work with competitive compensation and benefits. Apply now for immediate consideration.",
    "url": "https://stackoverflow.com/jobs/1764614519411_1",
    "source": "StackOverflow",
    "date": "2025-12-01T18:41:59.411Z",
    "expires": "2025-12-08T18:41:59.411Z",
    "id": "fallback_StackOverflow_1764614519411_1"
  },
  {
    "title": "Data Scientist - Remote",
    "company": "Analytics Pro",
    "description": "New Data Scientist position available. Remote work with competitive compensation and benefits. Apply now for immediate consideration.",
    "url": "https://stackoverflow.com/jobs/1764614519411_2",
    "source": "StackOverflow",
    "date": "2025-12-01T18:41:59.411Z",
    "expires": "2025-12-08T18:41:59.411Z",
    "id": "fallback_StackOverflow_1764614519411_2"
  }
]