[
  {
    "title": "0D Capital: Senior Rust Backend Engineer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Geneva\n    \nURL: https://www.0d.finance\n\n\nThe role\nYou will design, build, and run the backend that powers our strategy vaults and cross-venue trading. This includes integrations with CEXs and perp DEXs, a robust allocation engine, and observable APIs that connect internal systems with DeFi protocols. Your work directly impacts returns.\nWhat You’ll Do\nImplement and scale DeFi strategies: from design to production.\nBuild data products and APIs: enabling reliable connectivity to internal trading systems and external DeFi protocols.\nOwn end-to-end problems: from spec to deployment, ensuring systems are reliable and observable.\nCollaborate with trading & research: turn ideas into live, capital-efficient strategies.\nStack & Infra You'll Touch\nIngress & API: NGINX Ingress (internal/external), Kong Gateway (auth, rate-limit, plugins).\nObservability: OpenTelemetry via Grafana Alloy; Prometheus/Alertmanager, Loki, Tempo, Thanos (global view), Mimir (long-term) backed by GCS; Grafana dashboards.\nData & Messaging: Kafka (event streams, schema evolution, idempotent consumers).\nPlatform: GCP + Cloud Build, Kubernetes, ArgoCD; Postgres as the primary datastore; Metabase for analytics.\nWhat We're Looking For\nExperience\n5+ years building production backends at scale.\nLifecycle knowledge of crypto assets (spot, perps, futures, options).\nHands-on DeFi integrations.\nProven ownership from spec to production and operations.\nTechnical Skills\nStrong OO programming background (preferably Rust).\nAPI design: versioning, backward compatibility, observability.\nPostgres schema design and query optimization; safe migrations; connection pooling.\nKafka or similar pub/sub; backpressure and idempotency patterns.\nCloud familiarity (GCP/AWS/Azure), modern CI/CD, containerization (Docker/Kubernetes).\nNice to Have\nBuilt or maintained position-keeping / accounting systems (PnL, accounting methods, pricing, greeks).\nCentralized reference data platforms (assets, networks, instruments), consistent symbology and instrument economics.\nTrading, risk, or back-office systems, ideally in regulated environment.\nWhy Join Us\nCompetitive compensation with equity/token upside.\nHigh impact on core trading systems.\nRemote (±4h CET), lean sharp team, offsites.\nMindset\nEnd-to-end ownership. Bias to ship with high standards.\nFast learning. Clear thinking under uncertainty.\nContract\nFull-time, remote (±4h CET)\nLanguages: English & French\nTo apply: https://weworkremotely.com/remote-jobs/0d-capital-senior-rust-backend-engineer",
    "url": "https://weworkremotely.com/remote-jobs/0d-capital-senior-rust-backend-engineer",
    "source": "WeWorkRemotely",
    "date": "2025-11-11T18:35:28.205Z",
    "expires": "2025-11-18T18:35:28.205Z",
    "id": "live_WeWorkRemotely_1762886128205_0"
  },
  {
    "title": "SlideSpeak AI: AI Product Engineer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: London, UK\n    \nURL: https://slidespeak.co/\n\n\n\nAbout the role\nWe're looking for a motivated AI Product Engineer who wants to make a significant impact. As part of our small but growing team of 10, your work will directly influence the core product, enhancing our offering at a global scale. We're building out a one-of-a-kind AI-first presentation editor, so we hope you like working with 2D graphics.\nKey Responsibilities:\nBuild and maintain backend services using Python, FastAPI, and other frameworks\nDevelop and optimize front-end UI with NextJS, React, and TypeScript\nDevelop LLM and ML services to generate content for presentations (images, infographics, icons, content, ...)\nCollaborate on database management and query optimization\nContribute to all phases of the development lifecycle, from design to deployment\nAbout you\nYou have concrete career goals and are looking to grow rapidly in a high-velocity environment. You're eager to learn and contribute meaningfully to a product that's changing how millions of people create presentations.\nYou move fast and can adapt quickly. We've entered a phase of growth where there is more work to do than there are people to do it - this means everyone on the team will be busy, but there are also countless opportunities to grow personally and make progress towards your goals.\nYou have a high quality bar for your work, even when moving quickly. As we scale our teams and customer base, the expectations of our software rises with it.\nYou're looking for teammates, not coworkers - folks you can learn from and grow with at SlideSpeak, and beyond.\nSkills & Qualifications\nDegree in Computer Science or a related field\nFull Stack Development experience + Great Product Sense\nProficiency in Python and experience with backend frameworks and databases\nProficiency in NextJS, React, TypeScript\nFamiliarity with cloud services (AWS, GCP, Azure) and server management via shell\nPractical experience through internships or personal projects\nNice to have\nExperience with Python backends, FastAPI, and RAG frameworks like LangChain, Llama Index\nKnowledge of vector databases and advanced database management systems\nKnowledge of 2D graphics editors and SVG (yep, it gets quite nitty gritty)\nPrevious experience in fast-paced startup environments\nTech Stack\nFrontend: NextJS, Zustand, Tailwind, Prisma\nBackend: Python, FastAPI, Llama Index\nDatabase: PostgreSQL, PGVector\nLLMs & AI: Azure OpenAI, Google Gemini Flash, Replica\nDevOps: GitHub Actions, Checkly, Docker Compose, Azure, GCP, AWS\nBenefits\nFully remote work environment with flexible scheduling\nCompany-provided laptop and software budget tailored to your needs\nBudget for attending industry conferences (AI Engineer, Figma Config, WebSummit, etc.)\nExtraordinary quarterly fully-paid trips across Europe and globally, including accommodations and flights, to foster team bonding and creativity (our next trips are to SF and Lisbon)\nWeWork membership\nInterview Process\nInitial Screening Call: 15-minutes, details on the role, questions to assess initial fit\nTechnical Coding Challenge: Showcase your coding skills and problem-solving abilities with a case that we send you.\nSkill Deep Dive: 45-minutes: In-depth assessment of your drivers, work ethic, and goals to determine mutual fit\nCultural Fit with Founder/CEO & Founding Engineer (45-minutes)\nTo apply: https://weworkremotely.com/remote-jobs/slidespeak-ai-ai-product-engineer",
    "url": "https://weworkremotely.com/remote-jobs/slidespeak-ai-ai-product-engineer",
    "source": "WeWorkRemotely",
    "date": "2025-11-11T18:35:28.205Z",
    "expires": "2025-11-18T18:35:28.205Z",
    "id": "live_WeWorkRemotely_1762886128205_1"
  },
  {
    "title": "Figure 53: Senior QLab Developer (macOS)",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Baltimore, MD\n    \nURL: https://qlab.app/\n\n\n \nFigure 53, a Baltimore-based software company, is hiring a macOS developer to work on our flagship program, QLab. We are looking for an accomplished developer with demonstrated and substantial experience fixing and adding functionality to shipped software. We’re also looking for a teammate who has strong creative and communication skills, as our business structures are unusually decentralized and non-hierarchical. We are looking for someone with both the self-motivation to work independently and the interpersonal skills to work cooperatively.\nQLab is a powerful tool for designing and playing back sound, video, light, and show control cues. If you’ve ever watched a play (or the Olympics, or a sports game, or many other live events), chances are you’ve been in the room with QLab. Our ideal candidate would have experience with the technical side of theatre, broadcasting, music production, film, or live events, in addition to the qualifications outlined below.\nWe are seeking to hire a full time (40 hours a week) employee. We pay a competitive salary, have a formalized profit-sharing system that kicks in after one year, and benefits including generous paid vacation and fully paid health insurance. We are an all-remote company. Residency in Maryland, New York, Wisconsin, or California is mildly preferred but we’re open to candidates from anywhere in the US.\nTechnical Skill Requirements\nThe successful applicant will have skills and experience with some or all of the following:\nmacOS software development (Objective-C)\nImplementing and debugging network protocols (like Art-Net and OSC), or hardware protocols (such as MIDI, DMX)\nMetal or OpenGL\nUser interface design and implementation for software tools\nAudio or video software programming (authoring or playback)\nAnimation, illustration, compositing, or presentation software\nTheatrical lighting design software or hardware\nSoftware for configuring or interfacing with embedded hardware\nBonus Technical Qualifications\nWhile no one will have all of the following, experience with any of these would be a bonus:\niOS development (Swift or Objective-C)\nShipped or maintained production-grade software for theatrical or broadcast audio, video, or lighting\nShipped or maintained macOS or iOS software with substantial user base\nmacOS or Unix/Linux system administration skills, including computer network configuration (professional or personal).\nExperience working or volunteering in a live event production environment (e.g. high school, college/university, community, or professional theater; corporate event production; broadcast television or radio; indie or professional film production; etc.)\nExperience with QLab at a moderate or expert level. (At least a year or two of actual hands-on experience with QLab.)\nOther Requirements\nSelf-motivated\nExceptional communication and interpersonal skills\nExperience developing software collaboratively\nGood written communicator\nInterested in being part of company-wide decisions at Figure 53\nCurious and willing to learn\nSalary and Benefits\nAll full- and half-time employees at Figure 53 are paid based on the same annual salary. (Our CEO makes 1.5x the base salary). The base salary is $151,000 for senior full-time employment.\nAfter 1 year at Figure 53, you’ll receive quarterly profit sharing which is divided based on the length of time you’ve been at the company. Profit sharing is often a significant portion of our compensation.\n25 paid vacation days, unlimited unpaid vacation days, and paid federal holidays plus the week between Christmas and New Years off.\nSIMPLE IRA retirement plan with employer contribution matching\nFree health insurance for you, your spouse, and your dependents, including an HRA for out-of-pocket spending. Vision and dental insurance are included because teeth and eyes are also part of your body.\nFully remote work.\nFigure 53 is committed to building a culturally diverse staff and strongly encourages applications from people of color, women, LGBTQ+, those living with disabilities, or a member of any group that is traditionally excluded from work in the tech sector.\nTo get a sense of our company culture and HR policies, we encourage you to take a look at our handbook.\nHow to Apply\nPlease send a brief resume and a 1 to 2-page cover letter, both in PDF format.\nWe’d like to hear about the following in your cover letter:\nWhy you’re interested in working at Figure 53\nYour relevant technical experience\nYour experience with theatre or live events\nYour communication skills and past experience working with a team\nAnything else that shows why you’d be a great addition to the QLab development team\nAs a bonus, if you’ve used QLab before, we’d be interested to know your favorite QLab feature, or one thing you’d like to change about the program.\nPlease email jobs@figure53.com to apply. We will be taking applications from October 22 until November 10th.\nTo apply: https://weworkremotely.com/remote-jobs/figure-53-senior-qlab-developer-macos",
    "url": "https://weworkremotely.com/remote-jobs/figure-53-senior-qlab-developer-macos",
    "source": "WeWorkRemotely",
    "date": "2025-11-11T18:35:28.205Z",
    "expires": "2025-11-18T18:35:28.205Z",
    "id": "live_WeWorkRemotely_1762886128205_2"
  },
  {
    "title": "Bitovi: Applied AI Engineer Consultant ",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Chicago\n    \nURL: https://bitovi.com\n\n\nJOIN OUR TEAM!\nBitovi helps companies create better web applications.\nWe are seeking candidates to help build production-ready Intelligent Automations and Agentic AI solutions for our diverse portfolio of enterprise clients. We guide our clients in building things the \"right way\": maintainable, scalable, tested, and documented.\nBitovians are consultants who are knowledgeable and proficient communicators, helping enterprise clients make informed decisions for their applications.\nWHO YOU ARE\nWe are looking for a candidate with the following attributes: \nPassion for using and building AI tools and solutions\nProven ability to deliver real-world solutions and platforms\nAbility to lead and be an integral part of a team\nStrongly motivated and able to work autonomously\nAccepting of suggestions and constructive feedback\nDriven to continuously learn and improve\nEnjoys solving complex problems\nSpecific experience:\nDeveloping automation tools at the enterprise level\nBuilding workflow automation using tools such as n8n or Rivet\nStrong working knowledge of TypeScript or Python, and LangChain\nPractical use of multiple AI models and content modalities\nLeveraging vector databases and advanced RAG techniques\nUtilizing tool calling and other advanced model features\nWorking directly with clients or other stakeholders\nOther Skills we value:\nSome exposure to cloud deployments and management, including AWS, Docker, and Kubernetes\nDeep understanding of CI/CD pipelines, including GitHub actions, TravisCI, and CodeBuild\nObservability techniques, including logging, metrics, and tracing.\nAutomated testing, including unit and integration testing, performance testing, and benchmarking\nFine-tuning models or building custom models\nDeploying open-source models to production environments\nDesigning and building robust feedback systems for reinforcement learning\n \nHOW TO APPLY:\nPlease share a resume and LinkedIn profile and answer the additional questions. Yes, we read through all the answers!   At this time, we are placing a preference on candidates Nearshore who can work a minimum of 6 hours of overlap with the Eastern Time Zone.\n \nPlease note that we are not interested in working with recruiters. All job offers are contingent on passing a background check.\nTo apply: https://weworkremotely.com/remote-jobs/bitovi-applied-ai-engineer-consultant",
    "url": "https://weworkremotely.com/remote-jobs/bitovi-applied-ai-engineer-consultant",
    "source": "WeWorkRemotely",
    "date": "2025-11-11T18:35:28.205Z",
    "expires": "2025-11-18T18:35:28.205Z",
    "id": "live_WeWorkRemotely_1762886128205_3"
  },
  {
    "title": "Stellar AI: Senior Software Engineer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: London\n    \nURL: https://joinstellar.ai/\n\n\n\nWe are seeking experienced Software Engineers to contribute to projects across a wide range of technologies and programming languages, including JavaScript, Python, Go, C++, Ruby, and more.\nThis is an open-ended contract opportunity, structured around project-based work with no set schedules or minimum time or task commitments. Contributors who work with us decide which available projects they'd like to work on, when they work, and how much they contribute, which makes it an excellent option for those seeking flexible and high-impact work.\nIn this role, you will help advance AI research by understanding complex systems, exploring large codebases, and developing approaches to verify the correctness of software behavior.\nCompensation\n$70 per hour after passing the qualification\nFully remote\nProject based work, no minimum time or task commitments\nResponsibilities\nRapidly build context in large, multi-module codebases\nAnalyze feature implementations for correctness and edge cases\nProduce clear, structured documentation of findings and rationale\nRequirements\nBachelor's degree in Computer Science or a related field\nAt least 2 years of experience as a Software Engineer\nExcellent written communication skills\nAbility to clearly explain complex technical concepts\nLocation\nRemote in the US, UK, Canada, Europe, Australia, or New Zealand\nTo apply: https://weworkremotely.com/remote-jobs/stellar-ai-senior-software-engineer",
    "url": "https://weworkremotely.com/remote-jobs/stellar-ai-senior-software-engineer",
    "source": "WeWorkRemotely",
    "date": "2025-11-11T18:35:28.205Z",
    "expires": "2025-11-18T18:35:28.205Z",
    "id": "live_WeWorkRemotely_1762886128205_4"
  },
  {
    "title": "Close: Senior Software Engineer - Backend/Python - USA Only (100% Remote)",
    "company": "WeWorkRemotely",
    "description": "Headquarters: USA\n    \nURL: http://www.close.com\n\n\nAbout Us\nClose is a bootstrapped, profitable, 100% remote, ~100 person team of thoughtful individuals who prioritize taking ownership and making a meaningful impact. We’re eager to make a product our customers fall in love with over and over again.\n \nWe 💛 small scaling businesses. Since 2013, we’ve been building a CRM that focuses on better communication, without the hassle of manual data entry or a complex UI. We are out to supercharge sales productivity with the most modern, thoughtfully designed, all-in-one, communication-focused CRM. \n \nOur backend tech stack consists primarily of Python Flask web apps with our TaskTiger scheduler handling many of the backend asynchronous task processing chores. Our data stores include MongoDB, PostgreSQL, Elasticsearch, and Redis. The underlying infrastructure runs on AWS using a combination of managed services like EKS, MSK, RDS and ElasticCache and non-managed services running on EC2 instances. We have CI/CD pipelines that build Docker images, run automated tests and deploy to Kubernetes clusters. We also use these images in our local development environment allowing coding locally against all of our services. We have a well-documented public API that is consumed by our front-end JavaScript app as well as numerous integrations. Our infrastructure is heavily automated using Terraform, Ansible and other AWS tools.\n \nOur product development process is inspired by Shape Up. We love open sourcing our code and ideas on our GitHub and on The Making of Close, our behind-the-scenes Product & Engineering blog. Check out our open source projects like SocketShark, TaskTiger, LimitLion and ciso8601.\n \n \nAbout the Role\nYou will be joining one of our six cross-functional teams. These are the CRM, Admin & Onboarding, Conversations, Messaging & Scheduling, Automations & Integrations and Data Insights teams. You will be regularly collaborating with other backend & frontend engineers, product managers, designers, and other teams here at Close.\n \n \nAbout You\nWe’re looking for high achieving, full-time Software Engineers to join our engineering team. Someone who has a good understanding in web technologies and wants to help design, implement, launch, and scale major systems and user-facing features.\n \nYou're comfortable working in a fast-paced environment with a small and talented team where you're supported in your efforts to grow professionally. You're able to manage your time well, communicate effectively, and collaborate in a fully distributed team.\n\n\nCome help us with projects like...\nConceiving, designing, building, and launching new user-facing features\nImplementing new AI features to turbocharge our customers’ daily tasks\nImproving the performance and scalability of our GraphQL and REST API\nImproving how we sync millions of sales emails and calendar events each month\nWorking with Twilio's API, WebSockets, and WebRTC to improve our calling features\nBuilding user-facing analytics features that provide actionable insights based on sales activity data\nImproving our Elasticsearch-backed powerful search features\nImproving our internal messaging infrastructure using streaming technologies like Kafka and Redis \nBuilding new and enhancing existing integrations with other SaaS platforms like Google’s G Suite, Zapier, and web conferencing providers\nEnhancing our web app with real-time updates powered by GraphQL Subscriptions\nLeveraging the latest AI LLMs from providers like OpenAI, Groq and AssemblyAI\n\nHelp manage our ever growing data processing needs…\nBillions of Mongo documents\nMillions and millions of rows of PostgreSQL data\n55 Terabytes of logs / month\n500 billion OTEL spans over the last 30 days\n10+ million events / day\nTens of thousands of docker containers\n7 million minutes of call recordings / month\nPetabytes / month of network traffic\n\nRequirements...\nSenior 1 & 2 level candidates should have 5+ years of experience building modern back-end systems. Staff level candidates should have 8+ years of experience. Mid-level candidates should have ~3 years of similar experience and be eager to level up with the right opportunity.\nProfessional Python experience is preferred but a working knowledge of Python with additional experience in other languages is acceptable if you have a desire to work with Python.\nYou have built web APIs that were Internet facing or supported other high volume loads.\nYou have hands-on production experience working with MongoDB, PostgreSQL, Elasticsearch, or similar data stores. \nYou have experience designing, scaling, debugging, and optimizing systems to make them fast and reliable. \nYou have participated in code reviews and provided overall code quality suggestions to help maintain the structure and quality of the codebase. \nYou care about the craftsmanship of the code and systems you produce.\nLocated in the USA (lower 48 timezones).\n\nBonus point if you have\nContributed open source code related to our tech stack.\nLed small project teams building and launching features.\nBuilt B2B SaaS products.\nImplemented features that leveraged AI to deliver unimaginable new product capabilities.\nWorked with complex architectures that support multiple APIs (e.g. REST, GQL, WebSockets) as well as async task and event processing frameworks.\n\n🌏 Why Close?\nWatch our most recent culture video featuring our annual team retreat in Italy\n100% remote company\n5 weeks PTO + Winter & Summer Holiday Breaks with 2 additional PTO days for every year with the company\n1 month paid sabbatical every 5 years\nPaid parental leave\nMedical, Dental, Vision with HSA option (US residents)\n401k matching at 6% (US residents)\nDependent care FSA (US residents)\nOur story and team 🚀\n\nOur Values\nBuild a house you want to live in -- Examine long-term thinking and action\nNo BS -- Practice transparency and honesty, especially when it’s hard\nInvest in each other -- Build successful relationships with your coworkers and customers \nDiscipline equals freedom -- Keep your word to yourself and others\nStrive for greatness -- Constantly challenge yourself and others \n\nHow We Work Together\nProductivity, Quality & Impact: We don’t track hours. We trust you’re an adult and know best how to prioritize, meet your goals and contribute at a high level. \nAsynchronous communication & collaboration: We have team members all over the world. We don’t expect anyone to work untraditional hours, that means our default is async. Most teams have 2-5 hours of internal meetings weekly. \nAppreciation for Deep Work: *During your normal work day, not after a day of meetings*. \nAutonomy & Freedom: Create a work environment that is sustainable for you. We place a high amount of trust and responsibility with our team members from the start. \n \nWe are looking for US-based Software Engineers to join our team. Base salary range for Senior I & II is $140,000 to $210,000.\nTo apply: https://weworkremotely.com/remote-jobs/close-senior-software-engineer-backend-python-usa-only-100-remote-1",
    "url": "https://weworkremotely.com/remote-jobs/close-senior-software-engineer-backend-python-usa-only-100-remote-1",
    "source": "WeWorkRemotely",
    "date": "2025-11-11T18:35:28.205Z",
    "expires": "2025-11-18T18:35:28.205Z",
    "id": "live_WeWorkRemotely_1762886128205_5"
  },
  {
    "title": "Apexver: Software Engineer, C++ (Middle)",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Cayman\n    \nURL: http://apexver.com\n\n\nRole Overview\nAs a Middle (Mid-level) Software Engineer, you will join our core engineering team and contribute to building and maintaining mission-critical trading infrastructure. You’ll work closely with senior engineers, quants, and traders to bring features from design through production, with an eye for performance, correctness, and robustness.\nKey Responsibilities\nDesign, implement, test, and maintain C++ components used in trading systems: execution engines, market data handlers, order routers, risk modules.\nWork with multi-threaded, high-throughput, low-latency code; optimize hotspots and reduce bottlenecks.\nCollaborate closely with quantitative researchers and traders: understanding requirements, prototyping ideas, translating concepts into code.\nEnsure high reliability and availability: writing unit/integration tests, monitoring, debugging, and fixing production issues.\nParticipate in code reviews, contribute to engineering best practices, and help improve overall code quality (e.g. profiling, benchmarking).\nKeep abreast of modern C++ standards (C++17/20+), new libraries, and architecture patterns; suggest improvements to existing systems.\nQualifications\nRequired:\n~ 3–5 years of professional experience in C++ software development.\nStrong grasp of modern C++ (C++14/17/20), including STL, templates, and idiomatic usage.\nSolid understanding of concurrency, threading, synchronization, and shared-memory / lock-free designs.\nExperience with network programming (TCP/UDP), working with sockets or messaging systems.\nFamiliarity with performance profiling, memory usage, latency measurement.\nStrong problem-solving skills, attention to detail, ability to debug complex systems.\nGood communication skills; ability to work in teams, collaborate and communicate across technical and non-technical stakeholders.\nNice to Have:\nPrior experience in finance / trading / HFT / market data systems.\nExperience with algorithmic trading concepts, order books, matching engines.\nExposure to Linux internals, kernel tuning, OS performance.\nOther languages/tools: Python, scripting, build systems (CMake etc.), tools for CI/CD.\nKnowledge of FPGA / kernel-bypass / RDMA etc. (if applicable to your infrastructure).\nWhat You’ll Gain\nWork on systems where microseconds matter: real-world impact of performance optimizations.\nClose collaboration with traders / quant researchers; opportunities to influence product and strategy.\nOpportunities for mentorship, skill development, exposure to advanced topics (networking, OS, latency).\nCompetitive compensation, benefits, and perks aligned with industry standards.\nA work culture that values innovation, autonomy, and learning.\n \nTo apply: https://weworkremotely.com/remote-jobs/apexver-software-engineer-cpp-middle",
    "url": "https://weworkremotely.com/remote-jobs/apexver-software-engineer-cpp-middle",
    "source": "WeWorkRemotely",
    "date": "2025-11-11T18:35:28.205Z",
    "expires": "2025-11-18T18:35:28.205Z",
    "id": "live_WeWorkRemotely_1762886128205_6"
  },
  {
    "title": "Apexver:  Software Engineer C++ (Senior)",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Cayman\n    \nURL: http://apexver.com\n\n\nRole Overview\nAs a Senior Software Engineer, you will take leadership in designing, building, and scaling high-performance trading systems. You will be driving architectural decisions, mentoring others, and ensuring the reliability, latency, and correctness of our production systems.\nYour role will bridge between quant research, trading operations, and engineering excellence.\n \nKey Responsibilities\nLead design, development, and ownership of large, complex C++ systems: engines for order execution, market data ingestion, risk, connectivity, and downstream services.\nArchitect systems for low latency, high throughput, fault tolerance, and operational resilience.\nIdentify performance bottlenecks across software/hardware layers; lead initiatives to reduce latency, increase capacity, and improve stability.\nMentor and lead other engineers through code reviews, pairing, and driving best practices in code structure, testing, and performance.\nLiaise closely with quant researchers and traders: influence product and strategy design, ensuring designs satisfy functional, non-functional, and latency constraints.\nDrive infrastructure and tooling improvements: monitoring, observability, deployment pipelines, build systems, profiling frameworks, and latency measurement tools.\nStay up to date with new technologies and architectures (e.g. kernel bypass, RDMA, NUMA, CPU/GPU/FPGAs) and evaluate them for potential adoption.\n \nQualifications\nRequired\n5+ years (often 7+) of experience building production C++ systems, ideally in latency-sensitive or real-time environments.\nDeep expertise in modern C++ (C++17/20/23), templates, metaprogramming, memory management, and allocation strategies.\nStrong understanding of concurrency: multi-threading, lock-free programming, synchronization, hardware caches, and memory fences.\nProven track record in optimizing performance (latency, throughput); experience profiling and benchmarking at a low level.\nExperience with network programming: TCP/UDP, protocol design, or low-level kernel/OS tuning.\nFamiliarity with distributed systems, messaging, resilience under load, and graceful degradation.\nExcellent system-level thinking: balancing trade-offs (latency vs. safety vs. maintainability).\nStrong leadership and communication skills; ability to push standards, mentor juniors, and influence design across teams.\nNice to Have\nPrior HFT / proprietary trading / market making experience.\nDeep knowledge of financial market microstructure: order books, matching engines, FIX protocols, exchange connectivity.\nExperience or interest in hardware acceleration (FPGA), kernel bypass, DPDK, RDMA, or similar.\nExposure to other languages/tools relevant to quant or trading environments: Python, scripting, data processing, GPUs.\nAdvanced education (MS/PhD in CS, EE, Physics, Mathematics, etc.) is a plus but not required.\n \nWhat You’ll Gain\nA leadership role where your decisions shape both technical architecture and trading outcomes.\nOpportunities to tackle cutting-edge engineering challenges where performance, scale, and correctness are non-negotiable.\nAbility to mentor and grow a team; influence culture, standards, and technical excellence.\nExcellent compensation, bonuses, and profit-sharing aligned with results and contribution.\nA culture of high trust, where engineers have autonomy and the chance to experiment — and where learning from mistakes is valued.\n \nGeneral: What Makes a Great Fit at Apexver\nYou enjoy solving hard problems where edge vs. margin matters.\nYou’re curious and love going “under the hood” — whether it’s the OS, hardware, or network layer.\nYou take ownership end-to-end: from problem-solving and coding to testing, deploying, and monitoring.\nYou thrive in flat, collaborative, fast-moving teams.\nYou value clean code, correctness, performance, and pragmatism.\nTo apply: https://weworkremotely.com/remote-jobs/apexver-software-engineer-cpp-senior",
    "url": "https://weworkremotely.com/remote-jobs/apexver-software-engineer-cpp-senior",
    "source": "WeWorkRemotely",
    "date": "2025-11-11T18:35:28.205Z",
    "expires": "2025-11-18T18:35:28.205Z",
    "id": "live_WeWorkRemotely_1762886128205_7"
  },
  {
    "title": "Software Engineer - Remote",
    "company": "CodeCraft Inc",
    "description": "New Software Engineer position available. Remote work with competitive compensation and benefits. Apply now for immediate consideration.",
    "url": "https://stackoverflow.com/jobs/1762886128626_0",
    "source": "StackOverflow",
    "date": "2025-11-11T18:35:28.625Z",
    "expires": "2025-11-18T18:35:28.625Z",
    "id": "fallback_StackOverflow_1762886128626_0"
  },
  {
    "title": "Mobile Developer - Remote",
    "company": "AppInnovators",
    "description": "New Mobile Developer position available. Remote work with competitive compensation and benefits. Apply now for immediate consideration.",
    "url": "https://stackoverflow.com/jobs/1762886128626_1",
    "source": "StackOverflow",
    "date": "2025-11-11T18:35:28.625Z",
    "expires": "2025-11-18T18:35:28.625Z",
    "id": "fallback_StackOverflow_1762886128626_1"
  },
  {
    "title": "Data Scientist - Remote",
    "company": "Analytics Pro",
    "description": "New Data Scientist position available. Remote work with competitive compensation and benefits. Apply now for immediate consideration.",
    "url": "https://stackoverflow.com/jobs/1762886128626_2",
    "source": "StackOverflow",
    "date": "2025-11-11T18:35:28.625Z",
    "expires": "2025-11-18T18:35:28.625Z",
    "id": "fallback_StackOverflow_1762886128626_2"
  }
]