[
  {
    "title": "Buckhill: Technical Team Lead",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Croatia/UK\n    \nURL: https://www.buckhill.co.uk/\n\n\nAt Buckhill, we’re seeking an experienced Technical Team Lead to guide and support a cross-functional team, ensuring our products deliver high quality technical solutions to our clients. This role goes beyond managing workflows. It’s about empowering people, fostering collaboration, and driving technical excellence. \nAs a Technical Team Lead, you will lead a cross-functional Scrum team of Developers, QA Engineers, and Solutions Engineers, ensuring alignment with business goals while fostering a culture of continuous growth and improvement.  \nIf you thrive in a Scrum environment and are passionate about technical leadership, mentorship, and team success, we’d love to hear from you! \nTo apply: https://weworkremotely.com/remote-jobs/buckhill-technical-team-lead",
    "url": "https://weworkremotely.com/remote-jobs/buckhill-technical-team-lead",
    "source": "WeWorkRemotely",
    "date": "2025-10-17T06:14:09.459Z",
    "expires": "2025-10-24T06:14:09.459Z",
    "id": "live_WeWorkRemotely_1760681649459_0"
  },
  {
    "title": "Zencastr: Senior Backend Engineer - Full Remote",
    "company": "WeWorkRemotely",
    "description": "Headquarters: worldwide\n    \nURL: https://zencastr.com\n\n\nEmpower the voices of the world @ Zencastr. If you want to push the world of podcasting into the future, come join a team who loves to live on the edge! We are a fully distributed team of smart people who are passionate about changing the world one voice at a time.\n \nYou should join us if you:\nHave significant experience with Node.js and good knowledge of JS fundamentals\nHave a good understanding of computer science fundamentals. You might not have gone to school for it, but you know the difference between heap and stack, different time complexities, and which patterns to use and when.\nYou are ambitious. You might want to build your own company one day or have tried to tackle the toughest tech problems just for fun.\nYou enjoy writing Javascript or Typescript\nYou have an eye for performance. Whether thinking about the latest client side bundling techniques, or the proper way to shard a mongo database, you want things to be fast.\nYou are a team player\nYou have good communication skills\nWhat sets you apart:\nYou have a passion for high performance applications\nYou have significant open source contributions\nYou want to work in a fast growing startup. Which comes with the blood, sweat and tears of working to disrupt an established industry\nYou have empathy for the end user. A spec is a conversation starter, as an advocate for the end user you always are thinking about how to best serve their needs\nYou have an eye for code quality and you strive to uphold best practices in engineering, security, and design\nWhy you should choose us:\nYou’ll be working with world class engineers, Phd’s, and designers in a fully distributed team\nWork in an agile and fast changing environment\nEquity commensurate to your contribution in a profitable company\nHealth insurance\nUnique challenges and the support and talent to solve them\n4 weeks PTO\nFreedom to work where you please\nWhat we’re looking for:\n5+ years of Typescript, Node.js development\nStrong document / key-value store knowledge (Redis, MongoDB)\nStrong SQL knowledge\nDemonstrable knowledge of building scaleable consumer based apps\nStrong experience with unit, integration, and load testing\nExperience building APIs\nExperience with cloud APIs (Google Cloud, Digital Ocean)\n \nBonus points if you have:\nExperiencing working in high traffic, low latency applications\nGood dev ops experience\nDigital Signal Processing experience\nStrong SQL knowledge\nAI experience\n \nHow to apply:\nApply at https://jobs.ashbyhq.com/zencastr/e5897c7a-4622-495b-a892-81763a2ef112\nWe are flexible! For the right candidate we ask: What do you need to do your best work?\nTo apply: https://weworkremotely.com/remote-jobs/zencastr-senior-backend-engineer-full-remote",
    "url": "https://weworkremotely.com/remote-jobs/zencastr-senior-backend-engineer-full-remote",
    "source": "WeWorkRemotely",
    "date": "2025-10-17T06:14:09.459Z",
    "expires": "2025-10-24T06:14:09.459Z",
    "id": "live_WeWorkRemotely_1760681649459_1"
  },
  {
    "title": "H2Corporation: Forward Deployed Backend Software Engineer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Tokyo, Japan\n    \nURL: https://www.h2corporation.co.jp/en\n\n\n<The Role>\nThe ideal candidate is excited to be an early member of the engineering team of a well-funded startup. You’ll play a significant role in designing reusable, extendable data structures and resilient systems that not only enable fast delivery of AI features but also deeply integrate into our clients’ infrastructure.\n \n<Responsibilities>\n• Design and build data structures, APIs and systems satisfying both functional and non-functional requirements, especially mapping well with domain and business logics.\n• Work closely with cross-functional teams to bring AI values to our products and services, optimizing for technical and cost performance, and aligning with user needs.\n• Stay up-to-date with the latest advancements in technologies and methodologies, evaluating and adopting new tools and frameworks as they are released. \n• Continually improve products based on data-driven insights from users hearing and monitoring metrics.\n<Requirements>\n• 5+ years in software development in a fast-paced tech environment.\n• 4+ years of experience building backend in product settings.\n• You’re extremely comfortable with Go or Rust (strong requirement).\n• Strong teamwork via collaboration, documentation and public communication\n• Ability to optimize systems to boost AI serving performance is a big plus\nTo apply: https://weworkremotely.com/remote-jobs/h2corporation-forward-deployed-backend-software-engineer",
    "url": "https://weworkremotely.com/remote-jobs/h2corporation-forward-deployed-backend-software-engineer",
    "source": "WeWorkRemotely",
    "date": "2025-10-17T06:14:09.459Z",
    "expires": "2025-10-24T06:14:09.459Z",
    "id": "live_WeWorkRemotely_1760681649459_2"
  },
  {
    "title": "Vidrush: AI Engineer (Agentic AI & Video Processing)",
    "company": "WeWorkRemotely",
    "description": "Headquarters: UK\n    \nURL: https://www.vidrush.ai/\n\n\nWe are seeking a highly skilled AI Engineer with deep expertise in Agentic AI, LLM deployment, and computer vision pipelines. You will be responsible for building intelligent multi-agent systems and deploying scalable AI video/image solutions on cloud-native infrastructures. This role focuses on agent orchestration, AI model deployment, and end-to-end video intelligence pipelines for our AI Video Tool.\nResponsibilities\nDesign and deploy LLM and CV models using AWS Batch, Fargate, Lambda, SageMaker, and Bedrock for scalable and low-latency inference.\n\nImplement multi-GPU distributed training and serverless AI inference architectures.\n\nOrchestrate multi-agent workflows using LangChain, LangGraph, AutoGen, CrewAI, OpenAI Agents SDK, and Agent OS frameworks.\n\nDevelop advanced video and image processing pipelines (detection, tracking, generative AI).\n\nBuild intelligent AI agent communication protocols for distributed task automation.\n\nApply MLOps / LLMOps best practices for production-ready pipelines.\n\nQualifications\n5+ years experience in AI/ML engineering with strong proficiency in Python.\n\nProven track record of cloud-native AI deployments (AWS Batch/Fargate/Lambda).\n\nExpertise in Agent Orchestration frameworks (LangGraph, AutoGen, CrewAI, OpenAI Agents SDK).\n\nStrong knowledge of computer vision & generative AI (PyTorch, TensorFlow, CUDA).\n\nExperience with vectordatabases (FAISS, Milvus, Weaviate), Advanced RAG/GraphRAG, and knowledge graphs.\n\nSkilled in workflow automation, distributed inference, and AI systems architecture.\n\nNice to Have\nMulti-cloud exposure (GCP Vertex AI, Azure AI).\n\nExperience in Reinforcement Learning, context engineering, and advanced prompt design.\n\nDomain experience in fintech, healthcare, aviation, or energy.\n \nTo apply: https://weworkremotely.com/remote-jobs/vidrush-ai-engineer-agentic-ai-video-processing",
    "url": "https://weworkremotely.com/remote-jobs/vidrush-ai-engineer-agentic-ai-video-processing",
    "source": "WeWorkRemotely",
    "date": "2025-10-17T06:14:09.459Z",
    "expires": "2025-10-24T06:14:09.459Z",
    "id": "live_WeWorkRemotely_1760681649459_3"
  },
  {
    "title": "VidRush: Full-Stack Developer (TypeScript/Next.js • Cloud)",
    "company": "WeWorkRemotely",
    "description": "Headquarters: UK\n    \nURL: https://www.vidrush.ai/\n\n\nThe role\nOwn end-to-end product slices—UI, APIs, data, and deployment. You’ll design clean interfaces, build reliable backend flows, and keep things fast and observable in production.\nWhat you’ll do\nShip features across the stack from spec to prod\n\nDesign simple, explicit APIs and data models\n\nRaise the bar on quality (tests, types, CI) and developer experience\n\nMonitor performance/costs; debug production issues quickly\n\nCollaborate directly with founders and users; iterate rapidly\n\nWhat you’ll bring (most important)\nStrong TypeScript and React/Next.js experience (server + client)\n\nSolid Node.js backend fundamentals and production cloud/serverless experience on AWS\n\nPractical data skills (document or relational), clear API design, robust error handling\n\nExperience with modern auth and billing platforms (Stripe or similar), including complex subscription and usage-based models\n\nExcellent problem-solving: decompose ambiguity, reason from first principles, ship pragmatic solutions under constraints\n\nAI-accelerated development: you actively use tools like Cursor/Copilot/LLMs for scaffolding, tests, refactors, and debugging—without outsourcing your judgment\n\nBest practices: write maintainable, well-tested code; favor clear, simple designs\n\nNice to have\nWeb-based video editor/player experience\nRemotion (programmatic video) exposure\nSST or similar IaC experience\nStrong AWS skills\nObservability patterns and perf/cost tuning for cloud apps\nVercel/edge runtime familiarity; SSR/ISR performance tuning\nTo apply: https://weworkremotely.com/remote-jobs/vidrush-full-stack-developer-typescript-next-js-cloud",
    "url": "https://weworkremotely.com/remote-jobs/vidrush-full-stack-developer-typescript-next-js-cloud",
    "source": "WeWorkRemotely",
    "date": "2025-10-17T06:14:09.459Z",
    "expires": "2025-10-24T06:14:09.459Z",
    "id": "live_WeWorkRemotely_1760681649459_4"
  },
  {
    "title": "Storetasker: Senior Shopify Developer (Remote + Flexible)",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Brooklyn, NY\n    \nURL: https://resources.storetasker.com/become-an-expert?apply=true&source=weworkremotely_best_2021\n\n\nShopify developers love to freelance with Storetasker.\n\nEndless, quality clients: from well known DTC brands to top agencies. \nFully remote, flexible: work as much or as little as you want, wherever you want. \nA talented and helpful community: it's freelance (with a team).\nEarn $100-$200 per hour: pick your clients, and send your own quotes or retainers. \n\n\nWe've connected our community of Shopify developers to over 32,000 e-commerce brands. From new brands pre-launch, to some of the most successful Shopify Plus sites, to top creative agencies. Clients include: Alpha Industries, Boll & Branch, Superfluid, Jack Henry, Plenaire, and Fulton among many more. \nWhy Storetasker?\n\nEndless clients & project opportunities: you’ll see between 5 - 50 new opportunities per day and can pick any lead you want. \nYou’ll earn more: some experts are making $250k+ per year. \nA high quality community: we carefully select about 5% of those who apply. \nRemote: work from anywhere, anytime. \nFlexible: take on as many clients as you want.\nNo external ratings: you’re already a professional. No need to prove it. \nGreat Software: that makes it easy to manage more clients and increase billable hours.\nSupport when you need it: we offer project support 7 days per week. \nCommunity (not competition): you pick your clients, projects, and never compete against other Experts in the community. \n\n\nLearn more and join! It’s confidential, and takes less than 5 minutes. \nHere's who we're looking for:\n\nAmbitious part time and full-time freelancers and boutique agencies.\nWho have 3+ years of Shopify experience, and 5+ years of web development experience. \nAnd who have managed projects, deadlines, and communication successfully. \n\nEspecially people with some of these skills:\n\nFront-end or full-stack Shopify development\nHeadless e-commerce development\nConversion rate optimization\nE-commerce expertise and strategy\nSEO \nSite Speed\nBuilder and/or Shogun\n\nIt takes just a few minutes to join.\nHere's what a few current members have to say:\n\"Storetasker has changed my life - I'm not only making more, but I'm getting quality leads, a diverse slate of projects, and access to an amazing group of developers. Plus, I love the HQ team!\" - Adan, United States, Storetasker Expert since March 2020\n\"Storetasker has connected me with clients that would never have been possible without them. That combined with an incredible support network and community makes joining an amazing opportunity for any developer”\" - Mark, England, Storetasker Expert since 2019\n\"Storetasker has allowed me to live out my dreams as an independent developer - to move to Toronto and continue doing what I love: solving interesting problems and helping apparel companies grow.\" - Siah, Canada, Storetasker Expert since 2017\nOur Mission: \nWe're a company built by ex-freelancers who know the ins and outs of being an independent entrepreneur. We've experienced first-hand the shortcomings of other freelance platforms and the pain-points of being fully independent. Our mission is to empower e-commerce entrepreneurs by giving them the experts, insights, and resources to succeed.  \nQuestions? Reach out at experts@storetasker.com.\n\n\n\nTo apply: https://weworkremotely.com/remote-jobs/storetasker-senior-shopify-developer-remote-flexible-3",
    "url": "https://weworkremotely.com/remote-jobs/storetasker-senior-shopify-developer-remote-flexible-3",
    "source": "WeWorkRemotely",
    "date": "2025-10-17T06:14:09.459Z",
    "expires": "2025-10-24T06:14:09.459Z",
    "id": "live_WeWorkRemotely_1760681649459_5"
  },
  {
    "title": "M.C. Dean: Data Center Infrastructure Manager (DCIM) - Remote with Security Clearance",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Virginia\n\n\nOverview M.C. Dean is Building Intelligence . We design, build, operate, and maintain cyber-physical solutions for the nation's most recognizable mission critical facilities, secure environments, complex infrastructure, and global enterprises. The company's capabilities include electrical, electronic security, telecommunications, life safety, automation and controls, audio visual, and IT systems. M.C. Dean is headquartered in Tyson's, Virginia, and employs more than 5,800 professionals who engineer and deploy automated, secure, and resilient power and technology systems; and deliver the management platforms essential for long-term system sustainability. Why join M.C. Dean? Our people are inspired by the way engineering and innovation enhance customer outcomes, improve lives, and change the world for the better. We are driven by our core values of agility, expertise, and trust. Clearance Requirement: Applicants selected will be subject to a government security investigation and must meet eligibility requirements, to include U.S. Citizenship; Applicant selected must have the ability to obtain and maintain a Secret Clearance Responsibilities The DCIM Manager is responsible for overseeing the Data Center Infrastructure Management system to ensure the efficient operation, monitoring, and optimization of multiple, geographically separated data center and the installed assets, power, cooling, and space utilization. This role requires a strong understanding of DCIM tools, data analytics, capacity planning, and operational best practices to maximize uptime, improve efficiency, and support business continuity. SQL: Working knowledge of Structured Querry Language Modify existing SQL reports, create new SQL reports, support Administrators with reporting issues Perform asset data validation and normalization. Perform user account management Modify existing asset models, create new asset models Add, update, and remove floor plans within DCIM Add, update, and remove mission partner organizational information within DCIM as requested by the government. DCIM User Management Process System Authorization Access Requests for user accounts in DCIM Reviewing access requests for completeness Validating requested access level Creating or removing user accounts as required per the SAAR. Managing user access to the DCIM team and email list. Asset Data Management Work with users to normalize input data Resolve data conflicts via research and coordination with users Asset Model Management Research and create asset models (materials). Work with users to validate all information is accurate and consistent Floor Plan and Location Management Integrate and maintain data center master floor plans for each covered data center. Research into existing floor planning documentation Coordination with facility floor managers regarding existing zoning Review of DISA mechanical & electrical projects to determine planned/assumed zoning of infrastructure support equipment. Coordination with site TIM Contractor personnel regarding equipment zoning & labeling Coordination with AutoCAD team for existing AutoCAD-based floor plans (IT & infrastructure support equipment zoning, existing & future planned zones and equipment layout, locations of airflow devices & environmental monitoring equipment, et cetera) Uploading DCIM floorplan images to DCIM to ensure the most accurate and up-to-date images are utilized. Creating or removing locations, rooms, and spaces within DCIM as DISA operational space requirements evolve. Organization Management Maintain Mission Partner organization information for all identified workloads at each covered data center. Involves: Researching new workloads or applications to identify the associated Mission Partner. Deconflicting Mission Partner information to ensure duplicate entries are merged. Updating existing Mission Partner information as organizational changes occur Coordinating with the DCIM community to ensure consistent use of Mission Partner associations to assets. Estimated Workload Information The incumbent shall provide dedicated support on core business hour basis, in support of the client. Travel is required. Qualifications Applicants selected will be subject to a government security investigation and must meet eligibility requirements, to include U.S. Citizenship; Applicant selected must have the ability to obtain and maintain a Secret Clearance\n Degree / PMP Certification highly desired, but not required\n Minimum 7+ years of experience with a Bachelor's degree in Computer Science, Electrical Engineering, Mechanical Engineering, or a related field.\n 5+ years of experience in data center operations, infrastructure management, or related roles.\n Strong knowledge of SQL and Microsoft Report Builder.\n Strong knowledge of DCIM tools such as Schneider Electric EcoStruxure, Nlyte, Sunbird, Vertiv, or equivalent platforms.\n Strong knowledge with IT infrastructure, networking, and asset management in a data center environment.\n Strong analytical and problem-solving skills with the ability to interpret complex data sets.\n Knowledge of industry standards and best practices, including ITIL, ASHRAE, and Uptime Institute Tier classifications.\n Excellent communication skills with the ability to collaborate across multidisciplinary teams.\n Understanding of government and DoD security policies related to user account management.\n Experience with floor planning and asset modeling in data center environments.\n Project management experience, with the ability to lead DCIM-related initiatives and process improvements.\n Strong understanding of compliance and regulatory requirements related to data center operations.\n Manage System Authorization Access Requests for user accounts\n Experience working with DISA or DoD-related IT environments.\n Knowledge of AutoCAD for floor plan management.\n DCIM certification or relevant industry certifications (e.g., CDCP, DCEP, PMP). Preferred Qualifications: DCIM certification or relevant industry certifications (e.g., CDCP, DCEP, PMP).\n Experience working in large-scale enterprise data centers or colocation facilities.\n Knowledge of cloud and hybrid IT infrastructure management.\n Experience with automation and AI-driven DCIM capabilities. We offer an excellent benefits package including: A competitive salary\n Medical, dental, vision, life, and disability insurance\n Paid time off\n Tuition reimbursement\n 401k Retirement Plan\n Military Reserve pay offset\n Paid maternity leave Abilities: Exposure to computer screens for an extended period of time.\n Sitting for extended periods of time.\n Reach by extending hands or arms in any direction.\n Have finger dexterity in order to manipulate objects with fingers rather than whole hands or arms, for example, using a keyboard.\n Listen to and understand information and ideas presented through spoken words and sentences.\n Communicate information and ideas in speaking so others will understand.\n Read and understand information and ideas presented in writing.\n Apply general rules to specific problems to produce answers that make sense.\n Identify and understand the speech of another person. Pay Range USD $124,880.00 - USD $174,292.00 /Yr.\n\nTo apply: https://weworkremotely.com/remote-jobs/m-c-dean-data-center-infrastructure-manager-dcim-remote-with-security-clearance-3",
    "url": "https://weworkremotely.com/remote-jobs/m-c-dean-data-center-infrastructure-manager-dcim-remote-with-security-clearance-3",
    "source": "WeWorkRemotely",
    "date": "2025-10-17T06:14:09.459Z",
    "expires": "2025-10-24T06:14:09.459Z",
    "id": "live_WeWorkRemotely_1760681649459_6"
  },
  {
    "title": "Walter: Technical Lead",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Remote\n    \nURL: https://www.gowalter.co/\n\n\nAbout Us\nTechsource is a Tiny portfolio company, they are a fast-moving early-stage company focused on building innovative, AI-driven solutions. The mission is to create technology that enables speed, adaptability, and meaningful impact for customers. As part of a small, ambitious team, you’ll have the opportunity to directly shape the product roadmap and technical direction while working in a collaborative, entrepreneurial environment.\nThe Role\nWe’re seeking a hands-on Technical Lead who thrives in a startup environment. You’ll be responsible for leading the development of our core product, making architectural decisions, and driving implementation with speed and precision. This is a builder role, not a management role, perfect for someone who loves rolling up their sleeves, iterating quickly, and leveraging the latest AI capabilities to create scalable solutions.\nThis role starts on a contract basis with the intention of converting to a long-term fit.\nKey Responsibilities\nProduct Development & Architecture\nLead the design, development, and deployment of our core applications\nTranslate the product vision into technical execution with a focus on speed over perfection\nHands-On Coding\nBuild and maintain backend services using Node.js / TypeScript and Postgres\nContribute to frontend development in React\nDeploy and scale applications on Google Cloud Platform\nProduct Roadmap & Strategy\nPartner with the founder to define and refine the product roadmap\nProvide technical insight to prioritize features and identify risks/opportunities\nAI-First Approach\nIdentify and integrate emerging AI technologies to accelerate development and product capabilities\nCollaboration\nWork closely within a small, nimble team environment\nCommunicate clearly and effectively with non-technical stakeholders\n\nAbout You\n5+ years of software development experience, ideally in early-stage or startup environments\nStrong expertise in Node.js / TypeScript, Postgres, React, and Google Cloud Platform\nProven ability to architect, build, and scale applications independently\nPassionate about experimenting with and leveraging new AI technologies\nEntrepreneurial mindset: self-starter, problem-solver, and eager to help shape the product and company direction\nPrefer building over managing—this role is focused on execution and innovation\nWhy Join Us\nPlay a pivotal role in shaping the technical foundation of an early-stage company\nWork directly with the founder on defining and building the product roadmap\nThrive in a small, agile team environment that values experimentation and learning\nCompetitive monthly contractor budget and full-time compensation packages\nRemote, flexible work environment\nTo apply: https://weworkremotely.com/remote-jobs/walter-technical-lead",
    "url": "https://weworkremotely.com/remote-jobs/walter-technical-lead",
    "source": "WeWorkRemotely",
    "date": "2025-10-17T06:14:09.459Z",
    "expires": "2025-10-24T06:14:09.459Z",
    "id": "live_WeWorkRemotely_1760681649459_7"
  },
  {
    "title": "Software Engineer - Remote",
    "company": "CodeCraft Inc",
    "description": "New Software Engineer position available. Remote work with competitive compensation and benefits. Apply now for immediate consideration.",
    "url": "https://stackoverflow.com/jobs/1760681650019_0",
    "source": "StackOverflow",
    "date": "2025-10-17T06:14:10.019Z",
    "expires": "2025-10-24T06:14:10.019Z",
    "id": "fallback_StackOverflow_1760681650019_0"
  },
  {
    "title": "Mobile Developer - Remote",
    "company": "AppInnovators",
    "description": "New Mobile Developer position available. Remote work with competitive compensation and benefits. Apply now for immediate consideration.",
    "url": "https://stackoverflow.com/jobs/1760681650019_1",
    "source": "StackOverflow",
    "date": "2025-10-17T06:14:10.019Z",
    "expires": "2025-10-24T06:14:10.019Z",
    "id": "fallback_StackOverflow_1760681650019_1"
  },
  {
    "title": "Data Scientist - Remote",
    "company": "Analytics Pro",
    "description": "New Data Scientist position available. Remote work with competitive compensation and benefits. Apply now for immediate consideration.",
    "url": "https://stackoverflow.com/jobs/1760681650019_2",
    "source": "StackOverflow",
    "date": "2025-10-17T06:14:10.019Z",
    "expires": "2025-10-24T06:14:10.019Z",
    "id": "fallback_StackOverflow_1760681650019_2"
  }
]