[
  {
    "title": "WPForms: WordPress Full-Stack Developer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: West Palm Beach, Florida, United States\n    \nURL: https://wpforms.com/\n\n\n\n\nAs a WordPress Developer at WPForms, you'll work on a diverse team that builds & supports a wide-range of websites. We’re looking for someone with experience in eCommerce and multiple payment gateways, with a mind for troubleshooting payment and subscription issues.\nAt WPForms, it’s not just our products that stand out. Our websites are the engines that power our customer experience and many of our products' extended features. We’re looking for a qualified full-stack WordPress Developer to join that team.\nOur sites don’t just power sales, they extend product functionality using a variety of cloud technologies based in PHP and JavaScript. We need curiosity-driven developers to help us build the next generation of features. You’ll share the ownership and success of website projects with the team, where everyone shares ideas on the technical details of achieving those goals.\nYour responsibilities will occasionally expand beyond WordPress to support a wide variety of ancillary installations and technologies. We’ve got a lot going on, and we want your help. This includes maintaining and extending existing functionality, optimizing for performance, and securing our codebase. You’ll be responsible for testing your own work and contributing to the reviews of your peers' work as well. We believe in a collaborative environment where your ideas are valued and your growth is supported.\nThis role is perfect for a developer with a strong understanding of WordPress architecture and a desire to build scalable, secure, and high-performing websites. If you're a problem-solver who thrives in a fast-paced environment and is passionate about writing clean, efficient code, we encourage you to apply!\nRequirements\nExtremely familiar with WordPress and all of its idiosyncrasies.\nExperience leveraging and integrating with 3rd Party APIs\nCoding with modern PHP practices (OOP, autoloading, namespacing, traits, interfaces, etc).\nJavaScript experience of many flavors (vanilla JS, jQuery, ES6, etc)\nFamiliar with package managers (Composer & NPM)\nExcellent attention to detail in HTML & CSS/SCSS for great looking sites.\nBranching & merging workflows and strategies with git & Github.\nYou’re AI-savvy, comfortable using AI tools (Claude Code, Cursor, Co-Pilot, etc.) as part of your daily routine and always looking for ways to leverage AI effectively.\nWordPress eCommerce experience\neCommerce payment experience including Stripe and/or PayPal\nComfortable writing performant SQL queries for MySQL\nWP-CLI proficiency and Linux/Shell scripting skills with the ability to support occasional DevOps tasks.\nA curious mind, great at troubleshooting\nWillingness to learn!\nBonus points if you also have:\nExperience creating custom blocks for the Gutenberg (block) editor\nFamiliarity with Continuous Integration / Continuous Deployment (CI/CD) systems\nBenefits\nWorking for a fast-growing bootstrapped company is a rare opportunity, one we consider a lifestyle choice rather than a job choice. Our positions are challenging, but also come with amazing advantages and fulfillment to those who earn them. Here’s what we offer.\nCompetitive Salary\nTerm Life Insurance and Accidental Death & Dismemberment for all full-time team members during their employment.\nHealth, Dental, and Vision Insurance benefits for full-time U.S. employees.\nHealth Insurance benefits for all employees in India, Pakistan, Brazil, Philippines, Ukraine, Poland, Romania, Nepal, Kenya, Mexico, Nigeria, Spain, Argentina & Jamaica.\nWork from your home. We’re spread out all over the world – United States, Canada, Ukraine, India, Pakistan, Singapore, and more.\nFlexible PTO after 90 days of employment. We encourage employees to take the time they need for a vacation, stay healthy, and spend time with friends and family.\nHolidays (based on your location)\nPaid Parental Leave.\nWe happily provide or reimburse software you’ll need as well as books or courses that promote continued learning.\nWe cover all costs of company travel (including our annual all-company retreat and mini-team meetups).\nAdditional Perks include AM Welcome Box for new team members, Yearly Anniversary Gifts, and Technology Stipend each work anniversary.\nWe give you the opportunity to solve challenging and meaningful problems that make a difference.\nAbility to work with some of the best people in the business through frequent, if not daily, interactions.\nAnd in case you were wondering: no politics, no b.s., and no jerks.\nLocation\nThis is a remote position - our team is spread around the globe! Our home base is in Florida, USA, so company operating hours are 9am - 5pm ET (UTC -5). While full coverage is not a requirement, you must be available during a portion of the day.\nInclusion Statement\nAt Awesome Motive, we strive to have the broadest possible view of diversity, going beyond visible differences to include the background, experiences, skills, and perspectives that make each person unique. Awesome Motive is proud to be an equal opportunity workplace and is committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, veteran status, or any other basis protected by federal, state, or local law.\nHow to apply?\nIf all of this sounds interesting, then please submit your application!\nClearly include the following in your cover letter\nTell us a bit about yourself and why you should be considered. Details about your experience, qualifications, personality, etc are very helpful.\nWhat is your favorite WordPress hook/function and why.\nWhat’s something you recently learned that got you excited?\nAlso note, don't forget to proofread before submitting. Check spelling, capitalization, etc. This is your chance to make your application stand out :)\nAwesome Motive is AI first and we welcome the use of AI - however, our core value of “Paying Attention To Details” means you must proofread everything and take extra care to ensure all sentiments are indeed your own.\nWe won’t be able to individually respond to all applications, but if we feel you’re a strong match, someone will be in touch shortly.\nThanks and we look forward to hearing from you!\nTo apply: https://weworkremotely.com/remote-jobs/wpforms-wordpress-full-stack-developer",
    "url": "https://weworkremotely.com/remote-jobs/wpforms-wordpress-full-stack-developer",
    "source": "WeWorkRemotely",
    "date": "2025-12-06T01:56:00.401Z",
    "expires": "2025-12-13T01:56:00.401Z",
    "id": "live_WeWorkRemotely_1764986160401_0"
  },
  {
    "title": "DesignFiles: Remote Front-End Rails Developer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Remote\n    \nURL: https://designfiles.co\n\n\nAt DesignFiles, we’re looking for a Front-End Rails Developer with strong JavaScript and UI skills to help shape and improve the creative tools at the heart of our platform.\nAbout Us:\nAt DesignFiles, we’re building the go-to platform for interior designers to manage every part of their business—from concept to completion. More than 5,500 customers already rely on our tools, and our remote team of 30+ is growing. If you care about building great products that solve real problems, we’d love to meet you.\nWhat You'll Do:\nHelp guide the evolution of our Design/Presentation Editor into a modern, Canva-style experience that supports moodboards, room mock-ups, client presentations, reusable templates, and more.\nBuild intuitive, high-performance UI components for core editing interactions: drag-and-drop, layering, resizing, grouping, alignment, snapping, canvas navigation, and on-canvas text/image editing.\nCollaborate closely with product and design to translate complex user needs into seamless creative workflows.\nShape the architecture and structure of our editor so it's fast, scalable, and easy to maintain as it grows.\nContribute to a high-quality, design-forward experience that feels just as good as tools like Canva or Figma — but purpose-built for interior designers.\nParticipate in team rituals like daily standups, sprint planning, and retrospectives.\nWhat We're Looking For:\nStrong vanilla JavaScript skills, including DOM/event handling, canvas or SVG rendering, and performance optimization.\nExperience building or contributing to visual editors, creative tools, or browser-based design software is a strong plus.\nDeep understanding of CSS, with hands-on experience using Tailwind or a similar utility-first framework.\nProficient with Stimulus.js, Turbo, Hotwire, ViewComponents, and the modern Rails front-end stack.\n3+ years of hands-on Ruby on Rails development experience.\nTakes full ownership of features from concept to deployment—driving high-quality, scalable implementations.\nFluent English and clear, professional communication skills.\n \nThis is a full-time, 40-hour/week remote contract role. We’re specifically seeking candidates (not agencies) based within ±2 hours of Central European Time (CET).\nIf you’ve built or contributed to browser-based editors or creative tools—and care about crafting fast, intuitive, design-friendly experiences—we’d love to talk.\n \nTo apply: https://weworkremotely.com/remote-jobs/designfiles-remote-front-end-rails-developer",
    "url": "https://weworkremotely.com/remote-jobs/designfiles-remote-front-end-rails-developer",
    "source": "WeWorkRemotely",
    "date": "2025-12-06T01:56:00.401Z",
    "expires": "2025-12-13T01:56:00.401Z",
    "id": "live_WeWorkRemotely_1764986160401_1"
  },
  {
    "title": "DesignFiles: Remote Growth Engineer (Full-Stack Rails)",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Remote\n    \nURL: https://designfiles.co\n\n\nAt DesignFiles, we’re looking for a Growth Engineer with strong full-stack Rails experience to join our product engineering team.\nAbout Us:\nAt DesignFiles, we’re building the go-to platform for interior designers to manage every part of their business—from concept to completion. More than 5,500 customers already rely on our tools, and our remote team of 30+ is growing. If you care about building great products that solve real problems, we’d love to meet you.\nWhat You'll Do:\nAs a Growth Engineer, you’ll sit at the intersection of engineering, product, and growth. You’ll ship features and run experiments that directly impact customer activation, retention, and monetization. Your work won’t just be about building—it’ll be about measuring, iterating, and optimizing.\nRun experiments that improve activation, retention, and monetization.\nCollaborate with product, design, and marketing to test and refine onboarding flows, funnels, and client engagement touchpoints.\nUse data to uncover friction points in the user journey and ship small, high-impact improvements.\nTake ownership of experiments end-to-end: scope, build, ship, measure, and iterate.\nRefine existing features to boost adoption and stickiness.\nContribute to a culture of clean code, rapid iteration, and measurable outcomes.\nParticipate in team rituals like daily standups, sprint planning, and retrospectives.\nWhat We're Looking For:\n5+ years of hands-on Ruby on Rails experience with strong full-stack skills.\nProficiency with JavaScript, Stimulus.js, CSS, RSpec, SQL, Docker, Unix Shell.\nExperience with A/B testing, growth-focused engineering, and/or optimizing onboarding funnels.\nStrong problem-solving skills and ability to self-unblock.\nFluent English and solid communication skills.\nTeam-oriented and comfortable with collaboration, idea-sharing, and code reviews.\n\nThis is a full-time, 40-hour/week remote contract role. We’re specifically seeking candidates (not agencies) based within ±2 hours of Central European Time (CET).\nIf you’ve got a portfolio of high-impact experiments or user-facing improvements you’ve shipped and iterated on, we’d love to talk.\n \nTo apply: https://weworkremotely.com/remote-jobs/designfiles-remote-growth-engineer-full-stack-rails",
    "url": "https://weworkremotely.com/remote-jobs/designfiles-remote-growth-engineer-full-stack-rails",
    "source": "WeWorkRemotely",
    "date": "2025-12-06T01:56:00.401Z",
    "expires": "2025-12-13T01:56:00.401Z",
    "id": "live_WeWorkRemotely_1764986160401_2"
  },
  {
    "title": "Toptal: React/Node Developer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Remote\n    \nURL: https://www.toptal.com/\n\n\n\n\nSummary\nClient's team builds Mail for Android, iOS, and Web, serving 200M+ users across 40+ countries in 70 languages. As one of the largest email services globally, we deliver 4.5B+ emails daily with top-rated mobile apps. Mail is a key part of our long-term growth, and we're dedicated to providing the best user experience.\nAbout the Project\nWe're modernizing our webmail experience to enhance user satisfaction and compete with industry leaders. The team oversees webmail, mobile web, and the classic web version.\n\nRemote | 6-12 months | 40 hrs/week (preferred), part-time possible\nClient-provided MacBook\nResponsibilities\nProvide technical leadership in a fast-paced environment\nEnforce best practices: design reviews, code reviews, CI/CD, TDD\nDevelop high-quality, high-performance features using Node.js/React.js\nCollaborate with designers, product managers, and engineers\nWrite testable, reliable code and deploy continuously\nOptimize application performance and scalability\nOperate and monitor global-scale production systems\nRequirements\nBS in Computer Science (or equivalent) with 6+ years of experience\nStrong CS fundamentals: data structures, algorithms, software design\nExpertise in React, Redux, Node.js, and responsive design\nProficiency in AJAX, HTML5, CSS3, TypeScript, and modern JavaScript\nExperience with Web Technologies (Node, HTTP, JSON, Webpack, Babel)\nTDD experience with Jest, WebdriverIO, Enzyme, Protractor, React Testing Library\nPreferred:\nExperience developing mail applications\nMobile web development expertise\nFamiliarity with Agile methodologies (Scrum, Squad, etc.)\nTo apply: https://weworkremotely.com/remote-jobs/toptal-react-node-developer",
    "url": "https://weworkremotely.com/remote-jobs/toptal-react-node-developer",
    "source": "WeWorkRemotely",
    "date": "2025-12-06T01:56:00.401Z",
    "expires": "2025-12-13T01:56:00.401Z",
    "id": "live_WeWorkRemotely_1764986160401_3"
  },
  {
    "title": "Mobena: Frontend Engineer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: New York, NY\n    \nURL: https://mobena.co/\n\n\nMobena is a three-person, remote-first startup building the “evolution” of multi-generational tax/estate planning software, targeting the advisors of America’s 2 million wealthiest families. We’re currently hiring our first dedicated UI Engineer to “own” the frontend of our flagship product, Mobena Evolution, for which we have little to no frontend code. You’ll work directly with our backend/algorithm-focused CTO, as well as our designer-founder, to turn evolving Figma concepts into fast, maintainable, and scalable user interfaces.\nWhat You’ll Do\nChoose and justify the frameworks and tools that best fit our needs.\nWe have some holdover prototype code in Vite JS, but you can take it or leave it; all of our Figma concepts are new.\nThe backend is a standard HTTP API. We are open to everything from established web stacks (React, Angular, Svelte, Vite) to cross-platform or native solutions (Qt, WASM, .NET MAUI, Tauri, Electron, Tk)—literally anything, if you can convince us it’s the right choice.\nBuild our UI from the ground up, establishing clear, maintainable patterns for components, state management, styling, testing, performance, and accessibility.\nCollaborate to refine and sometimes re-frame existing screen designs in Figma.\nConnect the frontend to our APIs (REST, GraphQL, or similar).\nLay groundwork for future mobile clients; however, experience in this regard is a plus rather than a requirement.\nAbout You\nYou’ve shipped an interactive application—web, desktop, or mobile—via coursework, open source, side project or professional work.\nYou care about usability and design quality. (That is, you care about the user.)\nYou learn by doing: building things rather than sitting in committee.\nYou are happy to say I don’t know. We try to cultivate “beginner’s mind” at Mobena—it helps us avoid conventional traps and groupthink. The first step of thinking like a beginner is acknowledging your own ignorance! 😊\nYou can defend your technical choices in clear English, and can take credit for your successes as well your mistakes.\nYou are comfortable in an early-stage, collaborative environment.\nTo apply: https://weworkremotely.com/remote-jobs/mobena-frontend-engineer",
    "url": "https://weworkremotely.com/remote-jobs/mobena-frontend-engineer",
    "source": "WeWorkRemotely",
    "date": "2025-12-06T01:56:00.401Z",
    "expires": "2025-12-13T01:56:00.401Z",
    "id": "live_WeWorkRemotely_1764986160401_4"
  },
  {
    "title": "Lemon.io: Senior Golang Developer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: New York, NY\n    \nURL: https://lemon.io\n\n\nAre you a talented Senior Developer looking for a remote job that lets you show your skills and get decent compensation? Look no further than Lemon.io — the marketplace that connects you with hand-picked startups in the US and Europe.\nWhat we offer:\nThe rate depends on your seniority level, skills and experience. We've already paid out over $11M to our engineers.\nNo more hunting for clients or negotiating rates — let us handle the business side of things so you can focus on what you do best.\nWe'll manually find the best project for you according to your skills and preferences.\nChoose a schedule that works best for you. It’s possible to communicate async or minimally overlap within team working hours.\nWe respect your seniority so you can expect no micromanagement or screen trackers.\nCommunicate directly with the clients. Most of them have technical backgrounds. Sounds good, yeah?\nWe will support you from the time you submit the application throughout all cooperation stages.\nMost of our projects involve working in a fast-paced startup environment. We hope you like it as much as we do.\nThrough our community, we will connect you with the best developers from more than 50 countries.\nRequirements:\n4+ years of software development experience\n3+ years of experience in Golang programming, with strong knowledge of the Go programming language, paradigms, constructs, and idioms\nExpertise in AI and Kubernetes is a plus\nStrong technical skills: as a Senior Developer, you are expected to be able to create projects from scratch and have a deep understanding of application architecture.\nClear and effective communication in English — advanced ability to discuss business tasks, justify decisions, and communicate issues. Good self-presentation is also essential for upcoming client calls.\nStrong self-organizational skills — ability to work full-time remotely with no supervision.\nReliability — we want to trust you and expect that you won’t let us and the client down.\nAdaptability and Flexibility — the ability to onboard the project promptly after accepting it and start delivering results quickly.\nSounds good for you? Apply now and join the Lemon.io community!\nNOT YOUR TECH STACK?\nWe have multiple projects available for Senior Developers. If you have 4+ years of commercial software development experience and are proficient in any of the following areas: React & Node, React & Python, Rust, Shopify & JavaScript, Node & Python, WordPress, Unreal Engine, PHP & Vue, Svelte & TypeScript, Svelte & Node, Svelte & Python, MLOps, Data Engineering, React Native & Node, PHP & React, Data Analysis, Blockchain, PHP & Angular, Swift & SwiftUI, Node & Vue.js, DevOps, Data Science, Unity, Python & LLM or AI Engineering — we’d be happy to connect and match you with a suitable project.\nIf your experience matches our requirements, be ready for the next steps:\nVideoAsk — watch a short video about our startup, up to 10 minutes\nComplete your profile on our website\n30-minute screening call\nTechnical interview\nFeedback\nMagic Box (we are looking for the best project for you).\nWe do not provide visa assistance, and our cooperation model does not include the benefits typically offered with direct hire.\nP.S. We work with developers from 50+ countries in different regions: Europe, LATAM, the U.S (if you are an owner of W-9 ben form), Canada, Asia (Japan, Singapore, South Korea, Philippines, Indonesia), Oceania (Australia, New Zealand, Papua New Guinea), and the the UK. However, we have some exceptions.\nAt the moment, we don’t have a legal basis to accept applicants from the following countries:\nEuropean: Iceland, Liechtenstein, Kosovo, Belarus, Russia, and Serbia.\nLatin America: Cuba and Nicaragua\nMost Asian countries and Africa.\nWe expand and shorten the list of exemptions regularly.\nWe do not provide visa assistance, and our cooperation model does not include the benefits typically offered with direct hire.\nDo you represent a company with engineers who match the description and want to collaborate with us through staff augmentation? Then register here.\n \nTo apply: https://weworkremotely.com/remote-jobs/lemon-io-senior-golang-developer",
    "url": "https://weworkremotely.com/remote-jobs/lemon-io-senior-golang-developer",
    "source": "WeWorkRemotely",
    "date": "2025-12-06T01:56:00.401Z",
    "expires": "2025-12-13T01:56:00.401Z",
    "id": "live_WeWorkRemotely_1764986160401_5"
  },
  {
    "title": "Proxify AB: Senior Fullstack Developer (.NET)",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Sweden\n    \nURL: http://career.proxify.io\n\n\nThe Role:\n \nWe are looking for a Senior Fullstack .NET Developer to join our fast-growing Network. In this role, you’ll own the design and implementation of backend services and APIs using .NET (C# / ASP.NET Core), while delivering polished, performant user interfaces using modern frontend technologies and .NET-driven UI frameworks. You will collaborate with product managers, designers, and other engineers to deliver end-to-end features, make architectural decisions, and mentor more junior engineers.\n \nThis is a long-term, full-time remote engagement. You’ll have the opportunity to work with modern cloud platforms, CI/CD pipelines, and deliver impactful features in real products used by customers around the world.\n \nWhat we are looking for:\n5+ years of professional software development experience, with strong fullstack exposure.\nRelational databases - MSSQL experience.\n3+ years of production experience with .NET (C#, .NET Core / .NET 6+) and ASP.NET Core.\nSolid knowledge of JavaScript/TypeScript, HTML5 and CSS3, or experience with .NET UI frameworks such as Blazor and Razor Pages.\nExperience with relational databases (e.g., SQL Server, PostgreSQL) and ORM tooling such as Entity Framework Core.\nStrong understanding of RESTful API design and integration patterns.\nExperience with automated testing (unit, integration) and test frameworks for both backend and frontend.\nPractical experience with containerization (Docker) and familiarity with CI/CD pipelines (e.g., GitHub Actions, Azure DevOps, GitLab CI).\nExperience deploying and operating services in the cloud (Azure preferred, AWS/GCP acceptable).\nAbility to work independently and deliver high-quality results in a remote setup.\nIntermediate-advanced English\nLocated in CET timezone (+/- 3 hours), we are unable to consider applications from candidates in other time zones.\n \nNice-to-have:\nDeep experience with TypeScript and modern frontend tooling (Vite, Webpack).\nProven experience with Blazor, ASP.NET MVC or other .NET-centric UI frameworks.\nFamiliarity with microservices patterns, DDD, CQRS or event-driven architectures.\nExperience with container orchestration (Kubernetes).\nKnowledge of message brokers (e.g., RabbitMQ, Kafka, Azure Service Bus).\nExperience with GraphQL and schema design.\nExposure to performance tuning, caching strategies and observability (logs, tracing, metrics).\n \nResponsibilities:\nDesign, implement, and operate scalable backend services using .NET (C#, ASP.NET Core).\nBuild and maintain responsive, accessible user interfaces using modern frontend technologies and/or .NET UI frameworks (e.g., Blazor, Razor Pages).\nDesign and consume robust RESTful APIs (and optionally GraphQL) and integrate with databases and external systems.\nEnsure code quality through testing (unit/integration), code reviews, and automated pipelines.\nDrive architectural decisions for backend, frontend, and their integration (microservices, monoliths, or hybrid).\nCollaborate with designers and product teams to translate requirements into technical solutions and great user experiences.\nTroubleshoot production issues, optimize performance, and ensure application reliability and security.\nMentor and coach other engineers, contribute to best practices and team processes.\nParticipate in an agile development process and help continuously improve delivery and observability.\nDocument design choices, API contracts, and deployment procedures.\n\nWhat we offer:\n\n \nGet paid, not played\nNo more unreliable clients. Enjoy on-time monthly payments with flexible withdrawal options.\n\n\nPredictable project hours\nEnjoy a harmonious work-life balance with consistent 8-hour working days with clients.\n\nFlex days, so you can recharge\nEnjoy up to 24 flex days off per year without losing pay, for full-time positions found through Proxify.\n\nCareer-accelerating positions at cutting-edge companies\nDiscover exclusive long-term remote positions at the world's most exciting companies.\n\nHand-picked opportunities just for you\nSkip the typical recruitment roadblocks and biases with personally matched positions.\n\nOne seamless process, multiple opportunities\nA one-time contracting process for endless opportunities, with no extra assessments.\n\nCompensation\nEnjoy the same pay, every month with positions landed through Proxify.\nTo apply: https://weworkremotely.com/remote-jobs/proxify-ab-senior-fullstack-developer-net",
    "url": "https://weworkremotely.com/remote-jobs/proxify-ab-senior-fullstack-developer-net",
    "source": "WeWorkRemotely",
    "date": "2025-12-06T01:56:00.401Z",
    "expires": "2025-12-13T01:56:00.401Z",
    "id": "live_WeWorkRemotely_1764986160401_6"
  },
  {
    "title": "Proxify AB: Senior Fullstack Developer (React.js & Node.js)",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Sweden\n    \nURL: http://career.proxify.io\n\n\nThe Role:\n \nWe are looking for a Senior Fullstack Developer skilled in React.js and Node.js for one of our clients. You are a perfect candidate if you are growth-oriented, you love what you do, and you enjoy working on new ideas to develop exciting products.\n \nWhat we are looking for:\n \n5+ years experience as a Fullstack Developer.\nBackend experience with:\nNode.js\nMicroservices architecture\nDatabase experience with:\nSQL\nMongoDB\nIntermediate-advanced English\n \nNice-to-have: \nLocated in CET timezone (+/- 3 hours).\nDatabase Architecture knowledge.\n \nResponsibilities:\nAbility to build libraries and frameworks of reusable efficient code.\nCompetence in designing and implementing low-latency, stable and performing applications.\nCapacity to effectively collaborate with other team members and stakeholders remotely.\nAbility to implement data protection systems.\nCompetence in data storage solutions.\n \nWhat we offer:\n\n \nGet paid, not played\nNo more unreliable clients. Enjoy on-time monthly payments with flexible withdrawal options.\n\n\nPredictable project hours\nEnjoy a harmonious work-life balance with consistent 8-hour working days with clients.\n\nFlex days, so you can recharge\nEnjoy up to 24 flex days off per year without losing pay, for full-time positions found through Proxify.\n\nCareer-accelerating positions at cutting-edge companies\nDiscover exclusive long-term remote positions at the world's most exciting companies.\n\nHand-picked opportunities just for you\nSkip the typical recruitment roadblocks and biases with personally matched positions.\n\nOne seamless process, multiple opportunities\nA one-time contracting process for endless opportunities, with no extra assessments.\n\nCompensation\nEnjoy the same pay, every month with positions landed through Proxify.\nTo apply: https://weworkremotely.com/remote-jobs/proxify-ab-senior-fullstack-developer-react-js-node-js",
    "url": "https://weworkremotely.com/remote-jobs/proxify-ab-senior-fullstack-developer-react-js-node-js",
    "source": "WeWorkRemotely",
    "date": "2025-12-06T01:56:00.401Z",
    "expires": "2025-12-13T01:56:00.401Z",
    "id": "live_WeWorkRemotely_1764986160401_7"
  },
  {
    "title": "Software Engineer - Remote",
    "company": "CodeCraft Inc",
    "description": "New Software Engineer position available. Remote work with competitive compensation and benefits. Apply now for immediate consideration.",
    "url": "https://stackoverflow.com/jobs/1764986160966_0",
    "source": "StackOverflow",
    "date": "2025-12-06T01:56:00.966Z",
    "expires": "2025-12-13T01:56:00.966Z",
    "id": "fallback_StackOverflow_1764986160966_0"
  },
  {
    "title": "Mobile Developer - Remote",
    "company": "AppInnovators",
    "description": "New Mobile Developer position available. Remote work with competitive compensation and benefits. Apply now for immediate consideration.",
    "url": "https://stackoverflow.com/jobs/1764986160966_1",
    "source": "StackOverflow",
    "date": "2025-12-06T01:56:00.966Z",
    "expires": "2025-12-13T01:56:00.966Z",
    "id": "fallback_StackOverflow_1764986160966_1"
  },
  {
    "title": "Data Scientist - Remote",
    "company": "Analytics Pro",
    "description": "New Data Scientist position available. Remote work with competitive compensation and benefits. Apply now for immediate consideration.",
    "url": "https://stackoverflow.com/jobs/1764986160966_2",
    "source": "StackOverflow",
    "date": "2025-12-06T01:56:00.966Z",
    "expires": "2025-12-13T01:56:00.966Z",
    "id": "fallback_StackOverflow_1764986160966_2"
  }
]