[
  {
    "title": "Urban Insight: SysAdmin with Drupal Experience - Part Time",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Remote\n    \nURL: http://urbaninsight.com\n\n\n\nWho We Are\nUrban Insight is a leading digital agency creating innovative websites and web applications for organizations that make a difference. We specialize in solving complex problems through website and web app strategy, design and development using open-source content management systems (primarily, Drupal and WordPress, and headless or composable architectures). Our clients include some of the most well-known museums, nonprofits, universities, cities, and other institutions. Urban Insight has been in business for 25 years and continues to expand each year. We thrive on having a professionally rewarding environment where team members are encouraged to grow.\n \nThe Opportunity\nWe are seeking a skilled, detail-oriented SysAdmin. The right individual will have a passion for efficiency, problem-solving, and collaboration. In this role at Urban Insight, you will manage all aspects of our systems, software, and developer operations. You will be instrumental in ensuring the stability, security, and optimal performance of our website development systems, tools, and processes. The ideal candidate will have experience as an IT generalist, and be able to provide guidance and technical support across the company. This position reports to the Director of Infrastructure and will collaborate closely with the Development Department and the entire Urban Insight team.\n \nKey Responsibilities\n\nManage hardware, software, and account access; and provide technical support and troubleshooting across our fully remote, distributed team.\n\nBe the face of technology for all new hires for onboarding and handle all offboarding activities. \n\nManage the security and reliability of our websites (primarily, Drupal and Wordpress), systems, and internal infrastructure.\n\nCollaborate with developers to ensure consistent and efficient work. Make sure they follow best practices, use the right tools, and maintain a strong working relationship.\n\nDevelop and maintain technical documentation, technical policies & procedures; and foster a culture of strong documentation.\n\nManage and perform hosting setup and configuration, security upgrades, and site launches for client projects.\n \n\nQualifications\n\n5+ years proven experience as a Systems Administrator or similar role.\n\nHands-on experience with open-source CMS frameworks such as Drupal & WordPress.\n\nStrong knowledge of system and network administration, including proficiency in Linux/Unix and MacOS environments.\n\nExperience with cloud platform setup and maintenance (e.g., AWS, Azure, Google Cloud).\n\nFamiliarity with web development technologies and tools (e.g. Lando, Docker, Composer).\n\nSolid understanding of security best practices and the ability to implement and monitor them effectively.\n\nExcellent problem-solving and communication skills.\n\nAbility to work well in a collaborative team environment.\n\nRelevant certifications (e.g. AWS Certified SysOps, LPIC-1, CISSP) are a plus.\n \n\nAbout Urban Insight\n\nUrban Insight is a leading digital agency with 35+ team members. https://www.urbaninsight.com/   \n\nWe work with some of the best-known museums, nonprofits and other institutions, such as LACMA, The Broad, University of Southern California, City of Los Angeles, and the Japanese American National Museum.\n\nWe’ve won numerous design awards including such as for our work for Stay Housed Los Angeles and the National World War 1 Museum & Memorial.\n\nWe’re the top-ranked Web development agency in Los Angeles, according to Clutch, an independent analyst. Have a look at what our clients say about us: https://clutch.co/profile/urban-insight \n\nWe have a clearly defined project management methodology and case management system.\n\nWe run on the Entrepreneurial Operating System.\n \n\nWhy Work at Urban Insight?\n\nWe take on interesting, meaningful projects for appreciative clients.\n\nWe offer a flexible working environment - work from anywhere in the United States.\n\nWe work with you to create a career path that works for you.\n\nThe average employee tenure is 6.5 years.\n\nWe're stable and growing. We've been in business for 23+ years and continue to grow each year.\n\nWe offer a casual and flexible working environment with plenty of opportunities for growth for the right candidate.\n\nWe believe in a reasonable life/work balance and enjoy 40-hour work weeks.\n\nWe allocate resources and time for training and professional development.\n\nWe have weekly events to keep the team connected: Lunch & Learns, Lightning Demos, Game Breaks.\n\nThere are many more reasons: https://www.urbaninsight.com/careers \n\n\nCompensation\nWe offer a highly competitive salary, which depends on your qualifications and experience. Our salary package includes:\n\nRate: $30-45/hr depending upon experience.\n\nApprox Schedule: 18 hours per week\n\nPerformance and compensation reviews annually.\n\n \n\nTo apply: https://weworkremotely.com/remote-jobs/urban-insight-sysadmin-with-drupal-experience-part-time",
    "url": "https://weworkremotely.com/remote-jobs/urban-insight-sysadmin-with-drupal-experience-part-time",
    "source": "WeWorkRemotely",
    "date": "2025-11-22T18:33:14.132Z",
    "expires": "2025-11-29T18:33:14.132Z",
    "id": "live_WeWorkRemotely_1763836394132_0"
  },
  {
    "title": "Shippo: Engineering Manager, Web App (Remote)",
    "company": "WeWorkRemotely",
    "description": "Headquarters: United States\n    \nURL: http://goshippo.com\n\n\n\n\nHere at Shippo, we are the shipping layer of the internet and we consider ourselves to be one of the core building blocks of e-commerce. Our mission is to make merchants successful through world class shipping. With our products and solutions, we level the playing field by providing our customers with best-in-class solutions that otherwise wouldn’t be available to them. Through Shippo e-commerce businesses, marketplaces, platforms and a variety of logistics infrastructure providers are able to connect to shipping carriers around the world from one API and dashboard. We provide our customers with the most competitive shipping rates, print labels, automated international documents, shipment tracking, facilitate the returns process and more.\n\n\nHow we’ll deliver success:\n\n\nAs an Engineering Manager for one of Shippo’s web application teams, you’ll lead a cross-functional group of backend, frontend, and fullstack engineers. Your team owns our Order Management system — the foundation that powers merchants’ ability to manage, fulfill, and track their orders — and contributes to product-led UX initiatives that improve the end-to-end shipping experience.\n\n\nYou’ll play a critical role in defining technical direction, driving execution, and growing engineers while partnering closely with Product, Design, and other engineering teams.\n\n\nShipping & handling responsibilities:\n\nLead, mentor, and grow a diverse team of backend, frontend, and fullstack engineers\nSet direction for the Order Management domain — ensuring scalability, reliability, and maintainability\nOwn UX and Webapp core experience improvements that increase merchant success and operational efficiency\nPartner cross-functionally with Product and Design to define roadmaps, deliver high-impact features, and iterate quickly\nFoster a culture of ownership, accountability, and continuous improvement through compassionate candor and clear feedback\nChampion engineering excellence: reliability, performance, observability, and automation across services and web applications\nOwn SLAs/SLOs for key Order Management APIs and workflows, driving adoption of best practices across dependent systems\nLead incident response and root cause analysis with a focus on learning and prevention\nContribute to the technical roadmap, balancing product innovation with system health and technical debt reduction\n\n\n\nRequirements\n\n3+ years of experience managing software engineering teams, including hiring, performance, and career development\n9+ years of overall software engineering experience with a track record of delivering complex, scalable systems\nStrong backend technical foundation (Python, Go, Java, or Ruby) and familiarity with modern frameworks (e.g., Django, FastAPI)\nProven experience designing, integrating, and maintaining APIs (REST, gRPC, SOAP)\nStrong communication skills, with the ability to influence across teams and disciplines\nDeep customer empathy and a focus on delivering measurable value to merchants\nExperience leading teams through both technical execution and organizational change\n\n\n\nBonus\n\nFamiliarity with React.js and modern JavaScript frameworks\nExperience with SQL and NoSQL databases (e.g., DynamoDB)\nExposure to event-driven architectures and queue systems (e.g., Redis, Kafka, NSQ)\nExperience managing external vendor integrations and partner APIs\n\n\n\n$175,000 - $238,000 a year\n\nOur Compensation Shippolicy:\nWe believe compensation is a custom experience and are commited to fair and equitable compensation practices. The standard base pay range for this role is min is $175k to a max $238k annual salary. Since we are focused on hiring Shippos Everywhere, we have 2 US pay ranges, a standard compensation range for the majority of the US and a standard +1 compensation range for those who live in areas where the cost of labor is higher, such as NYC and California.\nThe actual base pay is dependent upon many factors, such as: financial budgets, work experience, training, transferable skills, business needs, and market value. The base pay salary ranges are subject to change and may be modified in the future. Total compensation for this role will include, equity, medical, dental, vision and other benefits noted in our Shippos “package” section.\n\n\nSail through the process:\nHere at Shippo, we celebrate inclusivity and are committed to creating equal access to opportunities for people from all backgrounds, perspectives and geographies. These values define who we are and everything we do. All qualified individuals are encouraged to apply. If you need assistance, or a reasonable accommodation during the application and recruiting process, please contact us at accommodations@goshippo.com\n\n\nShippos in the wild:\nOur people, much like the packages we help ship, are all over the world. This means, through our remote-first program, “Shippos Everywhere”, our roles can be based anywhere in the US with the exception of Delaware, Nevada, Ohio, Oregon, Hawaii, New Mexico and West Virginia and many roles can be based internationally.\nFor locations outside of the US and Ireland, the employment contracts are powered by Remote.com (all Shippo perks still apply - including equity!). What we want to emphasize is that you can be successful at Shippo regardless of location.\n\n\nWe leverage AI to review all resumes during the application phase to ensure fairness, comprehensively evaluate each submission, and mitigate bias. However, all decisions at every stage of the process are made by a real person.\n\nWe may use artificial intelligence (AI) tools to support parts of the hiring process, such as reviewing applications, analyzing resumes, or assessing responses. These tools assist our recruitment team but do not replace human judgment. Final hiring decisions are ultimately made by humans. If you would like more information about how your data is processed, please contact us.\n\n\n\nTo apply: https://weworkremotely.com/remote-jobs/shippo-engineering-manager-web-app-remote",
    "url": "https://weworkremotely.com/remote-jobs/shippo-engineering-manager-web-app-remote",
    "source": "WeWorkRemotely",
    "date": "2025-11-22T18:33:14.132Z",
    "expires": "2025-11-29T18:33:14.132Z",
    "id": "live_WeWorkRemotely_1763836394132_1"
  },
  {
    "title": "FS Studio: Wordpress Web Developer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Argentina\n    \nURL: http://fsstudio.com\n\n\nWeb Developer (WordPress / Design Implementation)\nLocation: Remote\nType: Contract\nFS Studio is looking for a talented Web Developer to join our team to bring our new website vision to life. We’ve designed our site in Framer and now need someone with both strong WordPress development skills and a sharp design eye to translate it into a polished, production-ready site.\nResponsibilities\n\nTranslate the completed Framer design into a fully functional WordPress site, ensuring fidelity to the original layout, typography, and interactions.\n\nApply refinements and polish to the site—spacing, alignment, responsiveness, and micro-interactions—to elevate the overall design quality.\n\nImplement mobile-first responsive design across devices and browsers.\n\nOptimize the site for performance, accessibility, and SEO best practices.\n\nIntegrate required plugins, forms, and CMS features while maintaining a clean, maintainable codebase.\n\nCollaborate with the FS Studio team to finalize details and provide input on UI/UX improvements.\n\nQualifications\n\nProven experience building and customizing WordPress websites from provided designs (portfolio required).\n\nStrong proficiency in HTML5, CSS3, JavaScript, and PHP.\n\nExperience with WordPress theme customization and plugin integration.\n\nKeen design sensibility: ability to match and enhance design details, not just replicate them.\n\nSolid understanding of responsive design, accessibility standards, and cross-browser compatibility.\n\nFamiliarity with SEO optimization and website performance best practices.\n\nBonus: experience working with Framer designs or similar design-to-development workflows.\n\nWhat We’re Looking For\nThis role is perfect for someone who thrives at the intersection of development and design—you’re not just a coder, but someone who cares about the craft of making a site look and feel exceptional.\nTo apply: https://weworkremotely.com/remote-jobs/fs-studio-wordpress-web-developer",
    "url": "https://weworkremotely.com/remote-jobs/fs-studio-wordpress-web-developer",
    "source": "WeWorkRemotely",
    "date": "2025-11-22T18:33:14.132Z",
    "expires": "2025-11-29T18:33:14.132Z",
    "id": "live_WeWorkRemotely_1763836394132_2"
  },
  {
    "title": "Jobgether: Web Developer (Remote)",
    "company": "WeWorkRemotely",
    "description": "Headquarters: United States\n    \nURL: http://jobgether.com\n\n\nDescription\nThis position is posted by Jobgether on behalf of a partner company. We are currently looking for a Web Developer (Remote) in the United States.\nAs a Web Developer, you will have the opportunity to design, build, and maintain interactive, high-quality web applications that support a variety of projects and initiatives. Working remotely, you will collaborate with cross-functional teams to implement responsive designs, integrate back-end data sources, and deliver user-friendly digital solutions. This role emphasizes creative problem-solving, iterative development, and staying current with the latest web technologies and best practices. You will contribute to impactful projects while growing your technical skills in a supportive and flexible environment.\n \nAccountabilities\n\nCollaborate with project teams to plan, design, and develop web applications that meet functional and technical requirements.\nCreate wireframes, mockups, and prototypes to visualize application features and user interfaces.\nBuild cross-browser compatible front-end applications using HTML5, CSS3, TypeScript, and related frameworks.\nAccess and integrate data from various back-end services and databases.\nParticipate in quality initiatives to maintain high standards of software performance and reliability.\nResearch, recommend, and implement new tools, technologies, and development methodologies.\n\n \nRequirements\n\nBachelor’s degree in Computer Science or related field (or equivalent experience).\nMinimum 1 year of experience developing and maintaining interactive web applications.\nProficiency in HTML5, CSS3, TypeScript/JavaScript, and web development frameworks (e.g., npm, jQuery, Bootstrap).\nExperience with responsive design, UI/UX prototyping, and wireframing tools.\nFamiliarity with object-oriented programming languages such as C# or Java.\nStrong problem-solving skills, adaptability, and a willingness to learn new technologies.\nExcellent verbal and written communication skills.\nAbility to work independently and collaboratively in remote and team-based settings.\nPreferred: experience with SCSS/SASS and knowledge of RESTful web services.\nLegal authorization to work in the United States without future sponsorship requirements.\n\n \nBenefits\n\nCompetitive salary range ($88,000 - $99,000) with merit-based increases and bonus opportunities.\nFlexible remote work environment to support work-life balance.\nComprehensive insurance options including health, dental, life, and short- and long-term disability.\nPaid time off and parental leave programs.\nRetirement savings options such as a 401(k) plan.\nProfessional development opportunities including education reimbursement and training programs.\nInclusive and collaborative company culture focused on innovation and personal growth.\n\n \n Jobgether is a Talent Matching Platform that partners with companies worldwide to efficiently connect top talent with the right opportunities through AI-driven job matching.\nWhen you apply, your profile goes through our AI-powered screening process designed to identify top talent efficiently and fairly.\n 🔍 Our AI evaluates your CV and LinkedIn profile thoroughly, analyzing your skills, experience, and achievements.\n 📊 It compares your profile to the job’s core requirements and past success factors to determine your match score.\n 🎯 Based on this analysis, we automatically shortlist the three candidates with the highest match to the role.\n 🧠 When necessary, our human team may perform an additional manual review to ensure no strong profile is missed.\nThis process is transparent, skills-based, and free of bias, focusing solely on your fit for the role.\n Once the shortlist is completed, we share it directly with the company offering the position. The final decision and next steps (such as interviews or assessments) are made by their internal hiring team.\nThank you for your interest!\n \n\n#LI-CL1\nTo apply: https://weworkremotely.com/remote-jobs/jobgether-web-developer-remote",
    "url": "https://weworkremotely.com/remote-jobs/jobgether-web-developer-remote",
    "source": "WeWorkRemotely",
    "date": "2025-11-22T18:33:14.132Z",
    "expires": "2025-11-29T18:33:14.132Z",
    "id": "live_WeWorkRemotely_1763836394132_3"
  },
  {
    "title": "Syteca: Web Developer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Lviv, UA\n    \nURL: http://syteca.com\n\n\n\nSyteca Inc. is a recognized software vendor delivering a cybersecurity platform dedicated to inside perimeter security. The Syteca platform provides advanced user activity monitoring (UAM) and robust privileged access management (PAM) solutions to organizations in every industry and sector.\nFounded as Ekran System in 2013 by a team of passionate cybersecurity experts, Syteca Inc. has grown into a global cybersecurity provider for more than 1,500 organizations across every industry on every continent. With headquarters in Needham, MA, USA, and a worldwide network of offices and partners, we're dedicated to safeguarding organizations of all sizes from human-related risks.\nWe invite a Web Developer who is excited about technology to join our team. \nYou will learn from our experts and get a unique experience to become an expert yourself.  \nResponsibilities: \n- Implementing new features\n- Bugs fixing and support of the existing system\n\n- CI/CD activities, production maintenance \nRequirements: \n- 3 years of commercial experience with specified tech tasks\n- Work experience with WordPress (Gutenberg), PHP, MySQL \n- Proficiency in JavaScript, CSS, HTML \n\n- Knowledge of Linux, Docker, Nginx \n- Ready to learn React.js & .NET and handle some minor task in this tech stack\n- English level: pre-intermediate\nWould be a plus: \n-Knowledge of Bootstrap, SCSS, Bamboo, Cloudflare \nOur benefits:\n-Remote/hybrid work according to your needs\n-Flexible working hours\n-20 working days of paid annual leave and paid sick leaves\n-Necessary equipment - a laptop, monitor, additional accessories\n-Career advancement and professional growth\n-Personalized learning approach (mentoring, internal courses, knowledge sharing)\n-Regular development - experienced team, regular 1: 1, development plan according to your needs\n-English lessons and practice with a native speaker\nIf you are interested in this position, please send us your detailed CV.\n\n\nTo apply: https://weworkremotely.com/remote-jobs/syteca-web-developer",
    "url": "https://weworkremotely.com/remote-jobs/syteca-web-developer",
    "source": "WeWorkRemotely",
    "date": "2025-11-22T18:33:14.132Z",
    "expires": "2025-11-29T18:33:14.132Z",
    "id": "live_WeWorkRemotely_1763836394132_4"
  },
  {
    "title": "Rocky Mountain College of Art + Design: Subject Matter Expert | Web Design I",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Remote\n    \nURL: http://rmcad.edu\n\n\n\n\nSubject Matter Expert | Web Design I\nGraphic Design 3115 a studio level course within our Graphic Design department. This intermediate course focuses on taking the principles from traditional graphic design and applying them to the online environment. Students are introduced to site architecture, concept mapping, and digital code. Websites will be tested and used for optimal browser display, information architecture, and user needs. Upon successful completion of this course, students will have gained an understanding of the common challenges of creating and design in interactive media through prototyping, flow-charting, pre-production, production, and execution of a final website design. RMCAD aims for the Subject Matter Expert (SME) to construct the course, ensuring it’s prepared for launch.\n\n \nCollaborate with instructional designers and fellow faculty members to develop an engaging and innovating course \nMentor and support students in their creative and technical endeavors, fostering an applied and experiential learning environment\nContribute to the ongoing development and expansion of our progressive Graphic Design program\n\nQualifications:\nMaster's degree or higher\nMust live in one of the following states: AZ, CA, CO, FL, NY, VA or TX\nExperience in course design and development processes, preferably for asynchronous online delivery\nProven track record of successful experiential and applied approaches to student learning\nExperience or knowledge of asynchronous online education, and proficiency in using learning management systems and online teaching tools\n\n\nReview of applications will begin as soon as possible and continue until the position is filled. Ideally, RMCAD aims for the Subject Matter Expert (SME) to construct the course, ensuring it’s prepared for launch by the fall A semester.\nRocky Mountain College of Art + Design is an Equal Opportunity Employer\n\n\n\nTo apply: https://weworkremotely.com/remote-jobs/rocky-mountain-college-of-art-design-subject-matter-expert-web-design-i",
    "url": "https://weworkremotely.com/remote-jobs/rocky-mountain-college-of-art-design-subject-matter-expert-web-design-i",
    "source": "WeWorkRemotely",
    "date": "2025-11-22T18:33:14.132Z",
    "expires": "2025-11-29T18:33:14.132Z",
    "id": "live_WeWorkRemotely_1763836394132_5"
  },
  {
    "title": "The Church of Jesus Christ of Latter-day Saints: Frontend Web Development Grader - BYU-Pathway Worldwide",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Sao Paulo, SP, Brazil\n    \nURL: http://churchofjesuschrist.org\n\n\nDescription\nCandidates must be fluent in English and submit their application in English to be considered.\nOnly those currently living in and authorized to work in Brazil are eligible.\nThe application system will store candidate information. Once submitted, application details will be shared with Church Education System (CES) partners involved in the selection process. Applicants may receive a rejection email during or after review; however, unless a direct rejection is received from the hiring manager, applications will remain active and under consideration.\nThis posting serves as an interest list for future opportunities. Because hiring is based on enrollment needs, applicants may not be contacted immediately. Candidates not selected at this time will remain on file for consideration as future positions become available.\nIf you have any questions, please contact our Human Resources representative, Easton at ebiddulph@byupw.edu.\n \nJob Description\nBYU Pathway and BYU Idaho online courses include both an instructor and graders. Instructors handle teaching and overall course delivery, while graders support learning by evaluating assignments and providing constructive feedback. We are seeking graders (support staff) who will apply their skills and subject expertise to grade assignments, support student learning, provide feedback, and collaborate with instructors.\nImportant: This is a part-time work-from-home position with the following flexible schedule:\n\n10-12 hours per week (may vary week-to-week)\n\nCourse Description\nGrading support (using JavaScript, HTML, and CSS) for:\n\nWDD 130 - Web Fundamentals\nWDD 131 – Dynamic Web Fundamentals\nWDD 231 - Web Frontend Development I\nWDD 330 - Web Frontend Development II\n\nThese courses provide students with foundational web design and development skills, enabling them to contribute to web development teams.\n\nResponsibilities\n\nUsing university and department procedures and materials to evaluate student work (rubrics and feedback templates).\nEnsuring feedback is actionable, timely, and accurate.\nResponding to student questions and concerns about scoring.\nCoordinating with supervisors for quick resolution of grading issues.\nParticipating in training sessions to receive guidance and feedback.\nApplying feedback from training and quality checks to improve performance.\nPerforming other duties as assigned in support of the academic process.\n\nQualifications\nNOTE: An applicant’s résumé and official transcripts will be used to determine eligibility for grading the Frontend Web Development courses. Please clearly highlight relevant education, professional work, and technologies on your résumé.\n \nGeneral Grader Requirements:\n\nDegree or coursework in a related field.\nDemonstrated subject matter expertise.\nFluency in Portuguese and English (required).\nExperience with online teaching/learning, especially with at-risk learners (preferred).\nHigh accuracy, efficiency, and reliability in following procedures and meeting deadlines.\nAbility to focus and maintain quality, even with repetitive or complex tasks.\nAdaptability to new processes, procedures, and technologies.\nProfessional, respectful, and unbiased in sensitive situations.\nProficiency in Microsoft Office and discipline-specific software.\nProven ability to grade effectively within these subject areas.\n\n \nSpecific Course Requirements: Frontend Web Development\n\nA bachelor’s degree in computer science or a related field is preferred.\nEquivalent education and/or work experience may be considered.\nExperience with the following is required: JavaScript, HTML, CSS, JSON.\nUnderstanding of web design principles, such as simplicity, responsiveness, usability, and visual design.\nExpert proficiency with basic web design and development concepts, such as DOM manipulation, form and event handling, JavaScript objects and functions, CSS layout and presentation, and data retrieval mechanisms.\nExperience with version control software, such as GitHub.\nExperience with code editors, such as Visual Studio Code.\nExperience with browser tools, such as Chrome Developer Tools.\nAttention to detail.\nAbility to follow test cases with efficiency, exactness, and accuracy.\nAbility to quickly read and debug imperfect code.\nAbility to communicate clearly in writing.\n\n \nAdditional Documentation Requirement\nCandidates who are selected to advance to the next stages of the hiring process will be required to provide the following academic documents:\n\nCopy of original transcript (histórico escolar)\nCopy of diploma (front and back) that clearly shows either the date of completion or the date of graduation/commencement ceremony (data da colação de grau)\n\nAcademic documents issued by Brazilian or international institutions are acceptable, provided that the documents are officially recognized in Brazil and their country of origin. (Bacharelado/Licenciatura)\n \nDocumentação Adicional Requerida\nOs(as) candidatos(as) selecionados(as) para as próximas etapas do processo seletivo deverão apresentar os seguintes documentos acadêmicos:\n\nCópia do histórico escolar (original).\nCópia do diploma (frente e verso) que comprove claramente a data de conclusão ou a data da colação de grau.\n\nSerão aceitos documentos acadêmicos emitidos por instituições brasileiras ou estrangeiras, desde que reconhecidos oficialmente no Brasil e no país de origem (Bacharelado/Licenciatura).\n\n\n\n\nTo apply: https://weworkremotely.com/remote-jobs/the-church-of-jesus-christ-of-latter-day-saints-frontend-web-development-grader-byu-pathway-worldwide",
    "url": "https://weworkremotely.com/remote-jobs/the-church-of-jesus-christ-of-latter-day-saints-frontend-web-development-grader-byu-pathway-worldwide",
    "source": "WeWorkRemotely",
    "date": "2025-11-22T18:33:14.132Z",
    "expires": "2025-11-29T18:33:14.132Z",
    "id": "live_WeWorkRemotely_1763836394132_6"
  },
  {
    "title": "WeAssist.io: Shopify Web Developer (IB)",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Philippines\n    \nURL: http://weassist.io\n\n\n\nHiring: Full-time Shopify Web Developer - Remote - $18,000 - $24,000/yr\n\n🚀 About the Client 🚀\n🧺 Luxury Laundry Care – Premium detergents and products that transform everyday laundry into a refined experience\n🌸 Signature Fragrances – Unique scent profiles crafted to stand apart in the market\n📈 Fast-Growing – Millions in annual revenue, scaling quickly with high-impact launches\n🤝 Collaborative Spirit – Cross-functional teamwork with marketing, design, and growth teams\n🌍 Entrepreneurial Culture – Creative, fast-paced, and results-oriented\n\n🌟 About WeAssist 💡\n🌍 Led by a Founder Who Cares – Reef Colman built WeAssist to empower individuals and create meaningful opportunities that support families.\n⚡ Fast & Purposeful Recruiting – We move quickly but prioritize long-term fit, stability, and growth over just filling roles.\n🌎 Connecting Global Talent – With 100+ outsourced professionals and growing, we link top talent worldwide with thriving US businesses.\n❤️ Giving Back Matters – From building schools to feeding the homeless, we believe true success means making a difference.\n🤝 An Inclusive & Thriving Culture – Your skills and unique gifts matter. We create an environment where outsourced professionals don’t just work—they grow.\n\n⚒️ Key Responsibilities of the Shopify Web Developer 📝\n🛍 Store Dev & Customization\n⚡ Site Optimization & Performance\n🛠 Troubleshooting & Maintenance\n🔗 Integrations & Automation\n🤝 Collaboration & Growth\n📈 Research & Innovation\n\n\nAdditional Information: \nReview this Doc first!\nHow to Prepare for the Recruiting Process - \nhttps://docs.google.com/document/d/1tCWNqlU4gNG4nQaEeo5iSKNB8A8X7xAlVCMDvZwkdDk/edit?tab=t.0#heading=h.gt6n5ybw2ujb \n\n\n📢 Why Are They Hiring a Shopify Web Developer?\nOur client is hiring a Shopify Web Developer to own their e-commerce storefront end-to-end. With frequent product launches and a rapidly scaling customer base, they need someone who can keep the site fast, functional, and flawless. This isn’t just about writing code—it’s about creating a high-converting, beautifully designed shopping experience that delights customers and drives growth.\nIf you’re excited to bring design, performance, and innovation together to power a fast-growing luxury brand, this is your chance to make a visible impact every single day. 🚀 \n✅Qualifications:\nMust-Have: \n💻 3+ years of Shopify development experience (Shopify Plus preferred)\n🌐 Strong in HTML, CSS, JavaScript, Liquid, and responsive design principles\n🎨 Understanding of e-commerce UX/UI best practices\n🔗 Experience with APIs, third-party app integrations, and Shopify Scripts\n📊 Familiarity with SEO best practices for Shopify\n⚡ Comfortable in a fast-paced, entrepreneurial environment\n🗣 Strong communication and cross-team collaboration skills\n\nNice to Have:\nExperience with subscriptions (Recharge, Skio, etc.)\nFamiliarity with analytics (Google Analytics, TripleWhale)\nBackground in DTC premium/lifestyle brands\n\n\n\n\n\nResponsibilities of the Shopify Web Developer:\nYour responsibilities include:\n🛍 Store Development & Customization\nDevelop, customize, and maintain the Shopify Plus storefront and related integrations\nImplement pixel-perfect designs from Figma into responsive Shopify themes\nDevelop both front-end and back-end features \nLaunch new products and campaigns every 4–6 weeks, ensuring flawless rollouts\nEnsure creative assets from design/marketing are implemented seamlessly\nIntegrate and customize Shopify apps, scripts, and APIs as needed\n\n\n\n⚡ Site Optimization & Performance\nContinuously monitor and improve site speed, load times, and responsiveness\nOptimize scripts, images, and code to support a mobile-first experience\nLeverage PageSpeed Insights and other tools to maintain high performance scores\nProactively identify bottlenecks and implement long-term performance fixes\n\n\n\n🛠 Troubleshooting & Maintenance\nQuickly debug and resolve technical issues to minimize downtime\nTest changes in staging environments before deployment\nDeploy updates during low-traffic windows to protect customer experience\nMaintain clean code and ensure consistency across updates\n\n\n\n🔗 Integrations & Automation\nManage critical integrations (Recharge, Klaviyo, TripleWhale, analytics, and pixel tracking)\nTroubleshoot app conflicts and ensure all third-party tools work seamlessly\nRecommend new apps, tools, and automations to streamline workflows\n\n\n\n🤝 Collaboration & Growth\nPartner with marketing/design teams to execute high-impact launches\nProvide feasibility input on timelines and campaigns\nShare ideas to improve UX, conversions, and checkout flow\nStay current with Shopify updates and e-commerce best practices\nDocument processes and create scalable dev workflows for future growth\n\n\n\n📈 Research & Innovation\nExplore emerging Shopify trends and suggest opportunities for innovation\nTest and recommend A/B strategies to improve conversion rates\nContribute insights to strengthen the DTC customer journey\n\n\n\n\n🏡 Want to Know More About the Client?\nOur client is transforming the way people experience everyday laundry by turning it into a luxury ritual. As a premium direct-to-consumer laundry care brand, they blend sophisticated fragrances, high-performance cleaning formulas, and elevated design to bring elegance to the most ordinary of routines. Their products stand out in a crowded market by offering customers not just clean clothes, but an indulgent, memorable experience. With sustainability at the core, they’ve replaced bulky plastic jugs with eco-friendly boxes made from 60% post-consumer recycled cardboard. Backed by millions in annual revenue and a loyal, growing community, they’re scaling rapidly while staying true to their values of creativity, performance, and innovation. \nJoining their team means shaping a brand that elevates everyday life with beauty, purpose, and impact. 🌟\n\nWhat’s in it for you? 😏\nJoining this client means not just filling a role but embarking on a personal development journey. The growth potential is substantial, with opportunities to:\n💰 Competitive Pay – Rewarding package aligned with experience, skill, and the impact you bring\n🌎 Remote-First – Work from anywhere with slightly flexible hours\n📈 Growth Path – Opportunity to step into strategic ownership of site development and even lead future dev hires\n💡 Creative Freedom – Your ideas for UX, conversions, and new features will be heard and valued\n🌱 Mission-Driven Brand – Be part of a company committed to sustainability (eco-friendly packaging, no plastic jugs)\n🤝 Collaborative Team – Work alongside creative marketers, designers, and growth leaders\n🛠 Cutting-Edge Tech – Gain exposure to Shopify Plus, Recharge, Klaviyo, TripleWhale, and more\n🎉 Fast-Paced Excitement – New products and campaigns every 4–6 weeks keep work fresh and dynamic\n\nYour next big opportunity starts here—ready to take the leap? 🚀\n\n\nPerks:\n13th Month Bonus (Wild right?! 🤯)\nPermanent work-from-home / remote set-up 🌴\nHealth insurance 👨‍⚕️\nDental insurance 🪥\nMental health insurance 🧠\nGreat starting salary 💰\nGrowth opportunity 📈\nPerformance-based raises 💸\nPrizes and bonuses 🏆\n\n\n\n\nSpecifics:\n\nTime \nFull-time; PST/EST \n4–5 hours of daily overlap; \nRemaining hours flexible based on workload and coordination needs\n\nThis is a remote position so you can have the freedom to work from anywhere\n\n\n\nMiscellaneous\nAttire - business casual when in meetings\nProfessional setup (Pains me I actually need to write this down… 👀)\nClean background\nGood camera\nGood microphone \nStrong wifi\n\n\n\n\nTech Stack\nShopify Plus\nHTML, CSS, JavaScript, Liquid\nThird-party app integrations, APIs, and Shopify Scripts\n\n\nCompensation\nFixed Rate $18,000 - $24,000/yr\n\n\nTo apply: https://weworkremotely.com/remote-jobs/weassist-io-shopify-web-developer-ib",
    "url": "https://weworkremotely.com/remote-jobs/weassist-io-shopify-web-developer-ib",
    "source": "WeWorkRemotely",
    "date": "2025-11-22T18:33:14.132Z",
    "expires": "2025-11-29T18:33:14.132Z",
    "id": "live_WeWorkRemotely_1763836394132_7"
  },
  {
    "title": "Software Engineer - Remote",
    "company": "CodeCraft Inc",
    "description": "New Software Engineer position available. Remote work with competitive compensation and benefits. Apply now for immediate consideration.",
    "url": "https://stackoverflow.com/jobs/1763836394729_0",
    "source": "StackOverflow",
    "date": "2025-11-22T18:33:14.729Z",
    "expires": "2025-11-29T18:33:14.729Z",
    "id": "fallback_StackOverflow_1763836394729_0"
  },
  {
    "title": "Mobile Developer - Remote",
    "company": "AppInnovators",
    "description": "New Mobile Developer position available. Remote work with competitive compensation and benefits. Apply now for immediate consideration.",
    "url": "https://stackoverflow.com/jobs/1763836394729_1",
    "source": "StackOverflow",
    "date": "2025-11-22T18:33:14.729Z",
    "expires": "2025-11-29T18:33:14.729Z",
    "id": "fallback_StackOverflow_1763836394729_1"
  },
  {
    "title": "Data Scientist - Remote",
    "company": "Analytics Pro",
    "description": "New Data Scientist position available. Remote work with competitive compensation and benefits. Apply now for immediate consideration.",
    "url": "https://stackoverflow.com/jobs/1763836394729_2",
    "source": "StackOverflow",
    "date": "2025-11-22T18:33:14.729Z",
    "expires": "2025-11-29T18:33:14.729Z",
    "id": "fallback_StackOverflow_1763836394729_2"
  }
]