[
  {
    "title": "OnTheGoSystems: PHP and React Developer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: 100% remote\n    \nURL: https://onthegosystems.com\n\n\nOntheGoSystems is looking for senior developers to build products that over 250,000 happy clients use every day. We write PHP and React code and fully cover it by automated tests. We pay close attention to design, usability, performance and security. If this sounds like yourself, we want to meet.\nWhat strong skills we’re looking for in our developers\nStrong skills in PHP, React, Redux\nExpertise in databases,\nProficiency in writing and applying automated tests with PHPUnit,\nExperience in writing end-to-end tests,\nProficiency in version control with Git,\nA strong foundation in design patterns, and networking.\nWhat you will do\nBuild and maintain key features for WPML, ensuring they are reliable and perform well.\nWork with other teams to design and develop new features and improvements.\nSolve technical problems and make sure the code is clean, efficient, and scalable.\nTake charge of your projects from start to finish, managing your time and priorities effectively.\nHelp improve our development process and suggest ways to make things more efficient.\nOur expectations\nCode Quality: Write clean, well-documented code that meets company standards.\nTest Coverage: Ensure the code is covered by automated tests.\nMeaningful Logs: Provide clear, insightful logs to track system performance.\nContinuous Improvement: Learn new skills, improve processes, and contribute to team growth.\nWhat we offer\n100% remote position,\nBody And Mind Movement (BAMM) program to support your physical activities and other hobbies,\nA computer budget to make your workplace better,\nA Kindle device with an access to our company Amazon account,\nWe respect national holidays in each country and want you to have a rest on those days,\nBeing a part of a team of smart, self-driven individuals,\nGreat opportunity to progress and advance,\nCollaborating with team members across the globe.\nIf it sounds interesting to you, apply today and we are looking forward to getting to know you better!\nTo apply: https://weworkremotely.com/remote-jobs/onthegosystems-php-and-react-developer",
    "url": "https://weworkremotely.com/remote-jobs/onthegosystems-php-and-react-developer",
    "source": "WeWorkRemotely",
    "date": "2025-11-14T01:59:06.149Z",
    "expires": "2025-11-21T01:59:06.149Z",
    "id": "live_WeWorkRemotely_1763085546149_0"
  },
  {
    "title": "Lemon.io: Senior iOS/Swift Developer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: New York, NY\n    \nURL: https://lemon.io\n\n\nAre you a talented Senior Developer looking for a remote job that lets you show your skills and get decent compensation? Look no further than Lemon.io — the marketplace that connects you with hand-picked startups in the US and Europe.\nWhat we offer:\nThe rate depends on your seniority level, skills and experience. We've already paid out over $11M to our engineers.\nNo more hunting for clients or negotiating rates — let us handle the business side of things so you can focus on what you do best.\nWe'll manually find the best project for you according to your skills and preferences.\nChoose a schedule that works best for you. It’s possible to communicate async or minimally overlap within team working hours.\nWe respect your seniority so you can expect no micromanagement or screen trackers.\nCommunicate directly with the clients. Most of them have technical backgrounds. Sounds good, yeah?\nWe will support you from the time you submit the application throughout all cooperation stages.\nMost of our projects involve working in a fast-paced startup environment. We hope you like it as much as we do.\nThrough our community, we will connect you with the best developers from more than 50 countries.\nRequirements:\n5+ years of experience in mobile iOS software development\n5+ years of experience with Swift and strong knowledge of its ecosystem\n2+ years of commercial experience with SwiftUI\nExperience in publishing iOS apps in the App Store\nExperience developing macOS, tvOS, watchOS applications is a plus\nStrong technical skills: as a Senior Developer, you are expected to be able to create projects from scratch and have a deep understanding of application architecture.\nClear and effective communication in English — advanced ability to discuss business tasks, justify decisions, and communicate issues. Good self-presentation is also essential for upcoming client calls.\nStrong self-organizational skills — ability to work full-time remotely with no supervision.\nReliability — we want to trust you and expect that you won’t let us and the client down.\nAdaptability and Flexibility — the ability to onboard the project promptly after accepting it and start delivering results quickly.\nSounds good for you? Apply now and join the Lemon.io community!\nNOT YOUR TECH STACK?\nWe have different projects for Senior Developers, so if you have 4+ years of commercial experience in software development and you are fluent with React & Node.js, React & Python, Node & Python, Unreal Engine, Data Engineering, WordPress, Blockchain, Svelte & TypeScript, Svelte & Node, Svelte & Python, or Shopify & JavaScript, Golang, PHP & Vue, Rust, MLOps, we would be happy to communicate and provide you with a project that matches your experience. Just apply, and we will share more details with you.\nIf your experience matches our requirements, be ready for the next steps:\nVideoAsk — watch a short video about our startup, up to 10 minutes\nComplete your profile on our website\n30-minute screening call\nTechnical interview\nFeedback\nMagic Box (we are looking for the best project for you).\nWe do not provide visa assistance, and our cooperation model does not include the benefits typically offered with direct hire.\nP.S. We work with developers from 70+ countries in different regions: Europe, LATAM, the U.S (if you are an owner of W-9 ben form), Canada, Asia (Japan, Singapore, South Korea, Philippines, Indonesia), Oceania (Australia, New Zealand, Papua New Guinea), and the the UK. However, we have some exceptions.\nAt the moment, we don’t have a legal basis to accept applicants from the following countries:\nEuropean: Iceland, Liechtenstein, Kosovo, Belarus, Russia, and Serbia.\nLatin America: Cuba and Nicaragua\nMost Asian countries and Africa.\nWe expand and shorten the list of exemptions regularly.\nWe do not provide visa assistance, and our cooperation model does not include the benefits typically offered with direct hire.\nDo you represent a company with engineers who match the description and want to collaborate with us through staff augmentation? Then register here.\nTo apply: https://weworkremotely.com/remote-jobs/lemon-io-senior-ios-swift-developer",
    "url": "https://weworkremotely.com/remote-jobs/lemon-io-senior-ios-swift-developer",
    "source": "WeWorkRemotely",
    "date": "2025-11-14T01:59:06.149Z",
    "expires": "2025-11-21T01:59:06.149Z",
    "id": "live_WeWorkRemotely_1763085546149_1"
  },
  {
    "title": "Sticker Mule: Software engineer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: New York, NY\n    \nURL: https://www.stickermule.com\n\n\nAbout Sticker Mule\nSticker Mule, the Internet's favorite custom printer, is building the Internet's best commerce platform. We are privately-owned, which means no meddlesome investors, with 9-figures in annual revenue and great profitability. Our commerce platform (Stores) helped people earn $200k while in beta and now we are hiring to accelerate development.\n \nWe offer\nRemote work with flexible schedules\nA privately owned, low-stress culture\nA fun \"no bullshit\" work environment\nGreat compensation with rising wages.\n \nCompensation and benefits\nSalary: $145K \n$20,000 signing bonus\n4 weeks vacation + holidays based on your country of residence\n \nWe like you to know\nGo\nTypeScript\nReact Native (Expo) \nGraphQL\nPostgres\nRedis\nDocker\nKubernetes\nGoogle Cloud Platform\nExcellent communication skills (English)\nDegree in Computer Science or equivalent practical experience\n \nWhat you will work on\nYou'll help us develop our new Stores platform that already helped sellers earn nearly $200,000 while in beta. Stores is supported by a suite of tools that help anyone succeed online including Give (our giveaway platform), Ship (our shipping platform, Notify (our forthcoming email/sms marketing platform), and more coming soon.\n \nWe have an incredible roadmap and need your help to execute it quickly.\nTo apply: https://weworkremotely.com/remote-jobs/sticker-mule-software-engineer-1",
    "url": "https://weworkremotely.com/remote-jobs/sticker-mule-software-engineer-1",
    "source": "WeWorkRemotely",
    "date": "2025-11-14T01:59:06.149Z",
    "expires": "2025-11-21T01:59:06.149Z",
    "id": "live_WeWorkRemotely_1763085546149_2"
  },
  {
    "title": "Proton: [Electronic Music] Senior Full Stack Software Engineer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: USA\n    \nURL: https://www.protonradio.com/\n\n\nWe’re looking for a Senior Full-Stack Engineer with strong back-end expertise to help modernize and maintain critical systems—especially those that aren’t always glamorous (like legacy codebases)—but are essential to the heartbeat of our platform. This is not a management role. We want a dependable, experienced developer excited to improve stability, scalability, and maintainability.\nYou’ll work closely with our fully remote team to support systems written in Ruby on Rails and PHP/Laravel, with some involvement in React/Next.js/TypeScript front-ends. We’re especially interested in engineers who enjoy getting their hands dirty, take pride in quality, and can work independently with minimal direction.\nWhy Join Proton\nRemote-first culture with flexible hours.\nCollaborative, respectful team with a passion for music and code.\nOpportunities to grow across technologies and systems.\nCompetitive compensation and meaningful work supporting independent artists.\nProton is a values driven organization, meaning we aim to align the actions we take with shared ideals. Each team at Proton has its own value system; you can check the engineering team's here.\nWhat You’ll Do\nMaintain, refactor, and improve existing systems—including a legacy PHP app with raw SQL.\nContribute to modernizing that app in Laravel, Rails, and GraphQL.\nSupport our Rails platform with clean, scalable code.\nCollaborate with front-end engineers on React/Next.js projects when needed.\nBe able to write performant SQL queries for use-cases when the ORM is not performant enough.\nAssist in API work, including migrating from REST to GraphQL.\nWork across cloud platforms (GCP, Netlify), Docker, and CI/CD pipelines.\nFollow Shape Up methodology to deliver focused, high-impact work.\nWhat We’re Looking For\n5+ years of back-end or full-stack development experience.\nExtensive experience with a modern web application framework (e.g., Ruby on Rails, PHP/Laravel, Django, Spring, .NET, etc.).\nFamiliarity with Ruby on Rails or PHP/Laravel is a plus — or enthusiasm to quickly learn them if not already experienced.\nStrong SQL skills—confident writing queries without an ORM.\nFamiliarity with React, Next.js, and TypeScript.\nComfortable working in a remote, async-first team with excellent communication skills.\nExperience with Git/GitHub, Docker, and cloud infrastructure.\nSelf-driven, accountable, and eager to learn.\nNice to Haves\nExperience with Laravel migrations or legacy-to-modernization projects.\nFamiliarity with the Shape Up process or similar agile methods.\nAwareness of web security fundamentals.\n\nTo apply: https://weworkremotely.com/remote-jobs/proton-electronic-music-senior-full-stack-software-engineer",
    "url": "https://weworkremotely.com/remote-jobs/proton-electronic-music-senior-full-stack-software-engineer",
    "source": "WeWorkRemotely",
    "date": "2025-11-14T01:59:06.149Z",
    "expires": "2025-11-21T01:59:06.149Z",
    "id": "live_WeWorkRemotely_1763085546149_3"
  },
  {
    "title": "CompanyCam: Senior Software Engineer (React/React Native)",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Lincoln, Nebraska\n    \nURL: https://companycam.com/\n\n\n \nThe Role\nWe’re looking for a sharp, driven, problem-solving Senior Software Engineer (React/React Native) to join our engineering team.\nAs a Senior Software Engineer, you’ll work alongside other engineers, designers, and product managers to tackle everything from huge company initiatives to modest but important bug fixes. While your primary focus will be frontend development, we value engineers who are T-shaped, bringing deep expertise in one area while being comfortable contributing in others. Whether that means leading the way on web and mobile, diving into backend code, or lending an extra set of eyes in discovery, you’ll collaborate with your teammates to move work forward.\nMost importantly, you’ll actively contribute to the evolution of the culture and processes of a growing engineering team, especially our client engineering discipline (this is what we call the frontend web and mobile disciplines collectively). We want devs with opinions on patterns, code organization, and processes to help make sure our codebases scale healthily, and an interest in mentoring to help make sure our devs do too.\nWorking At CompanyCam\nOur engineering team is remote-first, spanning every time zone in the United States. We welcome people from all backgrounds and really don't care whether or not you have a CS degree or even a high school diploma. All that matters is that you're not an a**hole and you're good at what you do.\nAt CompanyCam we’re driven to produce work with meaningful outcomes. That means not just dumping features and “improvements” but being able to reflect and learn from our outputs. We’re actively working to center our work on continuous discovery habits (CDH) as outlined by Teresa Torres.\nOur teams are made up of a product manager, a product designer, a tech lead and an appropriate number of engineers for the scope of your team. We take a flexible approach, pulling from Agile, Scrum, Kanban, and even Shape Up. Rather than being overly prescriptive, we provide guardrails and just enough constraints to keep teams moving. Each team is expected to collaborate, iterate, and refine their best practices to produce high-quality work.\nWhat You’ll Do\nDesign, implement and deliver complex, cross-cutting features and systems in React and React Native, and occasionally in Ruby on Rails.\nLead efforts to address technical debt and system reliability, proactively identifying areas for refactoring or optimization.\nInfluence and evolve the architecture and system design, anticipating future needs and driving long-term improvements across services and applications.\nSet and uphold high standards for code quality, testing coverage, and documentation, mentoring others to do the same.\nDrive improvements to internal tooling to enhance developer experience and system resilience.\nFacilitate technical discussions and decision-making, helping the team navigate trade-offs and align on best solutions.\nAct as a point of escalation for complex technical challenges, supporting team members in unblocking progress.\nPartner closely with product managers, designers, and engineers, shaping feature direction by identifying technical opportunities, risks, and trade-offs early in discovery.\nWhat You’ll Bring\nMust-haves\nThese are our non-negotiables:\nShow up: give us your best and have the courage to do difficult but necessary stuff.\nGrow up: be humble, take responsibility, learn continuously, and have a growth mindset.\nDo good: treat your co-workers and customers the way you want to be treated.\n5+ years of experience working as a professional developer. (Not all years of experience are created equal, so this one isn't set in stone).\nAdvanced proficiency in React and Redux, or an equivalent JS framework and state management library, with experience guiding architectural decisions and best practices for frontend systems.\nExperience with React Native or native iOS or Android.\nExperience contributing across the full stack, including front-end, back-end, and data layers.\nDemonstrated experience in leveraging artificial intelligence (AI) to build, enhance, or optimize tools and features within products, driving innovation and improving user experience.\nAbility to handle complex tasks and ambiguous problems without guidance.\nUnderstanding of business trade-offs and ability to effectively communicate the risks and benefits of various technical approaches.\nStrong collaboration skills with the ability to lift up the team by providing mentorship and proactive feedback.\nYou live and work permanently in the U.S. (We’re not set up to hire outside the U.S.).\nNice-to-haves\nYou’ll encounter the following technologies with varying frequency — experience with them is a plus, but not required:\nGraphQL & REST\nApollo & TanStack Query\nRuby on Rails\nAndroid Studio & Xcode\nNative mobile development (Java, Objective-C, Kotlin, Swift)\nSnowflake\nExperience integrating with large language models (e.g., OpenAI, Gemini)\nBenefits and Compensation\nThis is a salaried position at CompanyCam. Our salary range is $175,000 - $200,000 per year and is based on experience. We also offer meaningful equity and other benefits.\nCompanyCam is an equal-opportunity employer committed to respect, inclusion, and growth. We work hard, take responsibility, and support each other. Great ideas come from all backgrounds, and we carefully consider every applicant without regard to personal characteristics or traits. Even if your work experience doesn’t align perfectly, we encourage you to apply. What really matters to us is your potential, your passion, and your commitment to learning, innovation, and contributing meaningfully to our team.\nFor any accommodations or technical issues related to the online application or interview process, please email jobs@companycam.com and we’ll respond promptly. Please do not include any medical or health information in your message.\nTo apply: https://weworkremotely.com/remote-jobs/companycam-senior-software-engineer-react-react-native",
    "url": "https://weworkremotely.com/remote-jobs/companycam-senior-software-engineer-react-react-native",
    "source": "WeWorkRemotely",
    "date": "2025-11-14T01:59:06.149Z",
    "expires": "2025-11-21T01:59:06.149Z",
    "id": "live_WeWorkRemotely_1763085546149_4"
  },
  {
    "title": "boeone: ios developer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: China\n    \nURL: https://boeone.com\n\n\nWe are looking for an expert He needs to have an Apple Enterprise account and assist us in using the in-house distribution certificate to privately distribute our app. The main objective is to ensure that our app is securely distributed within our organization without going through the public App Store. The ideal candidate should have Apple Enterprise Account Administrative authority and in-house certificates\nKey Skills:\n- You need have an apple developer enterprise account\n- Have at least two years experience in ios development.\n- Familiar with all ios development skills\nTo apply: https://weworkremotely.com/remote-jobs/boeone-ios-developer",
    "url": "https://weworkremotely.com/remote-jobs/boeone-ios-developer",
    "source": "WeWorkRemotely",
    "date": "2025-11-14T01:59:06.149Z",
    "expires": "2025-11-21T01:59:06.149Z",
    "id": "live_WeWorkRemotely_1763085546149_5"
  },
  {
    "title": "Nordhealth: Technical Support Developer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Finland\n    \nURL: https://nordhealth.com\n\n\nEasyPractice is the flagship product for the therapy unit in Nordhealth, that enables clinicians and therapists to handle administrative work. We’re growing steadily and have more than 40.000+ users on our platform. Our software ecosystem touches 2M+ people worldwide. So, if you want to be part of an agile team that is passionate about solving problems and becoming better professionals in the process, we might have something for you!\n\nAbout the role\n\nWe are here to create great healthcare products. That’s at our very core, but it’s the people who make companies great, not the other way around. We spend more time with our co-workers than anyone else in our lives. Being part of an exceptional team is not only important for your personal mindfulness but key for your professional progression.\nAs a Technical Support Developer at Nordhealth and EasyPractice, you will play a crucial role in ensuring smooth operations for our customers by resolving complex technical issues escalated from the 1st line support team. Your main responsibility will be to handle tickets, troubleshoot issues, and maintain our system, which primarily involves working with Laravel and Vue.js.\nThis role is ideal for someone who thrives on problem-solving, enjoys a mix of technical challenges, and has a customer-first mindset.\n \nYour key responsibilities include:\nEfficiently troubleshoot and resolve technical issues reported through our support system.\nInvestigate, debug, and provide fixes for bugs in our Laravel and Vue.js-based applications.\nCollaborate with the 1st line support and product teams to ensure timely resolution of tickets and effective communication with end-users.\nUnderstand and prioritize tickets while considering business and user base needs.\nMaintain and optimize existing code to enhance performance, scalability, and reliability.\nDocument technical solutions and contribute to building a knowledge base for recurring issues.\nCollaborate with the development team to escalate and resolve more complex issues when necessary.\n \nOur Tech Stack\nWe’re huge fans of Laravel framework and the different tools in their ecosystem and our tech stack reflects that. Our current technologies include:\nLaravel 10.x\nAWS services\nVue.js 2.x/3.x\nMySQL 8\nBootstrap and TailwindCSS\nWe’re continuously evolving our tech stack to meet our users’ needs and we always welcome new ideas.\n \nWhat will help you to be successful in this role?\nIdeally, you have already gained some experience from working in a fast growing, global SaaS company. In addition, our humble wishlist includes:\nA strong background in Laravel Framework, PHP, and Vue.js.\nExperience troubleshooting technical issues in a customer-facing role.\nSolid knowledge of database management (MySQL, PostgreSQL, etc.).\nAbility to navigate remote server administration.\nExcellent problem-solving skills and the ability to work independently in a remote environment.\nExceptional communication skills, enabling you to translate technical solutions into customer-friendly language.\nBeing a team player.\nA proactive attitude and a passion for continuous learning and improvement.\nBonus points for experience in:\nDevOps practices, Docker, CI/CD pipelines, or automated testing.\n\nWhat’s in it for you?\nAt Nordhealth, we do things a little bit differently. We value continuous improvement, diverse teams and autonomy which drive our collaboration. Our global healthcare domain is rapidly developing and we are seeking colleagues who enjoy working in this type of environment. \nAt EasyPractice, we're in an exciting growth phase, and joining us now means you can make a tangible impact on our success.\nHere’s what you can look forward to:\nA friendly and supportive team environment.\nFreedom to work from anywhere in Europe.\nFlexible working hours to maintain your ideal work-life balance.\nAnnual company meet-ups to connect with colleagues in person.\n️A remote-friendly culture with team members from around the world.\nEmployment contract or B2B agreement, depending on location.\nIf you relish the idea of working in a fast-growing, international setting, and you're passionate about contributing to a friendly and collaborative culture, then this could be the perfect job for you. Join us and be part of our ongoing success story. Apply now! We’ll fill the position as soon as we find the right person.\nTo apply: https://weworkremotely.com/remote-jobs/nordhealth-technical-support-developer",
    "url": "https://weworkremotely.com/remote-jobs/nordhealth-technical-support-developer",
    "source": "WeWorkRemotely",
    "date": "2025-11-14T01:59:06.149Z",
    "expires": "2025-11-21T01:59:06.149Z",
    "id": "live_WeWorkRemotely_1763085546149_6"
  },
  {
    "title": "0D Capital: Senior Rust Backend Engineer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Geneva\n    \nURL: https://www.0d.finance\n\n\nThe role\nYou will design, build, and run the backend that powers our strategy vaults and cross-venue trading. This includes integrations with CEXs and perp DEXs, a robust allocation engine, and observable APIs that connect internal systems with DeFi protocols. Your work directly impacts returns.\nWhat You’ll Do\nImplement and scale DeFi strategies: from design to production.\nBuild data products and APIs: enabling reliable connectivity to internal trading systems and external DeFi protocols.\nOwn end-to-end problems: from spec to deployment, ensuring systems are reliable and observable.\nCollaborate with trading & research: turn ideas into live, capital-efficient strategies.\nStack & Infra You'll Touch\nIngress & API: NGINX Ingress (internal/external), Kong Gateway (auth, rate-limit, plugins).\nObservability: OpenTelemetry via Grafana Alloy; Prometheus/Alertmanager, Loki, Tempo, Thanos (global view), Mimir (long-term) backed by GCS; Grafana dashboards.\nData & Messaging: Kafka (event streams, schema evolution, idempotent consumers).\nPlatform: GCP + Cloud Build, Kubernetes, ArgoCD; Postgres as the primary datastore; Metabase for analytics.\nWhat We're Looking For\nExperience\n5+ years building production backends at scale.\nLifecycle knowledge of crypto assets (spot, perps, futures, options).\nHands-on DeFi integrations.\nProven ownership from spec to production and operations.\nTechnical Skills\nStrong OO programming background (preferably Rust).\nAPI design: versioning, backward compatibility, observability.\nPostgres schema design and query optimization; safe migrations; connection pooling.\nKafka or similar pub/sub; backpressure and idempotency patterns.\nCloud familiarity (GCP/AWS/Azure), modern CI/CD, containerization (Docker/Kubernetes).\nNice to Have\nBuilt or maintained position-keeping / accounting systems (PnL, accounting methods, pricing, greeks).\nCentralized reference data platforms (assets, networks, instruments), consistent symbology and instrument economics.\nTrading, risk, or back-office systems, ideally in regulated environment.\nWhy Join Us\nCompetitive compensation with equity/token upside.\nHigh impact on core trading systems.\nRemote (±4h CET), lean sharp team, offsites.\nMindset\nEnd-to-end ownership. Bias to ship with high standards.\nFast learning. Clear thinking under uncertainty.\nContract\nFull-time, remote (±4h CET)\nLanguages: English & French\nTo apply: https://weworkremotely.com/remote-jobs/0d-capital-senior-rust-backend-engineer",
    "url": "https://weworkremotely.com/remote-jobs/0d-capital-senior-rust-backend-engineer",
    "source": "WeWorkRemotely",
    "date": "2025-11-14T01:59:06.149Z",
    "expires": "2025-11-21T01:59:06.149Z",
    "id": "live_WeWorkRemotely_1763085546149_7"
  },
  {
    "title": "Software Engineer - Remote",
    "company": "CodeCraft Inc",
    "description": "New Software Engineer position available. Remote work with competitive compensation and benefits. Apply now for immediate consideration.",
    "url": "https://stackoverflow.com/jobs/1763085546485_0",
    "source": "StackOverflow",
    "date": "2025-11-14T01:59:06.485Z",
    "expires": "2025-11-21T01:59:06.485Z",
    "id": "fallback_StackOverflow_1763085546485_0"
  },
  {
    "title": "Mobile Developer - Remote",
    "company": "AppInnovators",
    "description": "New Mobile Developer position available. Remote work with competitive compensation and benefits. Apply now for immediate consideration.",
    "url": "https://stackoverflow.com/jobs/1763085546486_1",
    "source": "StackOverflow",
    "date": "2025-11-14T01:59:06.485Z",
    "expires": "2025-11-21T01:59:06.485Z",
    "id": "fallback_StackOverflow_1763085546486_1"
  },
  {
    "title": "Data Scientist - Remote",
    "company": "Analytics Pro",
    "description": "New Data Scientist position available. Remote work with competitive compensation and benefits. Apply now for immediate consideration.",
    "url": "https://stackoverflow.com/jobs/1763085546486_2",
    "source": "StackOverflow",
    "date": "2025-11-14T01:59:06.485Z",
    "expires": "2025-11-21T01:59:06.485Z",
    "id": "fallback_StackOverflow_1763085546486_2"
  }
]