[
  {
    "title": "Prat City LLC: Senior Full Stack Developer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Pasadena\n    \nURL: http://pratcity.com\n\n\nOwn our technical infrastructure and lead platform development. You'll work across multiple Laravel codebases, build new features, improve existing systems, and help grow the development team over time.\nWhat You'll Do\nBuild and maintain features across our course platforms\nWork with state-specific compliance requirements (each state has different rules)\nImprove admin tools and internal systems\nManage integrations with payment processors, third-party services, and analytics\nArchitect solutions that scale as we add new courses and enter new markets\nHelp hire and onboard additional developers as the team grows\nTech Stack\nBackend: Laravel 10, some WordPress\nFrontend: Blade templates, some Vue.js\nDatabase: MySQL\nInfrastructure: AWS (including Lambda)\nPayments: Stripe\nMonitoring: Sentry\nTools: GitHub, Jira, Slack\nDevOps handled by dedicated team member.\nRequirements\nMust have:\n7+ years Laravel experience\nStrong Blade templating\nExperience working across multiple codebases\nAPI integration experience (payment processors, third-party services)\nAWS familiarity\nSelf-directed, works independently\nClear communicator (async-first, English)\nPrefer:\nLaravel upgrade experience (we're on 10)\nMulti-tenant or e-learning platforms\nExperience mentoring or leading developers\nPython knowledge\nHow We Work\nFully remote, any timezone\nAsync-first with occasional sync calls\nWork alongside existing team members\nCompensation\n$70-80k USD/year\nEmployment via EOR\nStandard PTO for your country\nHiring Process\nApplication review\n30-min intro call\nTechnical discussion (60 min)\nFinal conversation\nOffer\nTo Apply\nSend to hello@prateekagarwal.com:\nResume and GitHub/portfolio\nBrief note:\n\nWhy this role interests you\nA technical challenge you solved in an existing codebase\nYour approach to inheriting and improving projects\nTo apply: https://weworkremotely.com/remote-jobs/prat-city-llc-senior-full-stack-developer",
    "url": "https://weworkremotely.com/remote-jobs/prat-city-llc-senior-full-stack-developer",
    "source": "WeWorkRemotely",
    "date": "2025-12-13T18:33:30.049Z",
    "expires": "2025-12-20T18:33:30.049Z",
    "id": "live_WeWorkRemotely_1765650810049_0"
  },
  {
    "title": "PostHog: Product Engineer - Data Modeling",
    "company": "WeWorkRemotely",
    "description": "Headquarters: San Francisco\n    \nURL: https://posthog.com/\n\n\nAbout PostHog\nWe equip every developer to build successful products.\nWe started with open-source product analytics, launched out of Y Combinator's W20 cohort.\nWe've since shipped more than a dozen products, including a built-in data warehouse, a customer data platform, and Max AI, an AI-powered analyst that answers product questions, helps users find useful session recordings, and writes custom SQL queries.\nNext on the roadmap are messaging, customer analytics, ai task creation and coding based on customer data, logs and support analytics.\nOur values are not a poster on the wall full of aspiration. They’ve come from how we really work, day in day out.\nPostHog is open source product led, and a default alive company that is well funded.\nWhat you'll be doing\nAs a Product Engineer - Data Modeling s on the Data Stack team, you’ll build end user tools for understanding and traversing their data models.\nYou’ll work on materializing user defined queries, and schedule & resolve DAGs of query materialization.\nYou’ll debug stateful data workflows by digging into k8s pod metrics, and schedule jobs using Temporal.io. As you can see, there’s a huge breadth of challenges and opportunities to tackle, and nothing is off-limits.\nThe PostHog Data Stack is both a core product for our users and a foundational platform for our internal teams. Data is a first-class product at PostHog, not an afterthought.\nYou will have the chance to push the boundaries of what our Data Stack team can do while ensuring we remain stable and production-ready.\nYou now know what you’ll be doing, but what about what you’ll need to bring along?\nYou’ll fit right in if:\nYou’re a builder. You bring strong skills in building resilient systems, with experience in Kubernetes, Docker, and S3 at scale. We build in python. Async-python and Temporal.io skills are welcome.\nYou have good practices around building resilient systems. Logging, testing and monitoring (observability), but you are also comfortable with debugging stateful, async data workflows by digging into k8s pod metrics.\nYou are proficient in building UIs for data intensive tools. React is part of your toolset.\nYou bring experience with DAG’s and Batch processing. Having used Dbt is a plus.\nYou bring a mix of skills. It’s not just about the query engine. You’ll need strong backend skills as we run a complex system.\nYou love getting things done. Engineers at PostHog have an incredible amount of autonomy to decide what to work on, so you’ll need to be proactive and just git it done.\nYou’re ready to do the best work of your career. We have incredible distribution, a big financial cushion and an amazing team. There’s probably no better place to see how far you can go.\nIf this sounds like you, we should talk.\nWe are committed to ensuring a fair and accessible interview process. If you need any accommodations or adjustments, please let us know.\nTo apply: https://weworkremotely.com/remote-jobs/posthog-product-engineer-data-modeling",
    "url": "https://weworkremotely.com/remote-jobs/posthog-product-engineer-data-modeling",
    "source": "WeWorkRemotely",
    "date": "2025-12-13T18:33:30.049Z",
    "expires": "2025-12-20T18:33:30.049Z",
    "id": "live_WeWorkRemotely_1765650810049_1"
  },
  {
    "title": "PostHog: AI Product Engineer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: San Francisco\n    \nURL: https://posthog.com/\n\n\nAbout PostHog\nWe're shipping every product that companies need to run their business from their first day, to the day they IPO, and beyond. The operating system for folks who build software.\nWe started with open-source product analytics, launched out of Y Combinator's W20 cohort. We've since shipped more than a dozen products including:\nA built-in data warehouse, so users can query product and customer data together using custom SQL insights.\nA customer data platform, so they can send their data wherever they need with ease.\nPostHog AI, an AI-powered analyst that answers product questions, helps users find useful session recordings, and writes custom SQL queries.\nNext on the roadmap are CRM, messaging, revenue analytics, and support products. When we say every product that companies need to run their business, we really mean it!\nWe are:\n1. Product-led. More than 100,000 companies have installed PostHog, mostly driven by word-of-mouth. We have intensely strong product-market fit.\n2. Default alive. Revenue is growing 10% MoM on average, and we're very efficient. We raise money to push ambition and grow faster, not to keep the lights on.\n3. Well-funded. We've raised more than $100m from some of the world's top investors. We're set up for a long, ambitious journey.\nWe're focused on building an awesome product for end users, hiring exceptional teammates, shipping fast, and being as weird as possible.\nThings we care about\nTransparency: Everyone can read about our roadmap, how we pay (or even let go of) people, our strategy, and how we work, in our public company handbook. Internally, we share revenue, notes and slides from board meetings, and fundraising plans, so everyone has the context they need to make good decisions.\nAutonomy: We don’t tell anyone what to do. Everyone chooses what to work on next based on what's going to have the biggest impact on our customers, and what they find interesting and motivating to work on. Engineers lead product teams and make product decisions. Teams are flexible and easy to change when needed.\nShipping fast: Why not now? We want to build a lot of products; we can't do that shipping at a normal pace. We've built the company around small teams – autonomous, highly-efficient groups of cracked engineers who can outship much larger companies because they own their products end-to-end.\nTime for building: Nothing gets shipped in a meeting. We're a natively remote company. We default to async communication – PRs > Issues > Slack. Tuesdays and Thursdays are meeting-free days, and we prioritize heads down building time over perfect coordination. This will be the most productive job you've ever had.\nAmbition: We want to solve big problems. We strongly believe that aiming for the best possible upside, and sometimes missing, is better than never trying. We're optimistic about what's possible and our ability to get there.\nBeing weird: Weird means redesigning an already world-class website for the 5th time. It means shipping literally every product that relates to customer data. It means building an objectively unnecessary developer toy with dubious shareholder value. Doing weird stuff is a competitive advantage. And it's fun.\nWho we're looking for\nWe’re looking for a full-stack engineer who knows how to leverage LLMs to make PostHog 10x more powerful. You’ve built and shipped agentic AI applications before and understand it’s more than just hitting an API with a good prompt.\nYou’ll fit right in if you:\nShip end-to-end AI apps — from backend infra to frontend UX.\nCollaborate widely — work across teams, find the right people, and make progress fast.\nThink like a product builder — care about users and outcomes, not just code.\nIf you’ve worked in autonomous agents, workflow automation, or AI copilots before, you’ll feel at home — but here you’ll get to build it from scratch, in the open, with massive impact.\nWhat makes this role unique\nIn this role, you’re not hacking together an AI agent hoping someone will use it — you’re building on top of a firehose of real customer data with immediate impact, whether that means creating new AI-powered tools or building observability features that help others understand how their agents perform in the wild.\nImpact from day one: You’re building agents on top of real customer data — not toy demos, not “when we get users.”\nData advantage: PostHog already collects all the context agents need to be useful: analytics, sessions, events, feature flags, and more. You’ll build on top of it all.\nAgents that matter: Instead of copilots on the side, you’ll create background agents embedded into engineering workflows - changing how software gets built. Or, you might focus on building the analytics and observability layer around those agents - surfacing insights, clustering behaviors, and measuring model quality so teams can improve their own AI systems with confidence.\nBuild in the open: Work with feedback from the largest open-source product engineering communities in the world.\nWhat you'll be doing\nOwning products and features from beginning to end. This means originating ideas based on your intuition, talking to users, and understanding our strategy and goals. It means testing MVPs in production with real users. It means iterating on their feedback, owning pricing, and ensuring the ongoing success of your work.\nCollaborating with design (when necessary). Product engineers at PostHog are full-stack, so we expect you to ship and own the basic UX of your work using our design system. From there, it's up to you to decide when to collaborate with our design team to iterate and polish the experience.\nImplementing AI features. LLMs, eh? They're getting prettaaay, prettaay good. All our products integrate with PostHog AI, so you'll likely be working with the PostHog AI team to implement AI features in your products. For some teams, that means designing observability and evaluation features for AI products.\nTalking to users. Good product engineers read feedback from users and iterate quickly. Great product engineers have users they're friendly with, talk with them frequently, bounce ideas off them, and iterate with them when they ship new things.\nDoing support. Every week, one person in each engineering team is designated the Support hero. Their job is to investigate and resolve issues reported by customers for their product. Giving users support from real engineers and shipping fixes and improvements in real-time is one of the best ways to spark joy in users. This role will also include some on-call time, too.\nWriting docs. We have a content team that will collaborate with you on reviewing, polishing, and improving your documentation, but the best person to document a new feature is the person who built it.\nRequirements\nFull-stack experience with relevant technologies – e.g. Python or similar, React or similar, something to do with big data is a bonus.\nPrior experience in AI workflow automation, copilots, or autonomous agent products.\nAbility to choose pragmatic architectures, ship quickly, and iterate based on real feedback.\nStrong sense for UX and product polish.\nExcellent communicator who thrives on collaboration across teams.\nNice to have\nHave worked at a high-growth SaaS company before.\nExtensive knowledge of Django and/or TypeScript-based React.\nExperience building AI-native products or integrating AI into existing software.\nIf you have a disability, please let us know if there's any way we can make the interview process better for you - we're happy to accommodate!\nTo apply: https://weworkremotely.com/remote-jobs/posthog-ai-product-engineer",
    "url": "https://weworkremotely.com/remote-jobs/posthog-ai-product-engineer",
    "source": "WeWorkRemotely",
    "date": "2025-12-13T18:33:30.049Z",
    "expires": "2025-12-20T18:33:30.049Z",
    "id": "live_WeWorkRemotely_1765650810049_2"
  },
  {
    "title": "comparis.ch: Experienced Full-Stack Software Engineer (.NET/React), 80–100% (f/m/x), fully remote",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Zuerich\n    \nURL: https://en.comparis.ch/\n\n\n\nWhat you will do\n \nTo further develop and enhance our applications, we are looking for an experienced Full Stack Software Engineer on a Senior Level to join our multinational Scrum team. You will help in design, development, testing of Comparis applications, working on both a .NET backend and a React frontend. You will contribute heavily to architectural decisions, mentor other developers, and help shape the future of our digital products.\nCore responsibilities:\nDesign, develop, and deploy cloud-native applications using .NET Core/ASP.NET, and Next.js.\nLead architectural discussions and provide direction on technology choices and design patterns.\nBuild and maintain RESTful APIs, microservices, and distributed systems.\nWork with Docker/Kubernetes in Azure.\nImplement responsive, high-quality UI components with React and JavaScript/TypeScript.\nOptimize applications for performance, availability, scalability, and security.\nUse/build CI/CD pipelines, automated testing, and deployments.\nMonitor, diagnose, and resolve complex production issues.\nMentor team members and promote engineering best practices.\nRequired Skills and Qualifications\nBachelor’s or Master’s degree in Computer Science, Engineering, or a related field (or equivalent practical experience).\n7–8 years of professional software development experience.\nStrong proficiency in C#, .NET Core/ASP.NET.\nExtensive experience with React.js, JavaScript/TypeScript, HTML5, and CSS3.\nStrong background in cloud infrastructure with hands-on experience building and operating cloud-native applications using Azure, AWS or GCP\nExperience with modern compute platforms, including container orchestration (e.g., Kubernetes), serverless functions, and scalable application hosting environments\nSkilled in designing and working with event-driven and message-based architectures using queues, topics, and publish/subscribe patterns\nProficient with both relational and NoSQL databases, with experience designing distributed and cloud-native data solutions\nFamiliar with cloud-based storage services, structured storage options, and secure secrets/configuration management\nSolid experience with Infrastructure-as-Code tooling (e.g., Terraform, Pulumi) for provisioning, automation, and maintaining consistent environments\nExperience with REST APIs, microservices, and distributed systems.\nExperience with CI/CD pipelines, Git, Agile boards\nYou are experienced with agile development methodologies like Scrum and understand outcome-driven development.\nYou are fluent in English.\nIn return, here is what you can expect from us\n \nAt Comparis, we believe that empowered employees deliver the best results. We cultivate a culture of transparency, mutual respect and trust. Firm believers in lifelong learning, we are always trying out new things and continuously developing – both as individuals and as a team. We also offer flat hierarchies, considerable autonomy and creative freedom, as well as a skilled and motivated team that will advise and support you in your work and make it easy for you to push your own boundaries. Finally, we offer flexible working hours to work from wherever you are and live.\n \nHave we triggered your interest?\nThen don't hesitate and apply for our position today. If you have any questions, Daphne, our People Management Lead, will be happy to help. We look forward to receiving your application! \nNote: This position offers the flexibility to work fully remotely. If you opt for a remote set-up, we kindly ask that you consider applying only if your time zone is within a maximum difference of +/- 2 hours from Switzerland (GMT +2).  \nTo apply: https://weworkremotely.com/remote-jobs/comparis-ch-experienced-full-stack-software-engineer-net-react-80-100-f-m-x-fully-remote",
    "url": "https://weworkremotely.com/remote-jobs/comparis-ch-experienced-full-stack-software-engineer-net-react-80-100-f-m-x-fully-remote",
    "source": "WeWorkRemotely",
    "date": "2025-12-13T18:33:30.049Z",
    "expires": "2025-12-20T18:33:30.049Z",
    "id": "live_WeWorkRemotely_1765650810049_3"
  },
  {
    "title": "comparis.ch: Android Engineer 80-100% (f/m/x)",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Zuerich\n    \nURL: https://en.comparis.ch/\n\n\n\n \nWhat you will do\nYou will be part of a small mobile development team building a brand new, state-of-the-art application for iOS and Android, using modern technologies and integrating the latest AI-driven tools to create a fresh, intuitive experience for our users. This includes conceptualizing, designing, developing, testing, and publishing the new app. Together with the PO you will gather requirements, and together with the backend engineers you will design the APIs needed for the mobile app. You’re able to support and collaborate with our iOS developer, so knowledge of Swift for iOS is a plus. Your primary responsibilities will be in Android, but in our small team you’ll work closely with the iOS developer as a sparring partner to design and shape features together, collaborate on architecture, and support each other through code reviews. \nYour focus will be on developing the new Android application from scratch, while also helping to maintain and care for our two existing apps. \nRequired Skills and Qualifications\nDegree in Computer Science, Engineering, or equivalent practical experience\nProficiency in Kotlin and solid experience with Jetpack Compose\nStrong understanding of current Android development tools and best practices\nFamiliarity with the app release and deployment process\nNice to Have \nKnowledge of Java/XML and experience migrating to Kotlin/Jetpack Compose\nUnderstanding of REST API design\nExperience with Kotlin Multiplatform (KMP)\nInterest or hands-on experience with AI tools (LLMs, AI agents)\nBasic knowledge of iOS (Swift) or cross-platform frameworks such as Flutter\nWhat we expect from you\nDesign, develop and maintain a modern Android app from scratch\nMaintain and modernize our existing Android apps\nWrite clean, maintainable and testable code\nYou have worked in a team and are familiar with agile development methodologies like Scrum\nYou own your apps and care deeply about their quality, stability, and impact.\nIn a small team you enjoy working together, but you’re also self-driven and confident owning the Android space\nYou are fluent in English and German is a plus\nIn return, here is what you can expect from us\nAt Comparis, we believe that empowered employees deliver the best results. We cultivate a culture of transparency, mutual respect and trust. Firm believers in lifelong learning, we are always trying out new things and continuously developing – both as individuals and as a team. We also offer flat hierarchies, considerable autonomy and creative freedom, as well as a skilled and motivated team that will advise and support you in your work and make it easy for you to push your own boundaries. Finally, we offer flexible working hours to work from wherever you are and live. \n \nHave we triggered your interest?\nThen don't hesitate and apply for our position today. If you have any questions, Daphne, our People Management Lead, will be happy to help. We look forward to receiving your application!  \n \nNote: This position offers the flexibility to work fully remotely. If you opt for a remote set-up, we kindly ask that you consider applying only if your time zone is within a maximum difference of +/- 2 hours from Switzerland (GMT +2).   \nTo apply: https://weworkremotely.com/remote-jobs/comparis-ch-android-engineer-80-100-f-m-x",
    "url": "https://weworkremotely.com/remote-jobs/comparis-ch-android-engineer-80-100-f-m-x",
    "source": "WeWorkRemotely",
    "date": "2025-12-13T18:33:30.049Z",
    "expires": "2025-12-20T18:33:30.049Z",
    "id": "live_WeWorkRemotely_1765650810049_4"
  },
  {
    "title": "Sticker Mule: Software engineer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: New York, NY\n    \nURL: https://www.stickermule.com\n\n\nAbout Sticker Mule\nSticker Mule, the Internet's favorite custom printer, is building the Internet's best commerce platform. We are privately-owned, which means no meddlesome investors, with 9-figures in annual revenue and great profitability. Our commerce platform (Stores) helped people earn $200k while in beta and now we are hiring to accelerate development.\n \nWe offer\nRemote work with flexible schedules\nA privately owned, low-stress culture\nA fun \"no bullshit\" work environment\nGreat compensation with rising wages.\n \nCompensation and benefits\nSalary: $145K \n$20,000 signing bonus\n4 weeks vacation + holidays based on your country of residence\n \nWe like you to know\nGo\nTypeScript\nReact Native (Expo) \nGraphQL\nPostgres\nRedis\nDocker\nKubernetes\nGoogle Cloud Platform\nExcellent communication skills (English)\nDegree in Computer Science or equivalent practical experience\n \nWhat you will work on\nYou'll help us develop our new Stores platform that already helped sellers earn nearly $200,000 while in beta. Stores is supported by a suite of tools that help anyone succeed online including Give (our giveaway platform), Ship (our shipping platform, Notify (our forthcoming email/sms marketing platform), and more coming soon.\n \nWe have an incredible roadmap and need your help to execute it quickly.\nTo apply: https://weworkremotely.com/remote-jobs/sticker-mule-software-engineer-1",
    "url": "https://weworkremotely.com/remote-jobs/sticker-mule-software-engineer-1",
    "source": "WeWorkRemotely",
    "date": "2025-12-13T18:33:30.049Z",
    "expires": "2025-12-20T18:33:30.049Z",
    "id": "live_WeWorkRemotely_1765650810049_5"
  },
  {
    "title": "BaxEnergy: Senior Software Engineer - Renewable Energy Software",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Acireale, Italy\n    \nURL: https://baxenergy.com\n\n\n\nWe are building multiple teams of senior developers to create a new product line for BaxEnergy in the field of cybersecurity and artificial intelligence. If you’re a software engineer eager for new challenges, thrive in a zero-to-one environment, and want to collaborate remotely with top developers, you might be the one we’re looking for! \n \nWhat You’ll Do\nWrite high-quality code and contribute to building complete systems (backend and frontend), not just isolated components.\nArchitect, design and develop a new enterprise-grade product, tackling a variety of complex and rewarding challenges.\nLead by example in building a strong culture with automated deployment pipelines.\nCreate solutions with real-world impact in the defense and aerospace sectors.\nWork alongside exceptional developers, learning and sharing knowledge every day.\n \nWhy Join Us\nWe are a remote-first company and this is a fully remote position.\nWe build amazing teams with brilliant, happy, and motivated developers.\nEarn Euro-level salaries with over 30 days of vacation, sick pay, and other benefits.\nThe role is a permanent full-time position. We invest in people and understand great things happen if we do.\nBe part of our amazing company trajectory over the next five years.\nTravel to Sicily, Italy once a year for a fully paid company retreat.\n \nAbout You\nYou are smart and get things done\nYou consistently deliver high-quality software\nYou have experience in system architecture, databases, and are comfortable with both strongly typed and dynamic programming languages. You have strong but weakly held opinions on software development\nYou can work with at least a 4-hour overlap with CET\nYou’re eligible to obtain a visa and can travel to Italy within three months of hiring.\nTo apply: https://weworkremotely.com/remote-jobs/baxenergy-senior-software-engineer-renewable-energy-software",
    "url": "https://weworkremotely.com/remote-jobs/baxenergy-senior-software-engineer-renewable-energy-software",
    "source": "WeWorkRemotely",
    "date": "2025-12-13T18:33:30.049Z",
    "expires": "2025-12-20T18:33:30.049Z",
    "id": "live_WeWorkRemotely_1765650810049_6"
  },
  {
    "title": "BaxEnergy: Senior Data Scientist",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Acireale, Italy\n    \nURL: https://baxenergy.com\n\n\n\nWe’re looking for a senior Data Scientist to join our growing team and tackle high-impact problems in the renewable energy space. You’ll lead end-to-end projects that apply machine learning and statistical modelling to real-world challenges such as forecasting power demand, predicting equipment failures, or optimizing energy usage.\nRather than looking for a domain expert in energy renewables, what we need is someone who deeply understands data, knows how to build solid models, and can write clean Python code that’s production ready. If you’ve got a strong foundation in statistics, experience with time series data, and a passion for solving meaningful problems, we’d love to meet you.\nThis role is fully remote.\n \nWhat You Will Do\nLead data science initiatives and take responsibility for their execution.\nAnalyse time series data and develop models for forecasting, anomaly detection, and optimization.\nWork closely with product, engineering, and domain experts to build features that get used.\nBring clarity to messy data, test hypotheses, and make informed, modelling choices.\nCommunicate your findings clearly to both technical and non-technical teammates.\nContribute to best practices around reproducibility, testing, and model monitoring.\n \nAbout You\nSmart and gets things done\nYou are a great data scientist and can contribute to creating great data science teams\nStrong background in statistics and machine learning theory. You know more than just how to fit a model, and you understand why it works.\nSolid experience working with time series data and building predictive models.\nExpert Python skills so that your code is efficient, maintainable, and ready for production including hands-on experience with standard data science tools (pandas, NumPy, scikit-learn, etc.).\nSolid remote work experience and student mindset\nYou have a 4-hour overlap with CET time zones\nYou’re eligible to obtain a visa and can travel to Italy within three months of hiring\n \nWhy Join Us\nWe are a remote-first company, and this is a fully remote position\nWe build amazing teams with brilliant, happy, and motivated contributors\nEarn Euro-level salaries with over 30 days of vacation, sick pay, and other benefits\nThe role is a permanent full-time position\nWe invest in people and understand great things happen if we do\nBe part of our amazing company trajectory over the next five years\nTravel to Sicily, Italy once a year for a fully paid company retreat\nTo apply: https://weworkremotely.com/remote-jobs/baxenergy-senior-data-scientist-1",
    "url": "https://weworkremotely.com/remote-jobs/baxenergy-senior-data-scientist-1",
    "source": "WeWorkRemotely",
    "date": "2025-12-13T18:33:30.049Z",
    "expires": "2025-12-20T18:33:30.049Z",
    "id": "live_WeWorkRemotely_1765650810049_7"
  },
  {
    "title": "Software Engineer - Remote",
    "company": "CodeCraft Inc",
    "description": "New Software Engineer position available. Remote work with competitive compensation and benefits. Apply now for immediate consideration.",
    "url": "https://stackoverflow.com/jobs/1765650810878_0",
    "source": "StackOverflow",
    "date": "2025-12-13T18:33:30.878Z",
    "expires": "2025-12-20T18:33:30.878Z",
    "id": "fallback_StackOverflow_1765650810878_0"
  },
  {
    "title": "Mobile Developer - Remote",
    "company": "AppInnovators",
    "description": "New Mobile Developer position available. Remote work with competitive compensation and benefits. Apply now for immediate consideration.",
    "url": "https://stackoverflow.com/jobs/1765650810878_1",
    "source": "StackOverflow",
    "date": "2025-12-13T18:33:30.878Z",
    "expires": "2025-12-20T18:33:30.878Z",
    "id": "fallback_StackOverflow_1765650810878_1"
  },
  {
    "title": "Data Scientist - Remote",
    "company": "Analytics Pro",
    "description": "New Data Scientist position available. Remote work with competitive compensation and benefits. Apply now for immediate consideration.",
    "url": "https://stackoverflow.com/jobs/1765650810878_2",
    "source": "StackOverflow",
    "date": "2025-12-13T18:33:30.878Z",
    "expires": "2025-12-20T18:33:30.878Z",
    "id": "fallback_StackOverflow_1765650810878_2"
  }
]