[
  {
    "title": "Close: Senior Software Engineer - Backend/Python - USA Only (100% Remote)",
    "company": "WeWorkRemotely",
    "description": "Headquarters: USA\n    \nURL: http://www.close.com\n\n\nAbout Us\nClose is a bootstrapped, profitable, 100% remote, ~100 person team of thoughtful individuals who prioritize taking ownership and making a meaningful impact. We’re eager to make a product our customers fall in love with over and over again.\n \nWe 💛 small scaling businesses. Since 2013, we’ve been building a CRM that focuses on better communication, without the hassle of manual data entry or a complex UI. We are out to supercharge sales productivity with the most modern, thoughtfully designed, all-in-one, communication-focused CRM. \n \nOur backend tech stack consists primarily of Python Flask web apps with our TaskTiger scheduler handling many of the backend asynchronous task processing chores. Our data stores include MongoDB, PostgreSQL, Elasticsearch, and Redis. The underlying infrastructure runs on AWS using a combination of managed services like EKS, MSK, RDS and ElasticCache and non-managed services running on EC2 instances. We have CI/CD pipelines that build Docker images, run automated tests and deploy to Kubernetes clusters. We also use these images in our local development environment allowing coding locally against all of our services. We have a well-documented public API that is consumed by our front-end JavaScript app as well as numerous integrations. Our infrastructure is heavily automated using Terraform, Ansible and other AWS tools.\n \nOur product development process is inspired by Shape Up. We love open sourcing our code and ideas on our GitHub and on The Making of Close, our behind-the-scenes Product & Engineering blog. Check out our open source projects like SocketShark, TaskTiger, LimitLion and ciso8601.\n \n \nAbout the Role\nYou will be joining one of our six cross-functional teams. These are the CRM, Admin & Onboarding, Conversations, Messaging & Scheduling, Automations & Integrations and Data Insights teams. You will be regularly collaborating with other backend & frontend engineers, product managers, designers, and other teams here at Close.\n \n \nAbout You\nWe’re looking for high achieving, full-time Software Engineers to join our engineering team. Someone who has a good understanding in web technologies and wants to help design, implement, launch, and scale major systems and user-facing features.\n \nYou're comfortable working in a fast-paced environment with a small and talented team where you're supported in your efforts to grow professionally. You're able to manage your time well, communicate effectively, and collaborate in a fully distributed team.\n\n\nCome help us with projects like...\nConceiving, designing, building, and launching new user-facing features\nImplementing new AI features to turbocharge our customers’ daily tasks\nImproving the performance and scalability of our GraphQL and REST API\nImproving how we sync millions of sales emails and calendar events each month\nWorking with Twilio's API, WebSockets, and WebRTC to improve our calling features\nBuilding user-facing analytics features that provide actionable insights based on sales activity data\nImproving our Elasticsearch-backed powerful search features\nImproving our internal messaging infrastructure using streaming technologies like Kafka and Redis \nBuilding new and enhancing existing integrations with other SaaS platforms like Google’s G Suite, Zapier, and web conferencing providers\nEnhancing our web app with real-time updates powered by GraphQL Subscriptions\nLeveraging the latest AI LLMs from providers like OpenAI, Groq and AssemblyAI\n\nHelp manage our ever growing data processing needs…\nBillions of Mongo documents\nMillions and millions of rows of PostgreSQL data\n55 Terabytes of logs / month\n500 billion OTEL spans over the last 30 days\n10+ million events / day\nTens of thousands of docker containers\n7 million minutes of call recordings / month\nPetabytes / month of network traffic\n\nRequirements...\nSenior 1 & 2 level candidates should have 5+ years of experience building modern back-end systems. Staff level candidates should have 8+ years of experience. Mid-level candidates should have ~3 years of similar experience and be eager to level up with the right opportunity.\nProfessional Python experience is preferred but a working knowledge of Python with additional experience in other languages is acceptable if you have a desire to work with Python.\nYou have built web APIs that were Internet facing or supported other high volume loads.\nYou have hands-on production experience working with MongoDB, PostgreSQL, Elasticsearch, or similar data stores. \nYou have experience designing, scaling, debugging, and optimizing systems to make them fast and reliable. \nYou have participated in code reviews and provided overall code quality suggestions to help maintain the structure and quality of the codebase. \nYou care about the craftsmanship of the code and systems you produce.\nLocated in the USA (lower 48 timezones).\n\nBonus point if you have\nContributed open source code related to our tech stack.\nLed small project teams building and launching features.\nBuilt B2B SaaS products.\nImplemented features that leveraged AI to deliver unimaginable new product capabilities.\nWorked with complex architectures that support multiple APIs (e.g. REST, GQL, WebSockets) as well as async task and event processing frameworks.\n\n🌏 Why Close?\nWatch our most recent culture video featuring our annual team retreat in Italy\n100% remote company\n5 weeks PTO + Winter & Summer Holiday Breaks with 2 additional PTO days for every year with the company\n1 month paid sabbatical every 5 years\nPaid parental leave\nMedical, Dental, Vision with HSA option (US residents)\n401k matching at 6% (US residents)\nDependent care FSA (US residents)\nOur story and team 🚀\n\nOur Values\nBuild a house you want to live in -- Examine long-term thinking and action\nNo BS -- Practice transparency and honesty, especially when it’s hard\nInvest in each other -- Build successful relationships with your coworkers and customers \nDiscipline equals freedom -- Keep your word to yourself and others\nStrive for greatness -- Constantly challenge yourself and others \n\nHow We Work Together\nProductivity, Quality & Impact: We don’t track hours. We trust you’re an adult and know best how to prioritize, meet your goals and contribute at a high level. \nAsynchronous communication & collaboration: We have team members all over the world. We don’t expect anyone to work untraditional hours, that means our default is async. Most teams have 2-5 hours of internal meetings weekly. \nAppreciation for Deep Work: *During your normal work day, not after a day of meetings*. \nAutonomy & Freedom: Create a work environment that is sustainable for you. We place a high amount of trust and responsibility with our team members from the start. \n \nWe are looking for US-based Software Engineers to join our team. Base salary range for Senior I & II is $140,000 to $210,000.\nTo apply: https://weworkremotely.com/remote-jobs/close-senior-software-engineer-backend-python-usa-only-100-remote-1",
    "url": "https://weworkremotely.com/remote-jobs/close-senior-software-engineer-backend-python-usa-only-100-remote-1",
    "source": "WeWorkRemotely",
    "date": "2025-12-08T06:43:01.657Z",
    "expires": "2025-12-15T06:43:01.657Z",
    "id": "live_WeWorkRemotely_1765176181657_0"
  },
  {
    "title": "Valory AG: Senior Python Engineer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Zug, Switzerland\n    \nURL: https://olas.network\n\n\nJoin the original agent-to-agent protocol in crypto, defining how developers build AI agents in crypto, AI and beyond.\nOur Mission\nOlas is the platform that enables true co-ownership of AI. Launched in 2021 as one of the first Crypto x AI projects, today, Olas powers the largest AI agent economies with millions of transactions. Learn more at olas.network.\nOur Products\nWith Olas’ Pearl, the first “AI Agent App Store”, any consumer with a laptop can use AI agents they truly own. With Olas’ Mech Marketplace, the “AI Agent Bazaar”, businesses can put their AI agent up for hire to earn crypto and tap into other AI agents’ services. Today, Olas’ AI Agents serve diverse use cases - from prediction markets and asset management to influencer agents - autonomously creating valuable outcomes. The OLAS utility token provides access to the platform’s benefits and coordinates agent interactions in entire AI Agent economies.\nOur Team\nValory is the team you’d be joining, working on Olas (the open-source technology governed by the Olas DAO). Valory is VC-backed team of engineers, researchers and commercial executors that raised its own successful Seed round and co-created Olas, executing a successful public token launch and subsequent $13.8m raise for the Olas DAO. We believe Artificial General Intelligence will likely be agentic and must be co-owned. Read more about our values.\nThe Role\nWe’re looking for an exceptional Senior Python Engineer with a passion for decentralized finance and emerging autonomous technologies. You have deep experience designing and building complex, high-performance systems, from architecture to implementation, and thrive in environments where ownership and technical excellence drive every decision. You’re fluent in modern, open-source Python frameworks and have a proven record of shipping production-grade systems at scale. You enjoy shaping architecture, mentoring peers, and solving problems that don’t have playbooks yet.\nAt Valory, you’ll join a world-class team pioneering the next evolution of DeFi: building autonomous on-chain agents that manage digital assets without human intervention. You’ll help push the frontier where AI meets decentralized finance, working on BabyDegen - our cutting-edge DeFi agent and one of the first of its kind.You are excited to work in line with our values, constantly pushing boundaries as the original agent project in the rapidly-expanding AI agent space.\nMain Duties\nDevelop the BabyDegen family in line with the product roadmap set by the Product Manager\nDrive the development of the BabyDegen family, translating the product vision and roadmap into robust, production-ready systems.\nLead technical design in collaboration with the Product Manager, ensuring new components integrate cleanly and efficiently within a complex, multi-system architecture.\nRapidly learn and contribute to Valory’s agents and agent frameworks, taking ownership of adding, maintaining and improving performant, production-grade agents.\nChampion code quality through comprehensive testing, rapid debugging, and continuous performance optimization\nCollaborate across functions to lead the design and integration of machine learning features, shaping Valory’s next generation of autonomous products.\nProduce thorough, high-quality documentation of experiments, outcomes, and design decisions, ensuring knowledge is shared effectively across the organization.\nLead by example, providing feedback (including code reviews), learning via others’ feedback, and supporting fellow team members to elevate the entire team.\nTake full ownership of your work - from implementation to stakeholder communication - ensuring every change meets expectations and delivers measurable value before considering a task done.\nStay ahead of the curve on DeFi, crypto, and AI developments - we move fast and iterate even faster.\nRequirements\n4+ years of hands-on experience writing production-level Python (or 2+ years Python and 2+ years in a compiled language such as C++/Go/Rust).\nDeep understanding of Python frameworks (Django, Flask, FastAPI) and modern engineering practices - linting, auto-formatting, type checking, and automated testing.\nExcellent communication and collaboration skills; you thrive in a high-autonomy, high-trust environment.\nProven ability to design and ship complex, distributed systems or high-throughput backends.\nAlignment with our values, including mission over ego, clarity through writing and pushing the autonomous edge.\nInterest in and keenness to dive into emerging areas like AI agents and decentralized systems.\nBonus: Open-source contributions or Web3 development experience, familiarity with multi-agent systems or reinforcement learning concepts, demonstrated passion for DeFi, cryptoeconomics, or automation.\nLocation: Hybrid - mostly working from home with regular in-person team meetups, eg multiple times a month, in the London office.\nEqual Opportunity\nWe are an equal opportunity workplace. We want folks who add diversity on as many axes as possible to bring their expertise, encourage applicants from all backgrounds to apply, and are committed to promoting equality of opportunity. We prohibit discrimination or harassment based on protected characteristics (including gender, race, ethnicity, colour, religion, creed, sex, sexual orientation, national origin, age, disability or marital status). We also respect the wishes of individuals to protect their anonymity online and encourage individuals who operate under pseudonyms to apply.\nThe Opportunity\nCompetitive compensation, accounting for benefits.\nHybrid - Valory has been a distributed team from day one, with biannual in-person meetups and an emerging London office.\nBe part of a pioneering project pushing the boundaries of Web3 - with technology adaptable across finance, media, data, and identity.\nWork with a world-class team of engineers, researchers, and product leaders building at the intersection of AI, autonomy, and DeFi.\nCollaborate with leading projects and our global community of agent developers, shaping the next generation of the internet and finance.\nHelp define how developers build AI agents - setting new standards for AI and crypto ecosystems.\nPlease note\nWe do not accept applications without a personalized note explaining your interest in and suitability for this particular role with us.\nCompensation varies based on the type of engagement. Independent contractors may have higher rates than employees due to differences in tax and benefit structures.\nTo apply: https://weworkremotely.com/remote-jobs/valory-ag-senior-python-engineer",
    "url": "https://weworkremotely.com/remote-jobs/valory-ag-senior-python-engineer",
    "source": "WeWorkRemotely",
    "date": "2025-12-08T06:43:01.657Z",
    "expires": "2025-12-15T06:43:01.657Z",
    "id": "live_WeWorkRemotely_1765176181657_1"
  },
  {
    "title": "Weflow: Senior / Principal Software Engineer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Berlin\n    \nURL: https://www.getweflow.com\n\n\n\nAbout Weflow\nOur mission is to help revenue teams run a repeatable, efficient, and predictable revenue process - instead of wasting time with non-selling activities, internal meetings, or cleaning CRM data.\nWith the rise of AI, we are creating a system that auto-captures & attributes data, provides insights, and run automations & alerts to drive sales performance.\n200+ fast-growing companies like BenchSci, Abridge, BluSky, TvScientific, Autorabit, IDnow, and many more use Weflow to improve team productivity, deal execution, and revenue predictability.\nBacked by Gradient Ventures and Cherry Ventures.\n\nTasks\nAs Senior/Principal Engineer, you’ll play a key role in shaping how Weflow's Revenue AI Platform evolves.\nYou’ll lead the development of deep integrations, build complex AI-driven workflows, and support a rapidly expanding customer base.\nAs Senior/Principal Engineer, you’ll play a key role in shaping how Weflow's Revenue AI Platform evolves.  If you enjoy solving tough engineering problems at scale: let's talk!\n \nRequirements\n5+ years of experience in software development.\nExpert-level proficiency in React + Typescript / Next.js, Node.js, PostgreSQL.\nExperience with AWS services and cloud architecture.\nExperience with Agile methodologies and CI/CD practices.\nSolid understanding of software design patterns and architectural distributed computing principles.\nExperience with DevOps (and actually enjoying doing it) is a big plus.\nExperience with working in SaaS product companies.\nLiving within the European Union or close to it is preferred to optimize for time zone differences.\n \nBenefits\nWeflow offers competitive pay + equity\n100% Remote - Enjoy the freedom to work from anywhere within your country of residence.\nAnnual Paid Leave (PTO).\nAnnual Company Off-Site with all expenses paid.\n\nWorking at Weflow\nWeflow is an an equal opportunity employer. \nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, or protected veteran status.\nTo apply: https://weworkremotely.com/remote-jobs/weflow-senior-principal-software-engineer",
    "url": "https://weworkremotely.com/remote-jobs/weflow-senior-principal-software-engineer",
    "source": "WeWorkRemotely",
    "date": "2025-12-08T06:43:01.657Z",
    "expires": "2025-12-15T06:43:01.657Z",
    "id": "live_WeWorkRemotely_1765176181657_2"
  },
  {
    "title": "Proton.ai: Senior Backend Engineer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Cambridge, MA \n    \nURL: https://proton.ai\n\n\n\nAbout Us:\n\n\nThe wholesale distribution industry is ready for a revolution, and Proton is leading the charge. The world relies on distributors to sell nearly every physical product, but despite its massive contribution to the global economy, this industry has been left behind in terms of technology. Proton is changing that. With AI-powered sales software, we’re breaking through the complexity of selling millions of products and making it easier for distributors to anticipate customer needs. Our mission is to bring the distribution industry into the modern age and the results speak for themselves. Distributors using Proton see 10x ROI, faster new hire ramp-up, and happier sales teams.\n\n\nIn 2022, we raised a $20M Series A backed by Felicis Ventures (investors in Twitch, Shopify, Opendoor, and many others) and Battery Ventures. This year, we’re laser-focused on driving customer growth. If you’re excited about the opportunity to wear multiple hats, and continuously learn and experiment, now’s the time to join the Proton team.\n\n\nThe Role:\n\n\nProton is looking for an experienced Senior Backend Engineer to join our fast-growing SaaS team! Reporting directly to the Director of Engineering, the Senior Backend Engineer will drive the technical development of the Proton.ai product and platform. In this role, you will be working with the engineering team to help us build a scalable, customizable, performant and secure application.\n\n\nWe're looking for someone technical with a deep understanding and curiosity of modern tech stacks and systems that will help us choose and implement solutions that benefit the future of our engineering.  \n\n\nProton collaborates with Oyster HR to hire international employees as full time (long term) contractors within our company. \n\n\n\nGross Salary range is $50,000 - $70,000  USD annually, based on experience level. \n\n\n\n \n\n\n\nWhat you’ll do: \n\n\nFeature Development:  Spearhead the backend coding of new features while helping the Product team understand complexity and tradeoffs. Developing across the entire full stack of our product, driving features from idea to production and rapidly delivering value to our customers that makes a real impact.  \nTeam Collaboration: Be part of a cross-functional team, including software engineering, infrastructure, backend, frontend, and devops, to provide architectural guidance, making sure the stack decisions being made support our future growth. \nEnterprise Customizability: Leverage your experience with enterprise applications to tailor our solutions to the unique needs of our corporate customers.\nPerformance and Reliability: Share your expertise in building high-performance, reliable applications, contributing to end-to-end architecture and data flow discussions.\n\n\n You'll be a great fit for this role if: \n\n\nProven experience as a principal engineer or similar in startup environments, with a focus on building scalable SaaS solutions. 7+ years of experience building and deploying scalable SaaS applications\n5+ years of experience with backend technologies preferably Python or Go, but C# or Java are acceptable\nTrack record of successful product architecture decisions and system improvements with a large focus on secure coding practices and standards to meet the needs of enterprise class customers and their data.\nDeep understanding of cloud-native technologies and concepts such as cloud providers, databases, application performance, scalability and security\nCuriosity for new technologies. You’re someone who actively seeks to stay informed about the latest frameworks, software advancements, and tools utilized by industry peers. You like contrasting and comparing technologies to find why one fits better for certain use-cases than the other. \nExperience with enterprise applications is highly preferred.\nExceptional communication skills for conveying complex technical concepts to diverse stakeholders.\n\n\n\n\nCurrent Tech Stack\n\n\n\nBackend \n\n\nElasticsearch & Redis as the main databases\nActively migrating to SQL as primary database \nAPI service in Python running in Kubernetes \nDaily pre-computations run in Airflow \nMachine learning \n AI models - neural networks \n Machine Learning Eng focused on experimenting with ways to improve existing models, building new models - training and developing models and deploying them \n\n\nFrontend \n\n\nVue.js 3/Nuxt 3\nMigrating Vue Component frameworks from ElementPlus/iView to Vuetify\nDocker and kubernetes to deploy \nGithub Actions for CI\n\n\n\nWhile we have a well-established tech stack, we welcome highly skilled developers who are passionate about learning and expanding their skill set. Don't have experience with everything listed here, but eager to learn? If so, we encourage you to apply!\n\n\nBenefits:\n\n\nCompetitive Salaries + Company Stock Options - we want to pay you well (and equitably!) and make you feel like an owner.  \nFlexible Schedule - we think high levels of autonomy, responsibility, and working asynchronously foster an amazing workplace.\nBiannual Company Paid Off-sites - time for us to be together, brainstorm, and make magic happen.\n\n\nTo apply: https://weworkremotely.com/remote-jobs/proton-ai-senior-backend-engineer",
    "url": "https://weworkremotely.com/remote-jobs/proton-ai-senior-backend-engineer",
    "source": "WeWorkRemotely",
    "date": "2025-12-08T06:43:01.657Z",
    "expires": "2025-12-15T06:43:01.657Z",
    "id": "live_WeWorkRemotely_1765176181657_3"
  },
  {
    "title": "AEXGroup: C# / .Net developer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Aston, PA\n    \nURL: http://www.aexgroup.net\n\n\nJob Title: C# / .Net developer\nLocation: Aston\nEmployment Type:\nExperience Level: Mid to Senior\n \nAbout the Role\nWe are seeking a skilled C# Developer with strong experience in JSON data handling and database integration. The ideal candidate will work closely with our engineering and product teams to design, develop, and maintain high-performance applications that interact with various data sources and APIs.\nExperience with .NET or Transportation Management Systems (TMS) is a strong plus.\n \nKey Responsibilities\nDesign, implement, and maintain software solutions using C#.\nWork with JSON data for configuration, serialization, and data exchange.\nDevelop and optimize database queries (SQL or NoSQL) for data-driven applications.\nCollaborate with other developers to integrate application components and APIs.\nWrite clean, efficient, and maintainable code following best practices.\nParticipate in code reviews, debugging, and performance tuning.\nAssist in integrating systems with TMS platforms.\n \nRequired Qualifications\nBachelor’s degree in computer science, Software Engineering, or related field (or equivalent experience).\n3+ years of hands-on experience in C# development.\nStrong understanding of JSON parsing, serialization, and data structures.\nSolid experience working with relational databases (MySQL, PostgreSQL, SQL Server, etc.).\nProficiency in writing and optimizing SQL queries.\nExperience with software version control (Git).\nStrong problem-solving skills and attention to detail.\n \nPreferred / Nice-to-Have Skills\nFamiliarity with Transportation Management Systems (TMS).\nExposure to RESTful APIs.\nKnowledge of Linux/Windows build environments.\n \nTo apply: https://weworkremotely.com/remote-jobs/aexgroup-csharp-net-developer",
    "url": "https://weworkremotely.com/remote-jobs/aexgroup-csharp-net-developer",
    "source": "WeWorkRemotely",
    "date": "2025-12-08T06:43:01.657Z",
    "expires": "2025-12-15T06:43:01.657Z",
    "id": "live_WeWorkRemotely_1765176181657_4"
  },
  {
    "title": "Spear AI: Senior Full-Stack Engineer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Washington, D.C.\n    \nURL: https://spear.ai\n\n\nWe’re seeking a skilled Senior Full-Stack Engineer to build the next-generation data management and artificial intelligence platform for maritime domain awareness.\nSpear AI builds sonobuoy sensors that are deployed into the water and collect edge data. We also work with the U.S. Navy to collect and process their SONAR data. You’ll have an opportunity to work on real-world projects that directly impact warfighter capabilities and mission success.\n\nWhat You’ll Do\nWe’re a small team wearing many hats, and you’d have a wide variety of responsibilities that include:\nBuild out application components and pages.\nImplement historical and real-time data feeds using WebGPU.\nDesign and develop data models using Postgres and Apache Iceberg.\nModify real-time data pipelines using MQTT and Redpanda.\nModify offline data pipelines using Dagster for batch processing.\nModify and integrate machine learning models or other algorithms into the application.\nImprove local development and CI/CD using modern tooling and GitHub Actions.\n\nWho You Are\nWe’re looking for someone with strong Full-Stack Engineering skills who shares our most important values:\nYou’re fanatical about polish. Every detail matters. You love to make sure your code is linted, formatted, fully typed, and has 100% test coverage.\nYou care about correctness. You take pride in the fact that downstream consumers trust your data.\nYou obsess over performance. You daydream about Lighthouse scores and query speed.\nYou dive deep. It’s important for you to really know how things work. You’re always building prototypes and setting up experiments to reinforce your understanding.\nYou live on the bleeding edge. You’ve got a long list of upcoming platform features you’re excited about and can’t wait for the next nightly to drop.\nYou’re a great teacher. You know how to break down a concept for a specific audience and make it click with them in a way that gets them excited.\n\nWhy Work With Us\nWe ship — We don’t work on 18-month projects that are irrelevant before they’re even finished.\nOur work has impact — We build products that are deployed to U.S. submarines and integrate with the sonobuoys we manufacture.\nWe’re growing responsibly — We have the resources to hire a lot more people, but we don’t want to build a massive team of people who don’t share our values.\nWe’re remote — Work from wherever you want. We collaborate in real time on Slack or asynchronously via GitHub.\nWe’re profitable — We aren’t burning through cash trying to make the business work. But we also have investors who believe in us and are committed to our success.\nWe care about doing great work — You don’t need permission to sweat the details here.\nWe don’t take ourselves too seriously — We’re building products that make the world safer. But we don’t let that get to our heads.\n\nImportant Skills\nExpertise in TypeScript.\nExpertise in CSS, such as TailwindCSS.\nExperience with React and frontend frameworks such as Next.js.\nFamiliar with state management such as React Context.\nExperience with Node.js, GraphQL, and REST APIs.\nProficiency with SQL/PostgreSQL.\nKnowledge of Docker and Kubernetes.\nKnowledge of Python.\n\nNice To Have\nExperience with IoT devices and sensors.\nDigital signal processing experience.\nGeospatial analysis and GIS experience.\nFamiliar with working in monorepos.\n\nWhat We Offer\nUnlimited PTO — Take the time you need to recharge and maintain work-life balance.\nDedicated Sick Time — Your health and well-being come first.\nComprehensive Health & Benefits – Medical, dental, and vision coverage to keep you and your family protected.\n11 Paid Holidays — Enjoy time off throughout the year to celebrate and spend with loved ones.\nProfessional Development — Educational opportunities and resources to help you grow your skills and advance your career.\nCollaborative Environment — Work directly with leadership in our flat organizational structure, where your ideas and contributions matter.\nMission-Driven Work — Contribute to projects that directly support national security and make a real-world impact.\nGrowth Opportunities — Join us during an exciting expansion phase where you can help shape our future.\n\nAdditional Benefit Opportunities When You Choose Spear AI:\n401(k) with company match.\nOn-site / Remote / Flexible work arrangements or hybrid options (position dependent).\nRelocation assistance (position dependent).\nReferral bonuses.\nPerformance bonuses.\nLife insurance and disability coverage.\nTechnology home office setup stipend.\nProfessional certification reimbursement (position dependent).\nWe offer competitive compensation tailored to your experience, location, and the impact you’ll make. We’re committed to equitable pay and will share a range aligned to your level and geography during the hiring process. In accordance with state law, candidates in jurisdictions such as CA, CO, WA, NY, and others, where applicable, will be provided a good-faith salary range upon request and through the hiring process. This is a full-time, exempt position under the Fair Labor Standards Act (FLSA) and is not eligible for overtime pay.\nCompensation for this position is provided on a salaried basis and is not subject to reduction based on hours worked. At Spear AI, you’ll find more than just a job; you’ll join a mission-driven team where your work directly contributes to national security. Our flat organizational structure means your voice matters, your ideas reach leadership, and your impact is visible. As we grow, we’re committed to building robust processes and infrastructure that support both our mission and our people. We value collaboration, continuous improvement, and the expertise each team member brings to the table. If you’re looking for a place to grow professionally while working on projects that truly matter, we’d love to hear from you.\nTo apply: https://weworkremotely.com/remote-jobs/spear-ai-senior-full-stack-engineer",
    "url": "https://weworkremotely.com/remote-jobs/spear-ai-senior-full-stack-engineer",
    "source": "WeWorkRemotely",
    "date": "2025-12-08T06:43:01.657Z",
    "expires": "2025-12-15T06:43:01.657Z",
    "id": "live_WeWorkRemotely_1765176181657_5"
  },
  {
    "title": "Inovo Studios: Full Stack Javascript Developer (Shape Up + Small team)",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Nashville, TN\n    \nURL: https://www.tribesocial.io\n\n\nTribe Social is a dynamic platform that fosters community engagement and content creation through a robust social infrastructure. We empower creators and users alike with real-time interactions, media sharing, and seamless integration across web and mobile.\n\nWe are seeking a talented Full-Stack JavaScript Developer to join our team and contribute to building and scaling our platform. We want builders—not just coders.\nIf you thrive in an environment where autonomy, ownership, and impact matter, you’ll love working with our team.\n \nOur Application Process\nWe work async as much as possible, so most of this process will be automated.\nSubmit application\nEmail async interview\n25 min intro video call\n90 min code review call\nPaid trial project ($50/hr x 25 hr)\nPro Tip: Writing and recording video is our primary form of communication, so leverage that!\n \nOur tech stack:\nBackend: Node.js with Sequelize ORM for MySQL\nFrontend: React.js with TailwindCSS\nMobile: Flutter (built using FlutterFlow)\nDatabases: MySQL for web/core app, Firebase for mobile app\nCI/CD: CircleCI for testing and deployment\nMedia Processing: LivePeer for video transcoding\n \nHow We Work\nAt Tribe Social, we don’t follow traditional Agile, Scrum, or Kanban methodologies. Instead, we embrace Shape Up from 37 Signals, a product development framework designed to avoid endless planning, micromanagement, and scope creep.\nFixed Time, Variable Scope – We work in monthly cycles with clear priorities. We decide how much time we want to spend on a problem and shape solutions to fit within that timeframe.\nShaping – Before a project gets scheduled, we shape it—defining the problem, solution, risks, and constraints upfront. Only well-formed, concrete ideas make it to development.\nTeam of 1 – No micromanaging. No back-and-forth over tiny details. You decide how to execute within the defined problem space.\nPair Project Management – You're not alone, but working together with one of our team for each step of the project\nWorking Meetings - We thrive with async comms for updates. We use virtual calls to untangle issues and write code together.\nTo apply: https://weworkremotely.com/remote-jobs/inovo-studios-full-stack-javascript-developer-shape-up-small-team-1",
    "url": "https://weworkremotely.com/remote-jobs/inovo-studios-full-stack-javascript-developer-shape-up-small-team-1",
    "source": "WeWorkRemotely",
    "date": "2025-12-08T06:43:01.657Z",
    "expires": "2025-12-15T06:43:01.657Z",
    "id": "live_WeWorkRemotely_1765176181657_6"
  },
  {
    "title": "Silverfin: Experienced Ruby Product Engineer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Gent, Belgium\n    \nURL: https://silverfin.com/\n\n\n\nWe start with the cliff notes about the position. If this appeals to you, continue reading for a longer text about working at Silverfin and your role \n \nAt Silverfin, we're an equal opportunity employer and value diversity at our company. Although we know we’re not perfect yet, we are working hard on it and always open for your feedback.\n \nAccording to our vision to build a diverse, equitable and inclusive organisation, our policy is to only make a final hiring decision if underrepresented groups are sufficiently represented in the list of candidates applying for the position. For this reason it’s possible interviews get slightly delayed until we’ve reached that goal.\n \nWe're committed to elevating talent by creating an environment where we can all thrive together. So if you think you have what it takes, but don't necessarily check every single box, please consider applying. We'd love to hear how you might contribute to our mission and our team.\nWhat can we offer you?\nActual, proper work-life balance\nFlexible working hours and work 100% remotely\nPersonal growth training and opportunities\nJoin a distributed remote-first engineering team with 40+ colleagues in 14 different countries on two continents\nA refreshing work environment with professional, friendly and welcoming colleagues\nA €1200 yearly budget for conferences, courses, workshops or other expenses that will improve your skills\nTwo engineering retreats per year, somewhere in Europe \nTen company-wide Wellbeing Days per year for all employees (once a month, except in July and August)\nCompensation\nFor this role, the compensation range is  €104.000 - €130.000 a year , which reflects the total compensation band for senior engineers at this level.\n \nPlease note:\nMost candidates start at the lower to mid part of the range, depending on experience and how their profile compares to our existing team. The higher end of the range is typically offered to individuals with a track record of strong impact and deep expertise in similar roles. We run annual compensation reviews, so there is clear opportunity for growth as you progress in the role.\nWhat will you work on?\nFigure out the best way to solve a customer or business problem in close collaboration with a product manager, a product designer and other engineers \nWork on user facing functionalities \nHelp with discovery and delivery of a solution \nGive the engineering perspective on potential ways of approaching a specific challenge \nHelp with maintenance and support of existing functionality\nWhat are we looking for?\nYou’re experienced in both Ruby and Rails, and also understand where the boundaries lie between them. You can code in Ruby without any of Rails’ training wheels if necessary.\nYou have experience using Javascript framework(s), understand the value of them, but also know when plain Javascript is enough.\nYou're interested in getting to know our customers to find the best solution for a given challenge. \nYou can communicate clearly in English, both in writing and verbally.\nYou’re up for mentoring coworkers and can give in-depth, productive feedback during code reviews. While you appreciate the small stuff, you recognise bike-shedding and can avoid its pitfalls.\nYou know and can apply best practices when relevant. That means the usual like version control, testing, and refactoring; but also higher level concepts such as good object oriented design.\nYou're aware of the trade-offs involved in proper engineering and can make balanced business decisions, keeping in mind all the stakeholders of the project.\nYou’ve got opinions on code design and you can discuss them, but you’re professional enough to not let those opinions get in the way of a consensus if necessary.\nIf you’re any good at Ruby, this is probably not the first job ad you’ve seen, so we’ve done our best to stand out while also accurately presenting what we’re all about. If it sounds like you would enjoy working with us, don’t hesitate to apply or drop us a line with questions , or read on for the more detailed explanation ..\n \nWhat’s a Silverfin?\nAt Silverfin we’re trying to apply the promise of software to the age-old industry of accounting. With our SaaS we’re automating a large chunk of the busy-work that accountants are currently handling manually, and are building new tools so they can provide better services to their customers. We aim to optimise their workflow in such a way that accountants can spend more time on the much more impactful and rewarding work of advising their customers, the business owners.\n \nThe good news is we’re succeeding in doing exactly that. Every week more than 15.000 financial service professionals use Silverfin to help and advise more than 400.000 businesses. Our customers adore us! The even better news is there’s still plenty left to work on, and that’s where we hope you come in.\n \nSince November 2023 we are proudly part of Visma - the European leader in mission-critical cloud software, enjoying the power of the Visma brand and resources whilst retaining business autonomy and go-to-market freedom.\n \nWhat’s the product team like?\nThe product team is a cross-functional team where engineers work together closely with product managers and product designers. The team's input is a user or business problem which it can solve with a high degree of autonomy. From day one all profiles are involved in understanding the problem, ideating solutions and doing quick experiments to prove that a certain solution might actually lead to the desired outcome. After the discovery phase the same team is tasked with the delivery of the chosen solution. The team will then track the adoption of the solution and will make sure that the problem is actually solved. The setup of the team is largely based on the book \"Inspired\" by Marty Cagan.\n \nWhat does working at Silverfin look like?\nNext to the four product teams, there are three more platformy teams, who own complex subsystems, like syncs or AI, and or support the product teams with knowledge, frameworks and services.\n \nOur ops team ensures things run smoothly, deploys happen correctly, and will work with you when issues should arise. We’re enthusiastic followers of the devops mindset, which means ops and developers work together to solve problems, and empower each-other to be self-sufficient, instead of throwing problems over the wall to the “other side”.\n \nWe run an up-to-date Rails monolith on the backend, with PostgreSQL and Redis for persistence and caching, and everything is running on a Kubernetes cluster in Google Cloud. Our daily tools include GitLab, Quip and Slack, with Google Meet as our remote conferencing tool of choice. \n \nNo code gets deployed without a code-review by a peer and testing is a must. Our pipeline automates deployment when the suite is green, and deploys happen dozens of times a day. Each team is currently doing Kanban, but they’re free to follow whatever process suits them best. There are regular retros held to work towards continuous improvement.\n \nSoftware for accountants is not considered to be very exciting, but we have our fair share of technical challenges. To give you a sense of scale: our database exceeds 10TB*, and our largest table has crossed the 10 billion row mark a long while back. We interface with more than 30 different external APIs, and provide third parties an API of our own.\n \n*: Our ops team noted that this actually isn’t that hard to achieve if you’re just indexing everything, but it still sounds impressive, right?\n \nWhat makes the engineering team at Silverfin special?\nWe’re a remote-first engineering team of 40 people distributed in 14 different countries over two continents. A priority for us is maintaining proper work-life balance. We avoid meetings as much as possible, accept deadlines only when absolutely necessary, and never expect anyone to work longer hours than they’ve signed up for. A day in our working lives is pretty boring, and we feel that’s exactly how it should be.\n \nWorking with us means you can be flexible with your schedule. It’s OK to disappear for a few hours in the middle of the day to run some errands, get a haircut, pick up the kids - whatever reason, you don’t need to explain yourself.\n \nYou also fully decide when you take time off: our team is sufficiently varied and well organised that there are always enough people around to handle the load, and in the rare cases it’s not, we will decrease the load instead of asking people to move their holiday.\n \nBeing remote-first means we favour asynchronous communication. We don’t shy away from chatting in Slack, but the important decisions or discussions are done in Gitlab issues, over email, or in Quip, so there’s a written, persisted record. We’re mindful of maintaining long chunks of focussed time, which means we avoid @-mentions or PMs on Slack, and other triggers and interrupts. We encourage using Slack’s DnD function, especially when you’re not working!\n \nWe’d be really happy to welcome you in our #engineering channel, but it’s not just virtual: we make sure we regularly get to see each other in real life too. Twice a year we fly the whole engineering team together to a different location in Europe, and at least once a year we join up with the rest of the company so we can spend some time together with the other departments.\n \nWhat does your future look like?\nPersonal growth is key to staying motivated. At Silverfin you don’t need to move to management in order to advance. We see the individual contributor track and the management track as two different growth paths which every engineer can follow and switch between. You can be promoted, including pay raises, as a contributor just like as a manager.\n \nEveryone has a €1200 yearly budget to spend on conferences, courses, workshops or other training to improve their skills and level up. This also includes accommodation, travel costs. If the conference is on a workday you’ll get paid like any normal day.\n \nRequirements\nYou have at least 4 years of experience working with Ruby, or 2 years of experience with Ruby and 4 years in one or more other programming languages\nYou have experience Javascript framework(s)\nYour work hours have some overlap with EU business hours (we require your local timezone to be within CET +/- 3h)\nYou can communicate clearly in English, both written and verbally\nNice to haves\nThese would be nice but are definitely not necessary. Don’t worry if none of the following applies to you.\nExperience as a remote worker in a fully remote team\nExperience working with large datasets and the problems they bring\nExperience with Vue.js\nExperience in Fintech\nAccounting knowledge\n \nInterested?\nYou can apply today and we’ll start having interviews from 24/11/2025. There’s no benefit to applying early, so you can take your time answering the application questions.\n \nRead about what our interviewing process looks like \n \nWe may use artificial intelligence (AI) tools to support parts of the hiring process, such as reviewing applications, analyzing resumes, or assessing responses. These tools assist our recruitment team but do not replace human judgment. Final hiring decisions are ultimately made by humans. If you would like more information about how your data is processed, please contact us.\nTo apply: https://weworkremotely.com/remote-jobs/silverfin-experienced-ruby-product-engineer",
    "url": "https://weworkremotely.com/remote-jobs/silverfin-experienced-ruby-product-engineer",
    "source": "WeWorkRemotely",
    "date": "2025-12-08T06:43:01.657Z",
    "expires": "2025-12-15T06:43:01.657Z",
    "id": "live_WeWorkRemotely_1765176181657_7"
  },
  {
    "title": "Software Engineer - Remote",
    "company": "CodeCraft Inc",
    "description": "New Software Engineer position available. Remote work with competitive compensation and benefits. Apply now for immediate consideration.",
    "url": "https://stackoverflow.com/jobs/1765176181851_0",
    "source": "StackOverflow",
    "date": "2025-12-08T06:43:01.851Z",
    "expires": "2025-12-15T06:43:01.851Z",
    "id": "fallback_StackOverflow_1765176181851_0"
  },
  {
    "title": "Mobile Developer - Remote",
    "company": "AppInnovators",
    "description": "New Mobile Developer position available. Remote work with competitive compensation and benefits. Apply now for immediate consideration.",
    "url": "https://stackoverflow.com/jobs/1765176181851_1",
    "source": "StackOverflow",
    "date": "2025-12-08T06:43:01.851Z",
    "expires": "2025-12-15T06:43:01.851Z",
    "id": "fallback_StackOverflow_1765176181851_1"
  },
  {
    "title": "Data Scientist - Remote",
    "company": "Analytics Pro",
    "description": "New Data Scientist position available. Remote work with competitive compensation and benefits. Apply now for immediate consideration.",
    "url": "https://stackoverflow.com/jobs/1765176181851_2",
    "source": "StackOverflow",
    "date": "2025-12-08T06:43:01.851Z",
    "expires": "2025-12-15T06:43:01.851Z",
    "id": "fallback_StackOverflow_1765176181851_2"
  }
]