[
  {
    "title": "Proxify AB: Senior Backend Developer (Node.js / Nest.js)",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Sweden\n    \nURL: http://career.proxify.io\n\n\nThe Role:\n \nWe are looking for a Senior Backend (Node.js / Nest.js) Developer to join our fast-growing network. You’ll be responsible for building modern and scalable web applications, working closely with backend developers and designers to create intuitive user experiences.\nThis is a long-term, full-time remote role with opportunities to work on innovative projects that make a difference.\n \nWhat we’re looking for:\n \n5+ years with Node.js and 3+ past years with Nest.js\nStrong expertise in Node.js and Nest.js frameworks.\nProven experience building REST and/or GraphQL APIs.\nStrong knowledge of JavaScript (ES6+) and TypeScript.\nSolid experience with relational and/or NoSQL databases (e.g., PostgreSQL, MySQL, MongoDB).\nFamiliarity with authentication/authorization mechanisms (JWT, OAuth2).\nExperience with unit/integration testing (e.g., Jest, Mocha).\nProficiency with Git and version control workflows.\nLocated in CET timezone (+/- 3 hours), we are unable to consider applications from candidates in other time zones.\n \nNice to Have:\n \nExperience with cloud platforms (AWS, Azure, GCP).\nFamiliarity with CI/CD pipelines and DevOps practices.\nUnderstanding of event-driven architecture and message brokers (e.g., RabbitMQ, Kafka).\nExperience with Docker and containerized applications.\nKnowledge of microservices and serverless architectures.\n \nResponsibilities:\n \nDesign and develop robust, scalable, and secure backend applications using Node.js and Nest.js.\nImplement RESTful APIs, GraphQL endpoints, and microservices architectures.\nOptimize application performance, scalability, and maintainability.\nIntegrate with databases (SQL/NoSQL) and external services via APIs.\nEnsure code quality, security, and compliance with industry standards.\n \nWhat we offer:\n \nGet paid, not played\nNo more unreliable clients. Enjoy on-time monthly payments with flexible withdrawal options.\n \nPredictable project hours\nEnjoy a harmonious work-life balance with consistent 8-hour working days with clients.\n \nFlex days, so you can recharge\nEnjoy up to 24 flex days off per year without losing pay, for full-time positions found through Proxify.\n \nCareer-accelerating positions at cutting-edge companies\nDiscover exclusive long-term remote positions at the world's most exciting companies.\n \nHand-picked opportunities just for you\nSkip the typical recruitment roadblocks and biases with personally matched positions.\n \nOne seamless process, multiple opportunities\nA one-time contracting process for endless opportunities, with no extra assessments.\n \nCompensation\nEnjoy the same pay, every month with positions landed through Proxify.\nTo apply: https://weworkremotely.com/remote-jobs/proxify-ab-senior-backend-developer-node-js-nest-js",
    "url": "https://weworkremotely.com/remote-jobs/proxify-ab-senior-backend-developer-node-js-nest-js",
    "source": "WeWorkRemotely",
    "date": "2025-11-03T02:02:00.271Z",
    "expires": "2025-11-10T02:02:00.271Z",
    "id": "live_WeWorkRemotely_1762135320271_0"
  },
  {
    "title": "Proxify AB: Senior Frontend Developer (React.js+Next.js)",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Sweden\n    \nURL: http://career.proxify.io\n\n\n\nThe Role:\n \nWe are looking for a Senior Frontend Developer with strong proficiency with React.js and Next.js for one of our clients. You are a perfect candidate if you are growth-oriented, you love what you do, and you enjoy working on new ideas to develop exciting products.\n \nWhat we’re looking for:\n \nMinimum of 5 years of experience in frontend development with a strong portfolio of projects demonstrating expertise in React.js and Next.js.\nProficiency in HTML, CSS, JavaScript, TypeScript, and modern frontend development tools and frameworks.\nExperience with state management libraries such as Redux, MobX, or similar.\nProficiency with testing frameworks and tools like Jest, Cypress, or Testing Library.\nStrong knowledge of version control systems, particularly Git.\nLocated in CET timezone (+/- 3 hours), we are unable to consider applications from candidates in other time zones.\n \nResponsibilities:\n \nDesign, develop, and maintain high-performance, scalable web applications using React.js and Next.js.\nCreate reusable and maintainable UI components with a focus on performance and accessibility.\nWork closely with designers, backend developers, and product managers to translate user needs and business goals into functional and engaging web applications.\nWrite clean, efficient, and well-documented code following best practices in software development.\nIdentify and address performance bottlenecks to ensure smooth and responsive user experiences.\nConduct unit testing, integration testing, and end-to-end testing to ensure the reliability and robustness of the applications.\n \n \nWhat we offer:\n \nGet paid, not played\nNo more unreliable clients. Enjoy on-time monthly payments with flexible withdrawal options.\nPredictable project hours\nEnjoy a harmonious work-life balance with consistent 8-hour working days with clients.\nFlex days, so you can recharge\nEnjoy up to 24 flex days off per year without losing pay, for full-time positions found through Proxify.\nCareer-accelerating positions at cutting-edge companies\nDiscover exclusive long-term remote positions at the world's most exciting companies.\nHand-picked opportunities, just for you\nSkip the typical recruitment roadblocks and biases with personally matched positions.\nOne seamless process, multiple opportunities\nA one-time contracting process for endless opportunities, with no extra assessments.\nCompensation\nEnjoy the same pay, every month with positions landed through Proxify.\nTo apply: https://weworkremotely.com/remote-jobs/proxify-ab-senior-frontend-developer-react-js-next-js",
    "url": "https://weworkremotely.com/remote-jobs/proxify-ab-senior-frontend-developer-react-js-next-js",
    "source": "WeWorkRemotely",
    "date": "2025-11-03T02:02:00.271Z",
    "expires": "2025-11-10T02:02:00.271Z",
    "id": "live_WeWorkRemotely_1762135320271_1"
  },
  {
    "title": "Proxify AB: Senior Golang Developer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Sweden\n    \nURL: http://career.proxify.io\n\n\n\nThe Role:\n \nWe are looking for a Senior Golang Developer for one of our clients. You are a perfect candidate if you are growth-oriented, you love what you do, and you enjoy working on new ideas to develop exciting products.\n \nWhat we are looking for:\n+5 years of solid experience in development with Golang.\nYou follow the best practices and conventions.\nAbility to work with minimal supervision.\nIntermediate-advanced English level.\nYou can communicate well with both technical and non-technical clients.\nLocated in CET timezone (+/- 3 hours), we are unable to consider applications from candidates in other time zones.\n \nNice-to-have:\nBasic knowledge of DevOps culture and REST API development would be a plus.\n \nResponsibilities:\nAbility to design, develop, document, and test core software components according to product requirements.\nAbility to collaborate and incorporate other team members’ work implementations.\nCompetency to work with QA and DevOps teams to define product requirements and adopt new technologies in order to deliver quality software research.\nAbility to collaborate with stakeholders.\n \n \nWhat we offer:\n \nGet paid, not played\nNo more unreliable clients. Enjoy on-time monthly payments with flexible withdrawal options.\n \nPredictable project hours\nEnjoy a harmonious work-life balance with consistent 8-hour working days with clients.\n \nFlex days, so you can recharge\nEnjoy up to 24 flex days off per year without losing pay, for full-time positions found through Proxify.\n \nCareer-accelerating positions at cutting-edge companies\nDiscover exclusive long-term remote positions at the world's most exciting companies.\n \nHand-picked opportunities, just for you\nSkip the typical recruitment roadblocks and biases with personally matched positions.\n \nOne seamless process, multiple opportunities\nA one-time contracting process for endless opportunities, with no extra assessments.\n \nCompensation\nEnjoy the same pay, every month with positions landed through Proxify.\nTo apply: https://weworkremotely.com/remote-jobs/proxify-ab-senior-golang-developer-4",
    "url": "https://weworkremotely.com/remote-jobs/proxify-ab-senior-golang-developer-4",
    "source": "WeWorkRemotely",
    "date": "2025-11-03T02:02:00.271Z",
    "expires": "2025-11-10T02:02:00.271Z",
    "id": "live_WeWorkRemotely_1762135320271_2"
  },
  {
    "title": "Proxify AB: Senior Backend Developer (Python)",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Sweden\n    \nURL: http://career.proxify.io\n\n\nThe Role:\n \nWe are looking for a Senior Python Developer for one of our clients. You are a perfect candidate if you are growth-oriented, you love what you do, and you enjoy working on new ideas to develop exciting products.\n \nWhat we are looking for:\n5+ years of experience building products with Python and Django.\nHigh proficiency in SQL with experience using databases like PostgreSQL.\nExperience scaling cloud infrastructures with Docker or Kubernetes is a plus.\nExperience managing cloud infrastructures, specifically AWS or GCP.\nYou follow the best practices and conventions.\nRelevant experience in CI/CD and related tools.\nAbility to work with minimal supervision.\nIntermediate-advanced English level.\nYou can communicate well with both technical and non-technical clients.\nTime zone: CET (+/- 3 hours). We are unable to consider applications from candidates in other time zones.\n \nResponsibilities:\nAbility to build libraries and frameworks of reusable efficient code.\nCompetence in designing and implementing low-latency, stable and performing applications.\nCapacity to effectively collaborate with other team members and stakeholders remotely.\nAbility to implement data protection systems.\nCompetence in data storage solutions.\n \n \nWhat we offer:\n\n \nGet paid, not played\nNo more unreliable clients. Enjoy on-time monthly payments with flexible withdrawal options.\n\n\nPredictable project hours\nEnjoy a harmonious work-life balance with consistent 8-hour working days with clients.\n\nFlex days, so you can recharge\nEnjoy up to 24 flex days off per year without losing pay, for full-time positions found through Proxify.\n\nCareer-accelerating positions at cutting-edge companies\nDiscover exclusive long-term remote positions at the world's most exciting companies.\n\nHand-picked opportunities just for you\nSkip the typical recruitment roadblocks and biases with personally matched positions.\n\nOne seamless process, multiple opportunities\nA one-time contracting process for endless opportunities, with no extra assessments.\n\nCompensation\nEnjoy the same pay, every month with positions landed through Proxify.\nTo apply: https://weworkremotely.com/remote-jobs/proxify-ab-senior-backend-developer-python-3",
    "url": "https://weworkremotely.com/remote-jobs/proxify-ab-senior-backend-developer-python-3",
    "source": "WeWorkRemotely",
    "date": "2025-11-03T02:02:00.271Z",
    "expires": "2025-11-10T02:02:00.271Z",
    "id": "live_WeWorkRemotely_1762135320271_3"
  },
  {
    "title": "Commure/Athelas: Senior Software Engineer - BRAZIL",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Mountain View, CA\n    \nURL: https://commure.com\n\n\nAbout the Role\nThis role will focus on driving the design and implementation of general software that empowers our operations teams to better serve our healthcare providers, thus giving them more time to focus on patients and deliver better services. We are looking for someone with a minimum of two years of software engineering experience.\n\nWhat You’ll Do\nBuild end-to-end products to to scale and empower our operations teams\nBe a part of a tremendously fast-paced team that celebrates fast execution and decision\nWork across the entire software stack\nWork with a stack that includes Python, Vue, React Native, Flask, and other frameworks\nWhat You Have\nAt least five years of production software engineering experience\nExpert in Python\nAble to work on both frontend (JavaScript, TypeScript, React) and backend (Python) in general and deliver product end-to-end\nBasic understanding of cloud solutions (GCP, Docker, Kubernetes)\nFamiliarity with modern software development methodologies and cycles\nUnderstand standard web-based technologies, such as restful standards and relational databases (eg, PostgreSQL)\nHave a strong product engineering sense with a can-do builder attitude\nAble to identify opportunities to improve the current process\nStrong proficiency in the English language, including the ability to articulate ideas clearly and concisely in both verbal and written formats.\nBonus Points If You Have\nHaving worked on greenfield projects before, build and ship products from scratch\nWorked in the healthcare industry before\nExperience working in a fast pace environment (we ship fast)\nRemote work experience\nFamiliarity with BI software\nThe first stage will be a basic take-home assessment. Once we review the submission and the feedback is positive, we will contact you to schedule the first interview.\n \nNote: You will not be eligible for benefits as an international contractor at this time.\n \nWhy you’ll love working at Commure + Athelas:\nHighly Driven Team: We work hard and fast for exceptional results, knowing we’re doing mission-driven work to transform the country’s largest sector. \nStrong Backing: We are backed by top investors including General Catalyst, Sequoia, Y Combinator, Lux, Human Capital, 8VC, Greenoaks Capital and Elad Gil. \nIncredible Growth: Prior to our merger, Commure and Athelas had independently grown more than 500% YoY for three consecutive years. We’ve achieved Series D funding, have an industry-leading runway, and continue to scale rapidly. \nTo apply: https://weworkremotely.com/remote-jobs/commure-athelas-senior-software-engineer-brazil",
    "url": "https://weworkremotely.com/remote-jobs/commure-athelas-senior-software-engineer-brazil",
    "source": "WeWorkRemotely",
    "date": "2025-11-03T02:02:00.271Z",
    "expires": "2025-11-10T02:02:00.271Z",
    "id": "live_WeWorkRemotely_1762135320271_4"
  },
  {
    "title": "LLCU University: Senior Front-End Wordpress Developer – Tailwind Specialist",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Florida\n    \nURL: https://www.llcuniversity.com/\n\n\nAbout the Role:\nWe're looking for a senior front-end developer who cares about clean code, loves solving complex puzzles, and has a great eye for design. This role is for a full redesign of our website — not client work, not multiple sites.\nYou’ll turn our Figma design into a custom WordPress site — no page builders, just a thoughtful, performant, hand-coded theme. We'll launch the new design component-by-component to the live site, so you’ll work closely with our team to build and ship each part with care.\nWe use GitHub for version control. You should be confident in CSS, Tailwind CSS, PHP, JavaScript, and HTML. If you have an eye for detail and care about helping people through your work, we’d love to meet you.\n(Note: We don't need/use JS frameworks like React, Vue.js, etc.)\nWhat does the work look like?\nWe’re looking for a front-end developer to work in between our design & tech teams. Our current project is a major redesign, which still has a lot of logic to code. After that, you could be working on any number of projects, from interactive tools built from scratch (ex: an Operating Agreement generator) to internal tools for the content team. \nAs a first step, you’ll get a full walkthrough of what’s been built so far. You might review or audit the code, and you’ll be part of the brainstorming and problem-solving process. You’ll also help us figure out exactly what work still needs to be done.\nKey Responsibilities:\nTurn detailed Figma designs into a responsive, accessible, and fully functional WordPress site\nWrite clean, efficient, and maintainable code using CSS, PHP, JavaScript and HTML.\nMake sure everything works across browsers and runs fast\nWork closely with our designer, back-end developer, founder, and SEO strategist to get every detail right — we care deeply about doing great work\nHelp improve how we build things by refining our process and sharing ideas\n\nRequired Skills & Qualifications:\n10+ years of front-end WordPress experience\nExpert at turning Figma designs into custom WordPress themes\nStrong in CSS, PHP, JavaScript and HTML.\nVast experience using Tailwind CSS in real-world projects\nStrong proficiency in CSS and modern layout techniques (Flexbox, Grid, etc.)\nDeep understanding of responsive and adaptive design\n3+ years using Git for version control\nClear and thoughtful communication in English — written and spoken\nWilling to have honest, open, even though conversations when needed — we care about trust and doing great work together\nA strong culture fit — we're a kind, friendly team that cares about details, good communication, and helping each other do our best work\n\nPersonal Traits:\nYou have a growth mindset and love learning new things to keep improving your craft\nYou bring a positive attitude, take initiative, and enjoy solving tough problems\nYou’re comfortable working as part of a team and independently — we work on the Eastern Time zone.\nNote: We do lots of video calls and screensharing for brainstorming and troubleshooting.\nWhy Join Us?\nCollaborate on high-impact projects with a passionate, supportive team.\nEmbrace a culture that values positivity, growth, and professional excellence.\nEnjoy flexibility, autonomy, and opportunities to grow your skillset.\nTo apply: https://weworkremotely.com/remote-jobs/llcu-university-senior-front-end-wordpress-developer-tailwind-specialist",
    "url": "https://weworkremotely.com/remote-jobs/llcu-university-senior-front-end-wordpress-developer-tailwind-specialist",
    "source": "WeWorkRemotely",
    "date": "2025-11-03T02:02:00.271Z",
    "expires": "2025-11-10T02:02:00.271Z",
    "id": "live_WeWorkRemotely_1762135320271_5"
  },
  {
    "title": "A.Team: Senior Independent Software Developer ($90-$170/hr)",
    "company": "WeWorkRemotely",
    "description": "Headquarters: NYC and TLV\n    \nURL: https://build.a.team/wwrfastrackreferral\n\n\nImagine choosing your projects, collaborating with the best, and keeping every dollar you earn.\n\n\nAt A·Team, we’ve turned this vision into reality for top-tier independent software builders. Since May 2020, A·Teamers have earned over $108 million working on high-impact projects for companies backed by a16z, YC, Insight Partners, Tiger Global, Softbank, General Catalyst, and more.\n\n\nWhy A·Team?\n\n\nHigh-paying, meaningful missions: Earn $90-$170/hr with over 500 companies—from trailblazing startups like Sightful, D-ID, and Apprentice to enterprise innovators like Lyft, Google X, and HCA.\nCollaborate with trusted peers: Work in small, elite teams for high-impact projects, ensuring top-tier collaboration.\nFull autonomy: Choose projects that excite you. Join when you're ready, and take breaks as needed.\nExclusive gatherings: Participate in off-the-record events and connect with top builders.\nTransparent earnings: Keep 100% of your rate.\n\n\nHow to Join:\n\n\nVisit A·Team Application and mention WWR under \"how you heard about A·Team.\" No cover letter needed – we value your portfolio.\n\n\nWhat to Expect:\n\n\nAs an A·Teamer, you’ll be invited to projects matching your interests. Work with startups, well-funded companies, or non-tech giants, building ambitious software from scratch in 3-4 person teams. Scope, strategize, and execute, often guiding clients who need direction.\n\n\nWho We're Looking For:\n\nSenior developers who left large companies to pursue their craft with autonomy.\nThose preferring consistent contract work over full-time roles, eager to create innovative products with other top-tier builders.\nIndependent workers, full-time employees exploring client work, bootstrapping side projects, or searching for their next big thing.\n\n\nNot for:\n\nPeople seeking small gigs.\nBuilders focused on simple WordPress/Wix/Squarespace sites.\nEarly-career professionals and recent grads.\n\n\nOur Vision:\n\n\nA·Team is for the \"unhirables\" – exceptional builders whom traditional companies can’t hire full-time. We empower you to do meaningful work with your favorite people in small, autonomous, expert teams.\n\nA.Team is forging a new vision for the future of work that’s backed by $60M in funding from investors like Insight Partners, Tiger Global, and Spruce House, future-of-work pioneers like Adam Grant, Dan Ariely and Joseph Fuller, cultural leaders like Jay-Z’s RocNation, and founders and execs from CAA, Apollo, Upwork, Fiverr, and SpaceX.\n\nReady to join a team where your talent is valued, and your work is meaningful? Apply now and start your next great mission with A·Team.\nTo apply: https://weworkremotely.com/remote-jobs/a-team-senior-independent-software-developer-90-170-hr",
    "url": "https://weworkremotely.com/remote-jobs/a-team-senior-independent-software-developer-90-170-hr",
    "source": "WeWorkRemotely",
    "date": "2025-11-03T02:02:00.271Z",
    "expires": "2025-11-10T02:02:00.271Z",
    "id": "live_WeWorkRemotely_1762135320271_6"
  },
  {
    "title": "Skedda: Senior Full-Stack Software Engineer (Remote)",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Boston\n    \nURL: https://skedda.com\n\n\nCompensation: $75,000 to $85,000 USD per year (Depending on experience and qualifications)\n__________________________________________________________________________\nSkedda is a leading global booking management platform dedicated to streamlining venue and space reservations and scheduling. We serve over 7,000 customers and nearly two million users across the world. Today, the product includes functionality such as floor plan visualizations, venue booking, pricing and payments capabilities, and utilization reports and analytics. Skedda has won awards from G2, Capterra, and SoftwareAdvice.\nWe are seeking a senior full-stack developer to take on a key role in delivering new features across the stack, from concept to launch. This role involves owning the technical aspects of projects, implementing full test automation, and solving complex, interesting challenges. You will research, test, and implement new technologies while collaborating closely with the team on design, coding standards, and best practices. \nResponsibilities\nProvide senior-level implementation for new features across the full-stack\nImplement full test automation for your work (we have a culture of ownership and quality)\nOwn projects from a technical perspective, from conceptualization to launch\nSolve complex, but fun, technical challenges\nResearch, propose, test, and implement new techniques and technologies\nCollaborate with team members on design techniques and coding standards\nSkills & Experience\n7+ years of full stack development with C# and .NET/Core (ideally SaaS products)\nStrong experience with front end JavaScript frameworks\nStrong experience developing Web APIs\nStrong SQL skills (SQL Server preferred)\nStrong TDD and test automation skills (both unit and integration testing)\nHands-on experience with Azure Cloud\nAzure DevOps experience is a plus\nAbout you\nYou honor your word and own whatever you take on\nYou love to build intuitive software\nYou make mistakes and learn fast\nYou like small teams\nYou’re not afraid to ask questions\nYou pay attention to detail\nYou want to make a difference in the real world\nYou’re self-driven\nYou follow your intuition and sync when needed\nYou strive for excellence in everything you do\nBenefits\nCompetitive salary, benefits package, and paid time off\n\nCompensation:\nThe salary for this position is competitive, with a range of $75,000 to $85,000 USD per year, depending on experience and qualifications.\nFlexible schedule \nCreative and collaborative work environment\nDirect exposure to the leadership team across departments\nBe empowered to leave a significant mark on the product and the customers\nA thorough, organized engineering onboarding process for quick learning\nHardware of your choice - PC or Mac\nDevelop with the latest platforms, frameworks, tooling and standards\nWork in, and maintain, a near zero technical debt environment\nEnjoy not having to support IE or Safari < 13\nOur Tech Stack: Azure, .NET 8.x, C# 12, Ember.js 5.7 (Octane), Bootstrap 5.x,Selenium, Entity Framework 8.x, SQL Server 2022, Azure DevOps, \nTo apply: https://weworkremotely.com/remote-jobs/skedda-senior-full-stack-software-engineer-remote-1",
    "url": "https://weworkremotely.com/remote-jobs/skedda-senior-full-stack-software-engineer-remote-1",
    "source": "WeWorkRemotely",
    "date": "2025-11-03T02:02:00.271Z",
    "expires": "2025-11-10T02:02:00.271Z",
    "id": "live_WeWorkRemotely_1762135320271_7"
  },
  {
    "title": "Software Engineer - Remote",
    "company": "CodeCraft Inc",
    "description": "New Software Engineer position available. Remote work with competitive compensation and benefits. Apply now for immediate consideration.",
    "url": "https://stackoverflow.com/jobs/1762135320651_0",
    "source": "StackOverflow",
    "date": "2025-11-03T02:02:00.650Z",
    "expires": "2025-11-10T02:02:00.650Z",
    "id": "fallback_StackOverflow_1762135320651_0"
  },
  {
    "title": "Mobile Developer - Remote",
    "company": "AppInnovators",
    "description": "New Mobile Developer position available. Remote work with competitive compensation and benefits. Apply now for immediate consideration.",
    "url": "https://stackoverflow.com/jobs/1762135320651_1",
    "source": "StackOverflow",
    "date": "2025-11-03T02:02:00.650Z",
    "expires": "2025-11-10T02:02:00.650Z",
    "id": "fallback_StackOverflow_1762135320651_1"
  },
  {
    "title": "Data Scientist - Remote",
    "company": "Analytics Pro",
    "description": "New Data Scientist position available. Remote work with competitive compensation and benefits. Apply now for immediate consideration.",
    "url": "https://stackoverflow.com/jobs/1762135320651_2",
    "source": "StackOverflow",
    "date": "2025-11-03T02:02:00.650Z",
    "expires": "2025-11-10T02:02:00.650Z",
    "id": "fallback_StackOverflow_1762135320651_2"
  }
]