[
  {
    "title": "Toptal: Backend Java Developer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Remote\n    \nURL: https://toptal.com\n\n\n\nDescription\nOur client is a global media and tech company that connects people to their passions. We reach nearly 900M people around the world, bringing them closer to what they love—from finance and sports to mail, shopping, gaming and news—with the trusted products, content, and tech that fuel their day.\nWe continue to be one of the largest and most recognizable email services in the world. Delivering over 4.5B emails daily, and with consistently top-rated mobile apps. Our Mail is a critical pillar in the company’s long-term growth strategy.\nAbout the Role:\nWe are looking for experienced Back-end Java Developer to join our team and work with one of the leading Mail platform in the world.\nWe are working on a partner migration of our core mail services. Therefore we need to be cloud agnostic, lift and shift existing functionality to the cloud. This involves moving all our applications, code, platforms, and infrastructure to the cloud, optimizing it and modernizing it for future growth.\nAbout You:\nYou are passionate about growing your skills and value high quality application development on modern tech stack and cloud. You will enjoy building the next generation of communication products, web and mobile platforms. You are interested in how best to drive tasks to completion, collaborate to achieve your goals, think through scenarios and edge cases, learn from your leadership, and understand the broader impact of your work.\nIf you are interested in joining a world-class team of passionate people and industry veterans who care about code quality, architecture, design and user experience as much as having fun together, then we’d like to talk to you.\nTasks and Deliverables:\nDevelop and maintain Java-based applications on cloud-based platforms.\nMigration of Java applications and core mail services\nIdentify and implement optimizations, fine-tune / re-architect infrastructure\nIntegration with existing DevOps and CICD pipelines/environments\nImprove future maintainability of the platform and surrounding tools\nDesign and implement solutions that meet business requirements, ensuring scalability, security, and reliability.\nWork with cross-functional teams to develop and deploy complex applications on AWS/GCP.\nLead and mentor other engineers throughout design and development\nRequirements\nStrong back-end experience in software development using Java Object-oriented programming skills\nStrong knowledge of RESTful APIs and microservices architecture\nExperience with AWS or GCP\nUnderstanding of data structures and algorithms\nExperience with Distributed Systems and Large Scale Systems\nStrong computer science fundamentals and knowledge of Design Patterns\nAnalytical and problem solving skills\nSQL and RDS Database\nNice to Have Experience:\nExperience with DevOps tools and practices\nLeadership experience\nEngagement Highlights:\n- Commitment: We prefer full-time (40 hr/week) but open to considering part-time who can ramp up to full-time in 3-4 weeks.\n- Overlap: 6+ hours with PST\n- Client will be sending their own laptop (MacBook) to the talent to use\nTo apply: https://weworkremotely.com/remote-jobs/toptal-backend-java-developer",
    "url": "https://weworkremotely.com/remote-jobs/toptal-backend-java-developer",
    "source": "WeWorkRemotely",
    "date": "2025-10-23T12:53:40.977Z",
    "expires": "2025-10-30T12:53:40.977Z",
    "id": "live_WeWorkRemotely_1761224020978_0"
  },
  {
    "title": "Toptal: Senior Rust Developer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Remote\n    \nURL: https://toptal.com\n\n\n\nDescription\nWe are looking for a Senior Rust Developer. Their goal is to advance computational biology by developing scalable, open-source workflow execution engines that empower scientists to efficiently deploy and manage large-scale computations.\nGeneral Information\nLocation: Remote. Open to talents from GMT-8 to GMT+5 time zones. The client is not open to China, Australia or countries in similar time zones.\nOverlap: 3 - 4 hours with Chicago/Texas (US Central Time)\nLength: 6 months (with potential for extension)\nProject Information\nSprocket is an open workflow execution engine written in Rust—it enables scientists, who are generally not experts at scaling and deploying large-scale computation, to write simple workflow descriptions using the Workflow Description Language.\nRequirements\nRequired Skills:\nSenior-level proficiency in Rust, with a strong track record of shipping production code\nExperience contributing to or leading open-source projects\nFamiliarity with workflow engines, scientific computing, or large-scale computation\nAbility to work with Rust crates for lexing, parsing, validating, linting, formatting, testing, and executing domain-specific languages\nStrong skills in API design and specification development\nExperience using GitHub for project planning and collaboration\nOptional Skills (not mandatory):\nExperience developing or improving specifications using OpenAPI (Swagger)\nFamiliarity with the Workflow Description Language (WDL) and Task Execution Schema (TES)\nExperience with Kubernetes or cloud/HPC environments\nPrior involvement with standards bodies (e.g., GA4GH)\nExperience with Rust crates such as utoipa for OpenAPI/Swagger documentation\nDeliverables\nContribute to the development and enhancement of the Sprocket workflow execution engine and related Rust crates (e.g., wdl, sprocket, crankshaft)\nImprove and extend the Workflow Description Language (WDL) specification, including proposing, drafting, and shepherding changes through the ratification process\nCollaborate on the evolution of the Task Execution Schema (TES), including interaction with standards bodies and the open-source community\nDevelop and maintain reference implementations, ensuring comprehensive API documentation (OpenAPI/Swagger)\nRegularly communicate progress and coordinate with the internal computational biology team\n \nBenefits\nFull-time and long-term role\nOpportunity to work on impactful, open-source technology used by scientists worldwide\nInfluence the direction of open standards in scientific workflow execution\nTo apply: https://weworkremotely.com/remote-jobs/toptal-senior-rust-developer",
    "url": "https://weworkremotely.com/remote-jobs/toptal-senior-rust-developer",
    "source": "WeWorkRemotely",
    "date": "2025-10-23T12:53:40.978Z",
    "expires": "2025-10-30T12:53:40.978Z",
    "id": "live_WeWorkRemotely_1761224020978_1"
  },
  {
    "title": "Toptal: Full Stack Engineer - AI",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Remote\n    \nURL: https://toptal.com\n\n\n\nDescription\nThe client is building an elite AI engineering team in New York City to develop and scale breakthrough AI-powered products that will impact millions of users. The environment is designed like a cutting-edge AI lab, combining innovation with the distribution power of their broader ecosystem. The team consists of highly talented AI engineers, Full-stack Engineers, product managers, and designers focused on pushing the boundaries of what AI can deliver to end users.\nGeneral information\nThey are seeking exceptional engineers who have shipped AI features that users actively use in production. The ideal developer is full-stack capable, thrives in fast-paced, highly collaborative environments, and is passionate about creating seamless user experiences powered by AI.\nTask and Deliverables\nBuild and ship user-facing AI features across multiple products, including content creation tools, e-commerce recommendations, and messaging experiences.\nRapidly prototype and iterate AI-powered solutions, evolving them into production-ready systems.\nCollaborate closely with product managers, designers, and fellow engineers to design, implement, and scale innovative features.\nStay ahead of AI advancements and leverage them to unlock new user experiences.\nContribute to the technical vision and strategy for scaling AI products across the ecosystem.\nRequirements\nProven track record of shipping AI features into production with real user adoption.\nHands-on experience with large language models (LLMs), whether via APIs or custom implementations, at scale.\nStrong full-stack development skills (PHP, Python, or JavaScript).\nAbility to build performant AI-powered user interfaces.\nNice to have\nExperience developing consumer AI products that scaled to large user bases.\nStrong PHP experience\nFamiliarity with WordPress, e-commerce platforms, or messaging systems.\nOpen-source contributions that showcase technical depth and innovative thinking.\nBenefits\nJoin a carefully selected team of some of the most talented minds in AI and product development.\nOpen to on-site and Remote candidates\nShip products that will directly impact millions of users across a diverse ecosystem.\nOpportunity to be part of an elite AI lab with the scale and reach of a global platform\nLong-term, Full-time position\nTo apply: https://weworkremotely.com/remote-jobs/toptal-full-stack-engineer-ai",
    "url": "https://weworkremotely.com/remote-jobs/toptal-full-stack-engineer-ai",
    "source": "WeWorkRemotely",
    "date": "2025-10-23T12:53:40.978Z",
    "expires": "2025-10-30T12:53:40.978Z",
    "id": "live_WeWorkRemotely_1761224020978_2"
  },
  {
    "title": "OnTheGoSystems: PHP and JS Developer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: 100% remote\n    \nURL: https://onthegosystems.com\n\n\nOnTheGoSystems creates products that millions rely on. Our main product is WPML, the industry standard for building and translating multilingual WordPress websites. We’re now hiring developers to join our Systems Team, which builds and maintains the infrastructure supporting thousands of clients daily.\nWe’re looking for developers who are reliable, independent, and structured in how they work: people who think in milestones, organize their time well, and deliver results.\nThe skills we’re looking for\nPHP (main focus), plus JavaScript.\nReact or Node.js experience is a nice bonus.\nProficiency in writing and applying automated tests with PHPUnit\nExperience in writing End to End tests\nWhat you will do\nDevelopment: Own tasks from start to finish, write scalable and maintainable code.\nTesting: Build and maintain end-to-end and performance tests.\nCI/CD: Help transition from manual QA to automated testing using GitLab pipelines.\nMonitoring: Use AWS CloudWatch and other tools to keep systems healthy.\nAI Tools: Use AI to speed up your development workflow.\nOur expectations\nCode Quality: Write clean, well-documented code that meets company standards.\nTest Coverage: Ensure the code is covered by automated tests.\nMeaningful Logs: Provide clear, insightful logs to track system performance.\nContinuous Improvement: Learn new skills, improve processes, and contribute to team growth.\nWhat we offer\n100% remote position,\nBody And Mind Movement (BAMM) program to support your physical activities and other hobbies,\nA computer budget to make your workplace better,\nA Kindle device with an access to our company Amazon account,\nWe respect national holidays in each country and want you to have a rest on those days,\nBeing a part of a team of smart, self-driven individuals,\nGreat opportunity to progress and advance,\nCollaborating with team members across the globe.\nAbout the team and how we work\nYou will be working with a team of smart and enthusiastic people. We come from all around the world, from different cultures, speak dozens of languages, and make valuable products. We love getting things done and we’re proud of our work.\nIf it sounds interesting to you, apply today and we are looking forward to getting to know you better!\nTo apply: https://weworkremotely.com/remote-jobs/onthegosystems-php-and-js-developer",
    "url": "https://weworkremotely.com/remote-jobs/onthegosystems-php-and-js-developer",
    "source": "WeWorkRemotely",
    "date": "2025-10-23T12:53:40.978Z",
    "expires": "2025-10-30T12:53:40.978Z",
    "id": "live_WeWorkRemotely_1761224020978_3"
  },
  {
    "title": "Zencastr: Senior Fullstack Developer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Zencastr\n    \nURL: https://zencastr.com\n\n\nEmpower the voices of the world @ Zencastr. If you want to push the world of podcasting into the future, come join a team who loves to live on the edge! We are a fully distributed team of smart people who are passionate about changing the world one voice at a time.\n \nYou should join us if you:\nHave significant experience with Node.js and good knowledge of JS fundamentals\nHave a good understanding of computer science fundamentals. You might not have gone to school for it, but you know the difference between heap and stack, different time complexities, and which patterns to use and when.\nYou are ambitious. You might want to build your own company one day or have tried to tackle the toughest tech problems just for fun.\nYou enjoy writing Javascript or Typescript\nYou have an eye for performance. Whether thinking about the latest client side bundling techniques, or the proper way to shard a mongo database, you want things to be fast.\nYou are just as comfortable working in a browser context or a node.js runtime\nYou are a team player\nYou have good communication skills\nWhat sets you apart:\nYou have a passion for high performance applications\nYou have significant open source contributions\nYou want to work in a fast growing startup. Which comes with the blood, sweat and tears of working to disrupt an established industry\nYou have empathy for the end user. A spec is a conversation starter, as an advocate for the end user you always are thinking about how to best serve their needs\nYou have an eye for code quality and you strive to uphold best practices in engineering, security, and design\nWhy you should choose us:\nYou’ll be working with world class engineers, Phd’s, and designers in a fully distributed team\nWork in an agile and fast changing environment\nEquity commensurate to your contribution in a profitable company\nHealth insurance\nUnique challenges and the support and talent to solve them\n4 weeks PTO\nFreedom to work where you please\nWhat we’re looking for:\n5+ years of Typescript, React, Node.js development\nStrong document / key-value store knowledge (Redis, MongoDB)\nStrong SQL knowledge\nStrong HTML / CSS / React knowledge\nDemonstrable knowledge of building scaleable consumer based apps\nStrong experience with unit, integration, and load testing\nExperience building APIs\nExperience with cloud APIs (Google Cloud, Digital Ocean)\nBonus points if you have:\nExperiencing working in high traffic, low latency applications\nGood dev ops experience\nDigital Signal Processing experience\nStrong SQL knowledge\n \nHow to apply:\nApply at https://jobs.ashbyhq.com/zencastr/c4c91cc0-c5f9-4773-ab04-d239f9455aee\nWe are flexible! For the right candidate we ask: What do you need to do your best work?\nTo apply: https://weworkremotely.com/remote-jobs/zencastr-senior-fullstack-developer",
    "url": "https://weworkremotely.com/remote-jobs/zencastr-senior-fullstack-developer",
    "source": "WeWorkRemotely",
    "date": "2025-10-23T12:53:40.978Z",
    "expires": "2025-10-30T12:53:40.978Z",
    "id": "live_WeWorkRemotely_1761224020978_4"
  },
  {
    "title": "Speechify Inc: Software Engineer, iOS Core Product",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Florida\n    \nURL: http://www.speechify.com\n\n\nOverview\nWith the growth of our iOS app, being the #18 productivity app in the App Store category and also our recent recognition as Apple's 2025 Design Award for inclusivity, we find the need for a Senior iOS Engineer to help us support the new user base as well as work on new and exciting projects to push our missing forward.   \nThis is a key role and ideal for someone who thinks strategically, enjoys fast-paced environments, passionate about making product decisions, and has experience building great user experiences that delight users.\nWe are a flat organization that allows anyone to become a leader by showing excellent technical skills and delivering results consistently and fast. Work ethic, solid communication skills, and obsession with winning are paramount. \nOur interview process involves several technical interviews and we aim to complete them within 1 week. \nWhat You’ll Do\nOpportunity to lead key engineering and product decisions\nActively shipping production code for the Speechify iOS app\nWork within a dedicated product team\nParticipate in product discussions to shape the product roadmap\nMaintain and enhance the existing complex app architecture\nAn Ideal Candidate Should Have\nExperience. You've worked on products that scaled to a large user base\nTrack record. You have worked on various products from inception to decent traction. You have been responsible for engineering the product\nCustomer obsession. We expect every team member whose responsibilities directly impact customers to be constantly obsessed about providing the best possible experience\nProduct thinking. You make thoughtful decisions about the evolution of your product and support internal teams and designers into taking the right direction\nSpeed. You work quickly to generate ideas and know how to decide which things can ship now and what things need time\nFocus. We’re a high-growth startup with a busy, remote team. You know how and when to engage or be heads down\nTechnical skills. Swift, SwiftUI\nTechnical Requirements:\nSwift Programming Language\nSwiftUI experience\nExperience in Multithreading Programming\nWorking with CI/CD infrastructure\nExperience with Fastlane\nSOLID principles, the ability to write every single class according to SOLID\nExperience with Git and understanding of different Git strategies\nWhat We offer:\nA fast-growing environment where you can help shape the company and product\nAn entrepreneurial crew that supports risk, intuition, and hustle\nThe opportunity to make a big impact in a transformative industry\nA competitive salary, a collegiate atmosphere, and a commitment to building a great asynchronous culture\nWork on a product that millions of people use and where daily feedback includes users sharing that they cried when they first found the product because it was so impactful on their lives\nSupport people with learning differences like Dyslexia, ADD, Low Vision, Concussions, Autism, and Second Language Learners, and give reading superpowers to professionals all over the world\nWork in one of the fastest growing sectors of tech: Intersection of Artificial Intelligence and Audio\nThink you’re a good fit for this job? \nTell us more about yourself and why you're interested in the role when you apply.\nAnd don’t forget to include links to your portfolio and LinkedIn.\nNot looking but know someone who would make a great fit? \nRefer them! \nSpeechify is committed to a diverse and inclusive workplace. \nSpeechify does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status.\nTo apply: https://weworkremotely.com/remote-jobs/speechify-inc-software-engineer-ios-core-product",
    "url": "https://weworkremotely.com/remote-jobs/speechify-inc-software-engineer-ios-core-product",
    "source": "WeWorkRemotely",
    "date": "2025-10-23T12:53:40.978Z",
    "expires": "2025-10-30T12:53:40.978Z",
    "id": "live_WeWorkRemotely_1761224020978_5"
  },
  {
    "title": "silverorange: iOS Native App Developer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Charlottetown, PE\n    \nURL: https://www.silverorange.com/\n\n\nThe company\nsilverorange is a design and development agency based in Canada. When pursuing work, we focus on interesting and meaningful projects. Over our 25 years as a company, we've worked with well-known technology organizations like Duolingo and Mozilla, not-for-profit organizations working in areas including affordable internet access for low-income families, and with world-renowned doctors training other doctors through online education.\nWe’re proud of the fantastic products we’ve built in partnership with our clients and we’re actively invested in the processes behind these products. We are committed to fostering a team-focused approach in our work of building great user-focused systems, while also placing a serious emphasis on quality of life, openness, empathy, and a supportive work environment.\nThe position\nWe’re looking for an intermediate or senior iOS native app developer to join our team. You’ll start your silverorange career focused on a medical education client, joining our existing team of experienced native app developers. You’ll help maintain existing, widely-used iOS native apps, as well as contribute to planning and implementing new features.\nThis position is available immediately and we will work with you to get you started as soon as possible.\nResponsibilities\nImplementing features and improvements on a Swift-based iOS app.\nReviewing code and content changes from other developers on iOS projects.\nCommunicating with team members and clients to understand and balance requirements.\nIdentifying and helping to address technical design issues in apps.\nWriting tests for your work.\nRequirements\nBe eligible & available to work from Canada. Eligibility to travel to the United States for occasional client meetings is an asset.\nBe able to quickly learn and understand new systems.\nHave experience with Swift and SwiftUI.\nHave experience with the release process on the Apple App Store.\nHave experience developing reasonably complex integrated systems.\nHave collaboratively developed features within a team.\nHave experience with testing and continuous integration processes.\nBe able to communicate clearly with clients and co-workers across multiple time zones. Several of our key clients are in California and we have team members across Canada.\nWhile not required, if you have any of the following skills let us know:\nUser interface and interaction design experience.\nWorking with media playback and data synchronization.\nWorking with Google Cloud Firestore's Firebase product.\nExperience with reactive programming using Apple’s Combine framework.\nProject or product leadership experience in any profession or industry.\nGrowth & ownership\nOur team is co-operative and will help you learn and expand your skills via mentoring, team-wide support, and learning opportunities. All members of the team are encouraged and given space to grow as individual contributors, and have ongoing opportunities in project and team leadership.\nWe’re excited to hear your fresh ideas and approach. We have decades of collective experience, and we all continue to become better at what we do by both teaching and learning from each other. Add your voice to our mix!\nOpportunity for employee ownership is a fundamental part of silverorange (non-founders currently own more than a third of the company) and we’re currently working on new ways to transfer even more ownership to employees.\nInclusion & diversity\nPeople with different backgrounds and experiences make us stronger, and we’re always looking for ways to improve. Our team is getting more diverse across many dimensions of diversity, but we’re still missing perspectives that could make our work better. We highly encourage people from traditionally underrepresented groups in our industry to apply—we’d love to hear from you.\nRemote working is just as good as local\nOur team has been remote-friendly for over 20 years, and remote-first for the last 10. We continue to improve our approach to having a dispersed team. This is a full-time remote position regardless of location, though you are welcome to work from our lovely offices in Charlottetown, Prince Edward Island, Canada if you wish.\nThe majority of our team is full-time remote and 95% of our clients are remote. You’ll need to be comfortable working with a remote team regardless of your location.\nTypically all employees spend at least one week each year working from our Charlottetown office, so plan on visiting PEI semi-regularly.\nThough you may be working remotely, you’ll be an active member of a great and small but growing team, both here at silverorange and with our clients. Regular voice or video communication will help keep you in touch with the smart people with whom you’ll be working.\nBenefits & compensation\nFlexible work days, approached collaboratively with you to allow for the realities of appointments, family minding, and your everyday life.\n3 weeks of paid vacation, on top of 10 paid days of civic holidays, and 3 weeks of paid company-wide shut down.\nGenerous health and dental coverage, with 100% of premium covered by silverorange.\nNew computer hardware every 3 years, and other tools as needed.\nYearly company-wide bonuses based on overall company success, plus ownership opportunities and dividends for long-term employees.\nSalaries based on skills and experience ranging from CAD $64,000 - $90,000, with both annual company wide salary band adjustments as well as opportunities and expectation of ongoing career and compensation growth.\nAdditional remote worker salary add-on of CAD $3,000 per year and a wellness salary add-on of $500 per year.\nHow to apply\nWe will be accepting applications until Monday, October 27th, 2025. We will begin reviewing applications and following up with candidates after October 27th.\nClick 'Apply Now' and include a copy of your resume, any links you have to relevant examples of recent work (GitHub or an equivalent profile is a great place to start), and an explanation of why you’d be great for the job. Tell us about an interesting project you’ve worked on or helped ship. \nWe want people to feel they can be their genuine selves at work, so we’d love to hear about who you are. If there is anything else you would like to share with us — i.e. a Medium account, online writing or select blog posts, etc. — please feel free to include those as well.\nIf you require accommodations at any phase of the application or interview process, please let us know. We would be happy to support you and discuss accommodations as required.\nTo apply: https://weworkremotely.com/remote-jobs/silverorange-ios-native-app-developer-2",
    "url": "https://weworkremotely.com/remote-jobs/silverorange-ios-native-app-developer-2",
    "source": "WeWorkRemotely",
    "date": "2025-10-23T12:53:40.978Z",
    "expires": "2025-10-30T12:53:40.978Z",
    "id": "live_WeWorkRemotely_1761224020978_6"
  },
  {
    "title": "Pronto Pilates Pty Ltd: Full Stack Engineer (NestJS, Next.js, PostgreSQL) – Data Pipelines & Reporting - 6 month contract",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Western Australia\n    \nURL: https://www.prontopilates.com.au/\n\n\nFull Stack Engineer (NestJS, Next.js, PostgreSQL) – Data Pipelines & Reporting - 6 month contract\nPronto Pilates is an emerging Australian fitness brand with ambitious plans to open 1000 studios internationally.\nAt Pronto, with group reformer classes from just $5 (instead of the normal $25) our tech-enabled mission is…\n“Pilates for the People… affordable, all-day classes so now everyone can enjoy reformer Pilates!”\nBacked by an established international marketing & technology company with 100+ team members serving thousands of clients worldwide.\nPronto’s life-giving company culture is characterized by the “outward mindset.”\nAbout The Role\nJoin our rapidly growing team and help us revolutionize the fitness industry!\nAt Pronto Pilates, we're building the future of fitness with our innovative staff-less Pilates studios. Through cutting-edge software and a passion for empowering our users, we deliver high-quality video-led classes, seamless studio access through our integrated door lock system, and intuitive booking experiences. With over 30 studios across Australia and rapid expansion planned for three new countries this year, we're on an ambitious trajectory to reach 1000 studios worldwide within the next three years.\nWe're looking for a talented and self-driven Full Stack Engineer to join our fully remote, asynchronous team. You'll play a crucial role in developing and enhancing the data tools, processes, and reporting that power the business.  This is an initial 6 month contract with strong likelihood of extension.  \nWhat you'll do:\nCollaborate closely with product, design, and the rest of the engineering team to translate business requirements into technical solutions.  \nBreak down complex tasks into manageable units, prioritize based on business impact, and drive features from conception to deployment.  \nWrite clean, efficient, and well-tested code, ensuring the scalability and reliability of our platforms.  \nDesign, build, and maintain full-stack applications supporting analytics, experimentation, and reporting workflows.\nDevelop ETL pipelines to integrate data from multiple sources (Segment, Mixpanel, Amplitude, internal databases) into a centralized data warehouse.\nImplement and manage analytics tools for event tracking, cohort analysis, funnel optimization, and growth experiments (e.g. GrowthBook).\nCollaborate with product, marketing, and growth teams to ensure accurate, actionable data flows across platforms.\nOptimize performance and reliability of data infrastructure, APIs, and integrations.\nTo secure an interview, you should possess the following:\nStrong proficiency across our tech stack:  NestJS, PostgreSQL, Prisma, Next.js, and Tailwind CSS.\nSolid experience with data pipelines, ETL processes, and data warehousing (e.g., BigQuery, Snowflake, Redshift).\nHands-on experience with analytics and event-tracking tools such as Segment, Mixpanel, Amplitude, etc., and in particular - debugging event tracking discrepancies for a large product.\nComfortable working with event-driven architectures and real-time data streaming.\nAble to analyze data and surface insights for product and growth teams in a clear, actionable way.\nProven ability to self-manage, work autonomously, and thrive in a remote, asynchronous environment.\nExcellent problem-solving skills and the ability to break down complex problems into actionable steps.\nA pragmatic approach to software development, balancing technical excellence with business needs.\nKindness, empathy, and a collaborative spirit within a team setting.\nExceptional written and verbal communication skills in English.\nWhy you’ll love working with us:\nAutonomy and Trust: We believe in empowering our team members with the freedom to own their work and make impactful decisions. No micromanagement here!\nFully Remote & Asynchronous: Enjoy the flexibility of working from anywhere, on a schedule that works for you, as long as you’re delivering results.\nImpactful Work: Your contributions will directly enable our rapid growth and shape the future of the fitness industry.\nFast-Paced & Growing: Join a company with ambitious goals and the momentum to achieve them.\nCollaborative Culture: Work alongside a supportive and empathetic team dedicated to building great products.\nReady to make an impact?\nIf you're a skilled Full Stack Engineer who is passionate about building innovative software and thrives in a dynamic, autonomous environment, we'd love to hear from you!\nTo apply:   Please submit your resume and a cover letter detailing your experience and why you're excited about this opportunity. If you are a self-taught developer, please include links to projects you've worked on that showcase your skills.\nAPPLY HERE:  https://www.prontopilates.com.au/careers/?bzid=539244968bff/apply\nTo apply: https://weworkremotely.com/remote-jobs/pronto-pilates-pty-ltd-full-stack-engineer-nestjs-next-js-postgresql-data-pipelines-reporting-1",
    "url": "https://weworkremotely.com/remote-jobs/pronto-pilates-pty-ltd-full-stack-engineer-nestjs-next-js-postgresql-data-pipelines-reporting-1",
    "source": "WeWorkRemotely",
    "date": "2025-10-23T12:53:40.978Z",
    "expires": "2025-10-30T12:53:40.978Z",
    "id": "live_WeWorkRemotely_1761224020978_7"
  },
  {
    "title": "Software Engineer - Remote",
    "company": "CodeCraft Inc",
    "description": "New Software Engineer position available. Remote work with competitive compensation and benefits. Apply now for immediate consideration.",
    "url": "https://stackoverflow.com/jobs/1761224021666_0",
    "source": "StackOverflow",
    "date": "2025-10-23T12:53:41.666Z",
    "expires": "2025-10-30T12:53:41.666Z",
    "id": "fallback_StackOverflow_1761224021666_0"
  },
  {
    "title": "Mobile Developer - Remote",
    "company": "AppInnovators",
    "description": "New Mobile Developer position available. Remote work with competitive compensation and benefits. Apply now for immediate consideration.",
    "url": "https://stackoverflow.com/jobs/1761224021666_1",
    "source": "StackOverflow",
    "date": "2025-10-23T12:53:41.666Z",
    "expires": "2025-10-30T12:53:41.666Z",
    "id": "fallback_StackOverflow_1761224021666_1"
  },
  {
    "title": "Data Scientist - Remote",
    "company": "Analytics Pro",
    "description": "New Data Scientist position available. Remote work with competitive compensation and benefits. Apply now for immediate consideration.",
    "url": "https://stackoverflow.com/jobs/1761224021666_2",
    "source": "StackOverflow",
    "date": "2025-10-23T12:53:41.666Z",
    "expires": "2025-10-30T12:53:41.666Z",
    "id": "fallback_StackOverflow_1761224021666_2"
  }
]