[
  {
    "title": "Entermotion: Mobile Developer (React Native)",
    "company": "WeWorkRemotely",
    "description": "Headquarters: USA\n    \nURL: https://entermotion.com\n\n\nWe’re looking for a mobile developer with at least 4 years of experience in React Native and JavaScript/TypeScript to help us take our mobile applications further by building new features, improving performance, and maintaining existing codebases across our healthcare products.\nThe Job\nYour main focus will be working on two core mobile applications we run in the healthcare industry: one for doctors and one for patients. These apps are already in production and actively used, so the work involves both feature development and long-term technical improvements.\nSome work may also involve platform-specific integrations or features that require bridging to native iOS (Swift) or Android (Kotlin) code. Where needed, you will have the space to learn and collaborate on areas outside your comfort zone.\nYou will start with smaller tasks to help you understand the scope of the application. As you become more familiar with the system, you will take on more complex work, including performance tuning and refactoring.\nYou will be part of a fully remote team that works through text-based communication tools such as backlogs, wikis, and Slack. Strong asynchronous communication is essential for this position. You should be able to explain your thinking clearly and collaborate effectively with the team.\nSome of the technologies and tools we use include: React Native, TypeScript, Stripe, Twilio, S3, Sentry, GraphQL, Swift, and Kotlin.\nSkills\nDevelopers have different strengths in different areas. Here are some of the categories we would assess candidates based on. Strength in one area can offset weakness in another.\nStrong experience with React Native and JavaScript/TypeScript\nExperience working in production environments\nSolid understanding of how mobile apps behave across different states, including navigation flows, background/foreground transitions, and state persistence.\nFamiliarity with Apollo, React Query, or similar data libraries\nFamiliarity with native development using Swift or Kotlin\nExperience with camera functionality, file uploads, or native bridging is a plus (AVFoundation, CoreImage)\nExperience with Twilio, S3, or analytics tools such as Sentry is a plus\nExperience with healthcare-related development or integrations is a plus\nPosition\nThis is a full-time remote position. We’re used to working as a dispersed team, so you must be cool with collaborating online and a lot over text. We’re flexible on schedules, but at least 4 hours of overlap with a core of your team is mandatory.\nTo apply: https://weworkremotely.com/remote-jobs/entermotion-mobile-developer-react-native",
    "url": "https://weworkremotely.com/remote-jobs/entermotion-mobile-developer-react-native",
    "source": "WeWorkRemotely",
    "date": "2025-11-26T12:55:26.140Z",
    "expires": "2025-12-03T12:55:26.140Z",
    "id": "live_WeWorkRemotely_1764161726140_0"
  },
  {
    "title": "Didactica AI: Full Stack Engineer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: \n    \nURL: https://www.didactica.ai\n\n\nSummary:\nWe're a stealth-mode edtech startup building an AI-first tutoring platform. Founder is a serial entrepreneur with successful exits.\nThe Product:\nReal-time interactive tutoring platform with text/voice chat, AI-powered instruction, visual diagrams, and multimedia content presentation.\nMust-Have Skills:\n+ 3+ years React & TypeScript\n+ Node.js backend expertise\n+ Real-time applications (WebSockets/Socket.io)\n+ RESTful APIs or GraphQL\n+ Modern deployment practices (CI/CD, containerization)\nNice to Have:\n+ Next.js, AI/LLM API integration (OpenAI, Claude)\n+ Voice/speech technologies (Web Speech API, STT/TTS)\n+ Canvas/SVG manipulation\n+ PostgreSQL/Firebase/Supabase, Tailwind CSS\nWe Need:\nSelf-directed problem solvers who thrive in fast-paced environments, communicate well, and are passionate about educational impact. Experience taking projects from concept to production is essential.\n\nDeliverables:\n\nDevelop real-time interactive tutoring features\n\nIntegrate AI-powered instruction tools\n\nImplement text/voice chat functionalities\n\nBuild an AI engine for creating visual diagrams and multimedia content\n\nEnsure seamless deployment with CI/CD practices\n\nTo apply: https://weworkremotely.com/remote-jobs/didactica-ai-full-stack-engineer",
    "url": "https://weworkremotely.com/remote-jobs/didactica-ai-full-stack-engineer",
    "source": "WeWorkRemotely",
    "date": "2025-11-26T12:55:26.140Z",
    "expires": "2025-12-03T12:55:26.140Z",
    "id": "live_WeWorkRemotely_1764161726140_1"
  },
  {
    "title": "Trojan Holdings Limited: Senior Webflow Developer / Full-Stack Web Developer (Contract)",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Queenstown, New Zealand\n    \nURL: https://trojanholdings.co.nz\n\n\n\n\nRemote, you must be able to work with New Zealand Time Zone (GMT+12 / GMT+13) a minimum of 5 hours per day. Contract 6 to 8 months.\nWe are looking for a senior web developer contractor with expert-level Webflow skills and a strong software engineering background to contribute to a complex multi-site project. You will collaborate closely with other developers, playing a key role in technical decision-making within the group.\nAbout the Role: \nYou will help deliver three interconnected websites powered by a large shared component library, leveraging modern Webflow toolkits such as Relume and Finsweet libraries. The project involves managing style guides, extensive custom JavaScript and CSS development, and integrating external APIs with Webflow. \nKey Responsibilities: \nWork collaboratively with other developers, contributing to technical decisions as part of a team \nDevelop and maintain a large shared library of Webflow components using Relume and Finsweet tools \nImplement and maintain three distinct style guides connected to the shared design system \nWrite advanced custom JavaScript and CSS code to extend Webflow functionality \nIntegrate external applications and APIs with Webflow sites \nKeep technical documentation thorough and up to date for all developments and workflows \nApply software engineering best practices including modular design, code inheritance, and variables \nYour Profile: \n3 to 5+ years professional web development experience, including strong Webflow expertise\nProven track record delivering complex Webflow websites in production, with demonstrated experience using Relume and Finsweet libraries\nAdvanced JavaScript and CSS skills with custom coding and integration experience \nExperience with front-end development frameworks such as Alpine.js and React.js \nStrong software engineering principles knowledge and ability to make sound technical decisions collaboratively \nExcellent documentation skills, committed to maintaining clear and current records \nAbility to quickly onboard onto Webflow workflows and work independently within a team \nFluent English communication and remote collaboration skills \nAvailability aligned with New Zealand time zones (GMT+12 / GMT+13) is required \nTo Apply: \nClick apply and send your CV and links to production Webflow websites you have shipped, including an explanation of the custom or advanced features you implemented on those projects. Additionally, include links and descriptions of non-Webflow web projects you have delivered in production.\nApplications without links to production websites you have shipped and without explanation of the custom or advanced features you have implemented on those projects won't be considered.\nIf you are a skilled senior web developer eager to contribute your Webflow and engineering expertise as part of a collaborative team and work during New Zealand hours, we want to hear from you! \nTo apply: https://weworkremotely.com/remote-jobs/trojan-holdings-limited-senior-webflow-developer-full-stack-web-developer-contract",
    "url": "https://weworkremotely.com/remote-jobs/trojan-holdings-limited-senior-webflow-developer-full-stack-web-developer-contract",
    "source": "WeWorkRemotely",
    "date": "2025-11-26T12:55:26.140Z",
    "expires": "2025-12-03T12:55:26.140Z",
    "id": "live_WeWorkRemotely_1764161726140_2"
  },
  {
    "title": "encentive: DevOps Engineer (w/m/d)",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Germany Hamburg\n\n\nUnsere Mission\nBei encentive entwickeln wir flexOn – ein intelligentes Energiemanagementsystem, das industrielle Anlagen mithilfe von KI steuert.\nWir sammeln Echtzeitdaten von Anlagen, prognostizieren deren Verhalten, kombinieren diese mit externen Faktoren wie Wetter und Energiepreisen und optimieren so gleichzeitig Kosten und CO₂-Emissionen.\nGestalte die Zukunft der Energie: Entscheidend wird nicht nur sein, weniger Energie zu verbrauchen, sondern diese zum richtigen Zeitpunkt einzusetzen – so können volatile erneuerbare Energien aus Wind und Sonne optimal integriert werden.\nMit unserer KI-gestützten flexOn-Plattform helfen wir industriellen Stromverbrauchern, ihren Energieeinsatz aktiv zu flexibilisieren – also Strom genau dann zu nutzen, wenn er besonders grün und kostengünstig ist.\nUnser Ziel: die Dekarbonisierung des Energiesystems vorantreiben und gleichzeitig die Kosten unserer Kund:innen deutlich senken.\nHeute ist flexOn ein Tool von Ingenieur:innen für Ingenieur:innen.\nMorgen – mit dir – wird daraus ein Produkt, das Kund:innen begeistert, echten Mehrwert liefert und neue Standards in der Energiebranche setzt.\nDeine Mission\nSorge für stabile Service Deployments und stelle sicher, dass unsere Systeme jederzeit zuverlässig und performant laufen.\nUnterstütze unser Data Science Team bei MLOps-Prozessen, damit Machine-Learning-Modelle effizient, sicher und skalierbar in die Produktion gelangen.\nDokumentiere und erweitere unsere Cloud-Infrastruktur, um eine zukunftssichere Basis für Wachstum, Innovation und hohe Verfügbarkeit zu schaffen.\nAufgaben\nAutomatisiere und professionalisiere Cloud-Resource-Deployments (z. B. mithilfe von Infrastructure-as-Code-Tools).\nBaue unsere Kubernetes-Cluster weiter aus und stelle eine stabile, skalierbare Container-Infrastruktur sicher.\nPlane und begleite Cloud-Migrationen in neue Umgebungen, um zukunftssichere Architekturen zu schaffen.\nStrukturiere CI/CD-Pipelines neu, um Deployments effizienter, stabiler und sicherer zu gestalten.\nEntwickle ein Datenbank-Migrationskonzept, das reibungslose Übergänge und hohe Datenintegrität gewährleistet.\nQualifikation\nMust-haves\n3+ Jahre Erfahrung mit Kubernetes – du beherrschst den Betrieb und Ausbau von Clustern.\nFundierte Erfahrung mit Terraform oder vergleichbaren Infrastructure-as-Code-Tools.\nErfahrung in AWS-Cloud-Umgebungen – von Compute über Storage bis hin zu Netzwerkservices.\nPraxis im Umgang mit ArgoCD für GitOps-basierte Deployments.\nNice-to-haves\nErfahrung in der Softwareentwicklung mit Go (Golang) – um auch tiefer in unsere Tool- und Service-Entwicklung einzusteigen.\nBenefits\nEchter Impact: Du leistest ab Tag eins einen spürbaren Beitrag im Kampf gegen den Klimawandel.\nUnternehmerischer Freiraum: Flache Hierarchien, maximale Verantwortung und Gestaltungsfreiheit – deine Ideen sind nicht nur willkommen, sondern entscheidend für die Weiterentwicklung von encentive.\nModernes Arbeitsumfeld: Inspirierende Büros im Herzen von Berlin-Mitte und in der Hamburger Sternschanze – zentral gelegen, bestens angebunden und voller Leben.\nFlexibilität: Hybrides Arbeiten & flexible Arbeitszeiten – du entscheidest, wie du deine Produktivität am besten entfaltest.\nNachhaltige Mobilität: Wir übernehmen dein Deutschlandticket, damit du bequem und klimafreundlich unterwegs bist.\nGesundheit & Wohlbefinden: Zugang zu Wellpass mit hunderten Fitness- und Wellness-Angeboten deutschlandweit.\nTeamgeist: Mehrere Offsites pro Jahr an spannenden europäischen Locations – für Inspiration, Strategie und echten Teamzusammenhalt.\nLern- & Entwicklungskultur: Wir unterstützen dich durch Mentoring, Weiterbildungen und den Zugang zu einem starken Gründer- und Investorennetzwerk.\nDeine Chance\nWenn du die Zukunft der Energiebranche mitgestalten und ein Produkt auf das nächste Level bringen möchtest, freuen wir uns auf deine Bewerbung.\nBewirb dich jetzt bei encentive – und werde unsere:r neue:r DevOps Engineer (w/m/d).\nBei encentive sind Diversität, Chancengleichheit und Inklusion keine Schlagworte, sondern gelebte Praxis. Wir freuen uns über Bewerbungen von Menschen aller Geschlechter, Altersgruppen, Hintergründe, Religionen, sexuellen Orientierungen und Identitäten sowie von Menschen mit Behinderungen.\nTo apply: https://weworkremotely.com/remote-jobs/encentive-devops-engineer-w-m-d",
    "url": "https://weworkremotely.com/remote-jobs/encentive-devops-engineer-w-m-d",
    "source": "WeWorkRemotely",
    "date": "2025-11-26T12:55:26.140Z",
    "expires": "2025-12-03T12:55:26.140Z",
    "id": "live_WeWorkRemotely_1764161726140_3"
  },
  {
    "title": "Boldr: Technical Support Advocate (Web App/SaaS)",
    "company": "WeWorkRemotely",
    "description": "Headquarters: South Africa\n    \nURL: http://boldrimpact.com\n\n\nDescription\n\nA LITTLE BIT ABOUT Boldr\n\n \nBoldr is the first global B-Corp dedicated to delivering world-class Client experiences while creating access to dignified, meaningful work in communities around the world.\n We are a global team, united by our desire to connect diverse people with common values for boldr impact. \n We employ just over a thousand team members across five countries and we want to employ over 5,000 people by 2027, if not sooner.\n \n\nLET’S START WITH OUR VALUES\n\n \nMeaningful connections start with AUTHENTICITY\n We do our best work by being CURIOUS\n We grow by remaining DYNAMIC\n Our success combines AMBITIOUS VISION with OPERATIONAL EXCELLENCE \n At the heart of great partnerships we’ll always find EMPATHY\n \n\nWHAT IS YOUR ROLE\n\nAs a Technical Support Specialist, you will be on the frontlines of Gamma’s customer support operations. Your role is to ensure that users feel supported, empowered, and confident while navigating Gamma’s platform. You’ll provide timely assistance through chat and email using Intercom, troubleshoot technical issues, and guide customers to make the most out of Gamma’s innovative tools.\n\n\n\nWHY DO WE WANT YOU\n\nWe are currently looking for impact-driven individuals who are passionate in helping Boldr grow and achieve our Purpose. We expect our Team to become our ultimate partners to success by always giving their 110% in everything, sharing their talents and quirks, and championing our core values: Curious, Dynamic and Authentic.\n\nWHAT WILL YOU DO\n \nRespond to customer inquiries via chat and email support channels using the Intercom platform.\n Provide technical troubleshooting by diagnosing and resolving users issues related to presentations, website building, account management, and platform functionality.\n Guide users through Gamma’s features, including AI content generation, template customization, publishing, and collaboration tools.\n Provide accurate, timely solutions with a professional and empathetic tone.\n Log customer interactions, track recurring issues, and contribute to knowledge base improvements.\n Escalate complex technical issues to tier 2 support or development teams\n Educate users on platform capabilities and best practices for creating presentations and websites\n Maintain high standards of response time, accuracy, and customer satisfaction.\n \nWHAT WE’LL LIKE ABOUT YOU\n\n YOU ARE…\n\n\nCurious and authentic, just like us! #beboldr \n\n An analytical and critical thinker, with an eye for even the most minute of details\n Passionate about client satisfaction\n \n\nYOU HAVE…\n\n \n2 years of SaaS customer or technical support experience, preferably in technology or saas environments\n Familiarity with help desk or ticketing systems (Intercom experience a plus).\n Familiarity with website-building tools, content management systems, or presentation software \n Strong technical aptitude for troubleshooting digital platforms and web-based apps.\n Excellent written communication skills with the ability to explain technical concepts clearly. \n Comfortable navigating multiple software applications simultaneously.\n Strong collaboration and verbal communication skills for internal teamwork.\n Patience, empathy, and active listening skills to understand customer needs.\n Organization and efficiency in time management and an ability to juggle many ongoing initiatives with grace.\n Strong organizational and time management skills with the ability to juggle multiple projects.\n Proficiency for data analysis and process/operations improvement.\n Detail-oriented with a proactive approach to problem-solving.\n Ability to work collaboratively within a team and adapt to changing project requirements.\n \n\nNICE TO HAVE…\n\n \nExperience supporting creative professionals, small businesses, or startups.\n Knowledge of presentation software (Gamma, PowerPoint, Google Slides, Canva).\n Familiarity with AI-powered tools or generative platforms.\n \n\nTo apply: https://weworkremotely.com/remote-jobs/boldr-technical-support-advocate-web-app-saas",
    "url": "https://weworkremotely.com/remote-jobs/boldr-technical-support-advocate-web-app-saas",
    "source": "WeWorkRemotely",
    "date": "2025-11-26T12:55:26.140Z",
    "expires": "2025-12-03T12:55:26.140Z",
    "id": "live_WeWorkRemotely_1764161726140_4"
  },
  {
    "title": "SixGen, Inc.: Senior Web Application Penetration Tester",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Remote\n    \nURL: http://sixgen.io\n\n\n\nSIXGEN’s mission is to deliver agile, mission-ready cybersecurity solutions that empower government and critical infrastructure organizations to stay ahead of advanced cyber threats. We combine innovation, deep expertise, and cutting-edge capabilities to uncover vulnerabilities, protect vital systems, and ensure operational superiority in an ever-evolving digital landscape.\nPOSITION OVERVIEW\nPosition: Senior Web Application Penetration Tester\nJob Type: Full Time\nLocation: Remote US. Proximity to Maryland or Virginia is a plus, but not required\nClearance Requirements: Ability to obtain a Secret Clearance\nTravel: Up to 10%\nABOUT THE TEAM\nSIXGEN supports cyber and intelligence missions by serving government and commercial organizations as they overcome global cybersecurity challenges. You’ll work with our highly skilled operators conducting research and assessments based on real-world threats. You’ll simulate adversaries and malicious actors and report details and actionable findings on critical assets and infrastructures. Using innovative processes, tools, and techniques, you’ll predict and overcome cybersecurity vulnerabilities. Your successes will be supported by our diverse team of experienced, technical talent. \nWHAT YOU'LL DO\nConduct comprehensive, black-box penetration testing of web applications to identify critical vulnerabilities such as SQL injection, XSS, CSRF, XXE, deserialization attacks, RCE, etc. Utilize a bug bounty-style approach to independently enumerate and assess targets, simulating real-world attack scenarios.\nAnalyze application architecture and source code (when available) to uncover deeper, logic-based or systemic vulnerabilities.\nDocument and communicate findings with clear risk assessments, reproduction steps, and actionable remediation recommendations.\nStay up to date with evolving web technologies, threat trends, and security tools to ensure cutting-edge testing practices.\nREQUIRED QUALIFICATIONS\nUS Citizen with the ability to obtain a Secret clearance.\nMinimum 5 years of hands-on web application penetration testing experience, with a strong preference for OSCP or equivalent hands-on certifications (e.g. CBBH, CWEE, OSWA, OSWE, GWAPT).\nProven ability to conduct full-scope penetration tests using tools like Burp Suite, Kali Linux, Metasploit, Nuclei, Nessus, and Nmap.\nExperience developing actionable intelligence based on open source intelligence (OSINT) gathering.\nExperience building offensive capabilities or tools to enhance operations with programming languages such as, but not limited to, Python, Bash, terraform, ansible, etc.\nExperience in testing web-based APIs (i.e. REST, SOAP, XML, JSON).\nAdvanced knowledge of manual testing techniques and automated tools (e.g., Burp Suite, OWASP ZAP) to assess application security.\nFamiliarity with FISMA and NIST 800-series frameworks; experienced in applying formal testing protocols and methodologies to assess networks, web apps, and cloud environments.\nStrong communication skills for interfacing with clients and documenting findings\nDemonstrated experience working both collaboratively and independently with minimal supervision.\nAwarded CVEs, Cloud, and Active Directory penetration testing is a plus but not required.\nCOMPENSATION & BENEFITS\nSalary Range: $100,000 - $145,000 USD\nThe salary range for this role is an estimate based on a wide range of compensation factors, inclusive of base salary only. Actual salary offer may vary based on (but not limited to) work experience, education and/or training, critical skills, and/or business considerations. The final salary offer will be determined after a thorough review of the candidate's background and alignment with the role.\nAdditionally, SIXGEN offers top-tier benefits for full-time employees, including:\nEmployer-paid health insurance premiums (medical, dental, vision) for you and your family \nEmployer-paid short/long term disability insurance and basic life/AD&D insurance\n401K with a 4% employer contribution\nProfessional development reimbursement options available (training, certification, education, etc)​\nFlexible and remote work policies for most positions\nFlexible PTO and holiday schedule\nOUR COMMITMENT\nSIXGEN is an Equal Opportunity Employer. We ensure that all applicants are considered for employment without regard to race, color, religion, sexual orientation, gender identity, national origin, disability, age, marital status, ancestry, projected veteran status, or any other protected group or class.\nWe are committed to fostering an inclusive culture that values diversity in our people, reflecting the communities we serve and our customer base. We strive to attract and retain a diverse talent pool and create an environment where everyone is empowered to be their authentic selves at work.\n\nTo apply: https://weworkremotely.com/remote-jobs/sixgen-inc-senior-web-application-penetration-tester",
    "url": "https://weworkremotely.com/remote-jobs/sixgen-inc-senior-web-application-penetration-tester",
    "source": "WeWorkRemotely",
    "date": "2025-11-26T12:55:26.140Z",
    "expires": "2025-12-03T12:55:26.140Z",
    "id": "live_WeWorkRemotely_1764161726140_5"
  },
  {
    "title": "leadtech: Technology Lead - web app - Leadtech (NodeJs, Typescript, AWS)",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Spain\n    \nURL: http://leadtech.com\n\n\nDescription\n\nWe're looking for an experienced Technology Leader/Engineering Manager (senior level) to join our team and help us deliver exceptional Web Experiences for our innovative, industry-leading products.\nIf you're a highly motivated person with a real interest in tech and a passion for building cutting-edge products, we've got the perfect job for you!\nA little bit about us:\nLeadtech has fostered and developed innovative digital businesses across various industries since 2009. We've now got a team of over 800 dedicated employees working around the world. We're really proud to have more than 23 nationalities working together, and we love that millions of users around the globe enjoy our products and services every month. #LifeAtLeadtech\n\nWhat will you do?\n\nManagement of delivery, people, quality, and processes for one of our web products\nCollaborate closely with the Product team to align the development roadmap of new products and iterations of existing products\nDefine and implement software development best practices (such as CI/CD, automated testing, code reviews, security) across all projects under your responsibility\nDefine and track a set of metrics to evaluate the health of applications, monitoring performance, stability, and software quality\nAssess the technical feasibility of new projects and features, providing high-level estimates and recommendations\nEnhancing the importance of team unity so that everyone feels part of the project and the company\n\n\nYour team:\nWe’re team-first. If you believe in the power of collaboration and that the team’s success is your success, then you’re one of us!\nFun is fundamental. We believe in forming strong bonds in and outside the office. That’s why we have a team-building budget and organize activities to enjoy ourselves.\nPositivity wins the day. Bring a positive attitude and communicate openly. Self-awareness and an openness to learn are always a plus.\n\n\nRequirements\nHow will you make a difference?\n\nYou have proven leadership (more than 4 years) of Backend, Frontend, DevOps and QA teams, ensuring that they are aligned with the product/business and work towards a common goal\nYou have previous experience (more than 4 years) in BE/FE Web development (Typescript, NodeJs, React)\nYou have experience in working in websites with suites of cloud computing services such as AWS or GCP\nYou have previous experience managing people, delivery, quality and processes\nYou know how to implement software development best practices\nYou like to work in high pace and dynamic environments\n\nYou are an expert in promoting teamwork so that teams collaborate with each other and create synergies for continuous improvement\nYou have great communication and leadership skills\nYou are fluent in English and advanced level of Spanish (optional)\n\nBenefits\nWHY SHOULD YOU JOIN US?\nGrowth and career development\n\nAt Leadtech, we prioritize your growth. Enjoy a flexible career path with personalized internal training and an annual budget for external learning opportunities.\n\nWork-Life balance\n\nBenefit from a flexible schedule with flextime (7 - 9:30 a.m. start, 3:30 - 6 p.m. end) and the option of working full remote or from our Barcelona office. Enjoy free Friday afternoons with a 7-hour workday, plus a 35-hour workweek in July and August so you can savor summer!\n\nComprehensive benefits\n \nCompetitive salary, full-time permanent contract, and top-tier private health insurance (including dental and psychological services).\n 25 days of vacation plus your birthday off, with flexible vacation options—no blackout days!\n \nUnique Perks\n \nIf you wish to come, in our office in Barcelona you’ll find it complete with free coffee, fresh fruit, snacks, a game room, and a rooftop terrace with stunning Mediterranean views.\n Additional benefits include ticket restaurant and nursery vouchers, paid directly from your gross salary.\n \nJoin us in an environment where you’re free to innovate, learn, and grow alongside passionate professionals. At Leadtech, you’ll tackle exciting challenges and be part of a vibrant team dedicated to delivering exceptional user experiences\n\nSounds good? Apply now! We’re looking forward to getting to know you.\n\nEqual Employment Opportunity Employer:\nLeadtech is an Equal Employment Opportunity (EEO) Employer, which means we encourage applications from people with different backgrounds, interests, and personal circumstances. Our team welcomes applicants regardless of their race, gender, age, religion, nationality, sexual orientation, gender identity, gender expressión and/or disabilities. All we need is your high energy, skills, and willingness to be a part of a great project!\n\nLocation\nYou'll have the flexibility to choose whether you'd like to come to the office every day, from time to time, or work fully remote. We want you to find the best combination for you.\nIf you prefer to be surrounded with amazing people, our exceptional office is in Barcelona’s Blue Building, located right on the city's seafront. Besides our stunning views, you’ll enjoy our office perks such as free fruit, snacks, and coffee and you’ll also be able to take part in our Mario Kart and table tennis competitions.\nThe personal data you provide will be processed in order to manage your candidacy for the corporate selection processes that fit your profile. If you wish, you can exercise your rights of access, rectification or cancellation by writing to our address (Avenida Litoral, 12-14, 5ta planta. Barcelona. 08005) or to the email address protecciondedatos@LeadTech.com, attaching to your request a document that can validate your identity.\n\nTo apply: https://weworkremotely.com/remote-jobs/leadtech-technology-lead-web-app-leadtech-nodejs-typescript-aws",
    "url": "https://weworkremotely.com/remote-jobs/leadtech-technology-lead-web-app-leadtech-nodejs-typescript-aws",
    "source": "WeWorkRemotely",
    "date": "2025-11-26T12:55:26.140Z",
    "expires": "2025-12-03T12:55:26.140Z",
    "id": "live_WeWorkRemotely_1764161726140_6"
  },
  {
    "title": "Urban Insight: SysAdmin with Drupal Experience - Part Time",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Remote\n    \nURL: http://urbaninsight.com\n\n\n\nWho We Are\nUrban Insight is a leading digital agency creating innovative websites and web applications for organizations that make a difference. We specialize in solving complex problems through website and web app strategy, design and development using open-source content management systems (primarily, Drupal and WordPress, and headless or composable architectures). Our clients include some of the most well-known museums, nonprofits, universities, cities, and other institutions. Urban Insight has been in business for 25 years and continues to expand each year. We thrive on having a professionally rewarding environment where team members are encouraged to grow.\n \nThe Opportunity\nWe are seeking a skilled, detail-oriented SysAdmin. The right individual will have a passion for efficiency, problem-solving, and collaboration. In this role at Urban Insight, you will manage all aspects of our systems, software, and developer operations. You will be instrumental in ensuring the stability, security, and optimal performance of our website development systems, tools, and processes. The ideal candidate will have experience as an IT generalist, and be able to provide guidance and technical support across the company. This position reports to the Director of Infrastructure and will collaborate closely with the Development Department and the entire Urban Insight team.\n \nKey Responsibilities\n\nManage hardware, software, and account access; and provide technical support and troubleshooting across our fully remote, distributed team.\n\nBe the face of technology for all new hires for onboarding and handle all offboarding activities. \n\nManage the security and reliability of our websites (primarily, Drupal and Wordpress), systems, and internal infrastructure.\n\nCollaborate with developers to ensure consistent and efficient work. Make sure they follow best practices, use the right tools, and maintain a strong working relationship.\n\nDevelop and maintain technical documentation, technical policies & procedures; and foster a culture of strong documentation.\n\nManage and perform hosting setup and configuration, security upgrades, and site launches for client projects.\n \n\nQualifications\n\n5+ years proven experience as a Systems Administrator or similar role.\n\nHands-on experience with open-source CMS frameworks such as Drupal & WordPress.\n\nStrong knowledge of system and network administration, including proficiency in Linux/Unix and MacOS environments.\n\nExperience with cloud platform setup and maintenance (e.g., AWS, Azure, Google Cloud).\n\nFamiliarity with web development technologies and tools (e.g. Lando, Docker, Composer).\n\nSolid understanding of security best practices and the ability to implement and monitor them effectively.\n\nExcellent problem-solving and communication skills.\n\nAbility to work well in a collaborative team environment.\n\nRelevant certifications (e.g. AWS Certified SysOps, LPIC-1, CISSP) are a plus.\n \n\nAbout Urban Insight\n\nUrban Insight is a leading digital agency with 35+ team members. https://www.urbaninsight.com/   \n\nWe work with some of the best-known museums, nonprofits and other institutions, such as LACMA, The Broad, University of Southern California, City of Los Angeles, and the Japanese American National Museum.\n\nWe’ve won numerous design awards including such as for our work for Stay Housed Los Angeles and the National World War 1 Museum & Memorial.\n\nWe’re the top-ranked Web development agency in Los Angeles, according to Clutch, an independent analyst. Have a look at what our clients say about us: https://clutch.co/profile/urban-insight \n\nWe have a clearly defined project management methodology and case management system.\n\nWe run on the Entrepreneurial Operating System.\n \n\nWhy Work at Urban Insight?\n\nWe take on interesting, meaningful projects for appreciative clients.\n\nWe offer a flexible working environment - work from anywhere in the United States.\n\nWe work with you to create a career path that works for you.\n\nThe average employee tenure is 6.5 years.\n\nWe're stable and growing. We've been in business for 23+ years and continue to grow each year.\n\nWe offer a casual and flexible working environment with plenty of opportunities for growth for the right candidate.\n\nWe believe in a reasonable life/work balance and enjoy 40-hour work weeks.\n\nWe allocate resources and time for training and professional development.\n\nWe have weekly events to keep the team connected: Lunch & Learns, Lightning Demos, Game Breaks.\n\nThere are many more reasons: https://www.urbaninsight.com/careers \n\n\nCompensation\nWe offer a highly competitive salary, which depends on your qualifications and experience. Our salary package includes:\n\nRate: $30-45/hr depending upon experience.\n\nApprox Schedule: 18 hours per week\n\nPerformance and compensation reviews annually.\n\n \n\nTo apply: https://weworkremotely.com/remote-jobs/urban-insight-sysadmin-with-drupal-experience-part-time",
    "url": "https://weworkremotely.com/remote-jobs/urban-insight-sysadmin-with-drupal-experience-part-time",
    "source": "WeWorkRemotely",
    "date": "2025-11-26T12:55:26.140Z",
    "expires": "2025-12-03T12:55:26.140Z",
    "id": "live_WeWorkRemotely_1764161726140_7"
  },
  {
    "title": "Software Engineer - Remote",
    "company": "CodeCraft Inc",
    "description": "New Software Engineer position available. Remote work with competitive compensation and benefits. Apply now for immediate consideration.",
    "url": "https://stackoverflow.com/jobs/1764161726664_0",
    "source": "StackOverflow",
    "date": "2025-11-26T12:55:26.664Z",
    "expires": "2025-12-03T12:55:26.664Z",
    "id": "fallback_StackOverflow_1764161726664_0"
  },
  {
    "title": "Mobile Developer - Remote",
    "company": "AppInnovators",
    "description": "New Mobile Developer position available. Remote work with competitive compensation and benefits. Apply now for immediate consideration.",
    "url": "https://stackoverflow.com/jobs/1764161726664_1",
    "source": "StackOverflow",
    "date": "2025-11-26T12:55:26.664Z",
    "expires": "2025-12-03T12:55:26.664Z",
    "id": "fallback_StackOverflow_1764161726664_1"
  },
  {
    "title": "Data Scientist - Remote",
    "company": "Analytics Pro",
    "description": "New Data Scientist position available. Remote work with competitive compensation and benefits. Apply now for immediate consideration.",
    "url": "https://stackoverflow.com/jobs/1764161726664_2",
    "source": "StackOverflow",
    "date": "2025-11-26T12:55:26.664Z",
    "expires": "2025-12-03T12:55:26.664Z",
    "id": "fallback_StackOverflow_1764161726664_2"
  }
]