[
  {
    "title": "H2Corporation: Forward Deployed Backend Software Engineer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Tokyo, Japan\n    \nURL: https://www.h2corporation.co.jp/en\n\n\n<The Role>\nThe ideal candidate is excited to be an early member of the engineering team of a well-funded startup. You’ll play a significant role in designing reusable, extendable data structures and resilient systems that not only enable fast delivery of AI features but also deeply integrate into our clients’ infrastructure.\n \n<Responsibilities>\n• Design and build data structures, APIs and systems satisfying both functional and non-functional requirements, especially mapping well with domain and business logics.\n• Work closely with cross-functional teams to bring AI values to our products and services, optimizing for technical and cost performance, and aligning with user needs.\n• Stay up-to-date with the latest advancements in technologies and methodologies, evaluating and adopting new tools and frameworks as they are released. \n• Continually improve products based on data-driven insights from users hearing and monitoring metrics.\n<Requirements>\n• 5+ years in software development in a fast-paced tech environment.\n• 4+ years of experience building backend in product settings.\n• You’re extremely comfortable with Go or Rust (strong requirement).\n• Strong teamwork via collaboration, documentation and public communication\n• Ability to optimize systems to boost AI serving performance is a big plus\nTo apply: https://weworkremotely.com/remote-jobs/h2corporation-forward-deployed-backend-software-engineer",
    "url": "https://weworkremotely.com/remote-jobs/h2corporation-forward-deployed-backend-software-engineer",
    "source": "WeWorkRemotely",
    "date": "2025-11-27T18:34:59.539Z",
    "expires": "2025-12-04T18:34:59.539Z",
    "id": "live_WeWorkRemotely_1764268499539_0"
  },
  {
    "title": "Storetasker: Senior Shopify Developer (Remote + Flexible)",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Brooklyn, NY\n    \nURL: https://resources.storetasker.com/become-an-expert?apply=true&source=weworkremotely_best_2021\n\n\nShopify developers love to freelance with Storetasker.\n\nEndless, quality clients: from well known DTC brands to top agencies. \nFully remote, flexible: work as much or as little as you want, wherever you want. \nA talented and helpful community: it's freelance (with a team).\nEarn $100-$200 per hour: pick your clients, and send your own quotes or retainers. \n\n\nWe've connected our community of Shopify developers to over 32,000 e-commerce brands. From new brands pre-launch, to some of the most successful Shopify Plus sites, to top creative agencies. Clients include: Alpha Industries, Boll & Branch, Superfluid, Jack Henry, Plenaire, and Fulton among many more. \nWhy Storetasker?\n\nEndless clients & project opportunities: you’ll see between 5 - 50 new opportunities per day and can pick any lead you want. \nYou’ll earn more: some experts are making $250k+ per year. \nA high quality community: we carefully select about 5% of those who apply. \nRemote: work from anywhere, anytime. \nFlexible: take on as many clients as you want.\nNo external ratings: you’re already a professional. No need to prove it. \nGreat Software: that makes it easy to manage more clients and increase billable hours.\nSupport when you need it: we offer project support 7 days per week. \nCommunity (not competition): you pick your clients, projects, and never compete against other Experts in the community. \n\n\nLearn more and join! It’s confidential, and takes less than 5 minutes. \nHere's who we're looking for:\n\nAmbitious part time and full-time freelancers and boutique agencies.\nWho have 3+ years of Shopify experience, and 5+ years of web development experience. \nAnd who have managed projects, deadlines, and communication successfully. \n\nEspecially people with some of these skills:\n\nFront-end or full-stack Shopify development\nHeadless e-commerce development\nConversion rate optimization\nE-commerce expertise and strategy\nSEO \nSite Speed\nBuilder and/or Shogun\n\nIt takes just a few minutes to join.\nHere's what a few current members have to say:\n\"Storetasker has changed my life - I'm not only making more, but I'm getting quality leads, a diverse slate of projects, and access to an amazing group of developers. Plus, I love the HQ team!\" - Adan, United States, Storetasker Expert since March 2020\n\"Storetasker has connected me with clients that would never have been possible without them. That combined with an incredible support network and community makes joining an amazing opportunity for any developer”\" - Mark, England, Storetasker Expert since 2019\n\"Storetasker has allowed me to live out my dreams as an independent developer - to move to Toronto and continue doing what I love: solving interesting problems and helping apparel companies grow.\" - Siah, Canada, Storetasker Expert since 2017\nOur Mission: \nWe're a company built by ex-freelancers who know the ins and outs of being an independent entrepreneur. We've experienced first-hand the shortcomings of other freelance platforms and the pain-points of being fully independent. Our mission is to empower e-commerce entrepreneurs by giving them the experts, insights, and resources to succeed.  \nQuestions? Reach out at experts@storetasker.com.\n\n\n\nTo apply: https://weworkremotely.com/remote-jobs/storetasker-senior-shopify-developer-remote-flexible-3",
    "url": "https://weworkremotely.com/remote-jobs/storetasker-senior-shopify-developer-remote-flexible-3",
    "source": "WeWorkRemotely",
    "date": "2025-11-27T18:34:59.539Z",
    "expires": "2025-12-04T18:34:59.539Z",
    "id": "live_WeWorkRemotely_1764268499539_1"
  },
  {
    "title": "Walter: DevOps Engineer (C#/.NET Focus)",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Remote\n    \nURL: https://www.gowalter.co/\n\n\nIMPORTANT: Please use this link to apply: https://apply.workable.com/walter-careers/j/A7F606B5C1/\n \nDescription\nThis role combines technical depth with product intuition — engineers are expected to think like product partners, not just implementers. They work closely with Product and the Director of Engineering to rapidly prototype, validate, and scale solutions that drive measurable user value. Senior Engineers bring curiosity, empathy, and a bias for action, leveraging AI tools and modern practices to deliver with speed, reliability, and craftsmanship. Our current systems include a large .NET/C# foundation, so engineers in this role will play a key part in maintaining and modernizing our core platform while also helping shape the next generation of services and architecture. This group sits at the center of Stamped’s shift toward an AI-native, iterative engineering culture— emphasizing autonomy, accountability, and shared ownership across the team.\n \nKey Responsibilities\nProduct Engineering Design, build, test, and ship features across the stack with speed and reliability.\nDesign and Implement CI/CD: Architect, build, and maintain robust Continuous Integration and Continuous Deployment (CI/CD) pipelines\nPrototyping & Validation Rapidly prototype new ideas to validate value before scaling.\nAI-Enabled Development Use AI tools (e.g., Copilot, Claude, or similar) to accelerate development, reduce repetitive work, and improve code quality.\nTechnical Judgment Participate in system design and architectural discussions, contributing to modernization and scalability — with a focus on strengthening and evolving our .NET/C# systems.\nExecution & Ownership Deliver against roadmap commitments with a focus on quality, maintainability, and iteration.Collaboration Partner closely with Product and the Director of Engineering to align technical work with customer and business needs.\nKnowledge Sharing Document, mentor, and contribute to a culture of learning and openness.\nContinuous Improvement Stay curious and experimental with new tools, frameworks, and AI workflows that can improve speed, quality, or developer experience\nRequirements\n5+ years of professional software engineering experience, ideally across multiple product areas or stacks\nExpert-level knowledge of at least one major CI/CD platform and a strong command of a major cloud platform\nStrong proficiency with C# and the .NET ecosystem — experience improving performance, reliability, or maintainability of production systems\nFamiliarity with modern languages/frameworks (e.g., TypeScript, Python, Go, React, Node, .NET)\nDemonstrated use of AI tools or automation in the development workflow\nProduct mindset: comfort with ambiguity, iteration, and user-centric decision-making\nExcellent communication and collaboration skills; thrive in cross-functional teams\n \nTo apply: https://weworkremotely.com/remote-jobs/walter-devops-engineer-c-net-focus",
    "url": "https://weworkremotely.com/remote-jobs/walter-devops-engineer-c-net-focus",
    "source": "WeWorkRemotely",
    "date": "2025-11-27T18:34:59.539Z",
    "expires": "2025-12-04T18:34:59.539Z",
    "id": "live_WeWorkRemotely_1764268499539_2"
  },
  {
    "title": "Entermotion: Mobile Developer (React Native)",
    "company": "WeWorkRemotely",
    "description": "Headquarters: USA\n    \nURL: https://entermotion.com\n\n\nWe’re looking for a mobile developer with at least 4 years of experience in React Native and JavaScript/TypeScript to help us take our mobile applications further by building new features, improving performance, and maintaining existing codebases across our healthcare products.\nThe Job\nYour main focus will be working on two core mobile applications we run in the healthcare industry: one for doctors and one for patients. These apps are already in production and actively used, so the work involves both feature development and long-term technical improvements.\nSome work may also involve platform-specific integrations or features that require bridging to native iOS (Swift) or Android (Kotlin) code. Where needed, you will have the space to learn and collaborate on areas outside your comfort zone.\nYou will start with smaller tasks to help you understand the scope of the application. As you become more familiar with the system, you will take on more complex work, including performance tuning and refactoring.\nYou will be part of a fully remote team that works through text-based communication tools such as backlogs, wikis, and Slack. Strong asynchronous communication is essential for this position. You should be able to explain your thinking clearly and collaborate effectively with the team.\nSome of the technologies and tools we use include: React Native, TypeScript, Stripe, Twilio, S3, Sentry, GraphQL, Swift, and Kotlin.\nSkills\nDevelopers have different strengths in different areas. Here are some of the categories we would assess candidates based on. Strength in one area can offset weakness in another.\nStrong experience with React Native and JavaScript/TypeScript\nExperience working in production environments\nSolid understanding of how mobile apps behave across different states, including navigation flows, background/foreground transitions, and state persistence.\nFamiliarity with Apollo, React Query, or similar data libraries\nFamiliarity with native development using Swift or Kotlin\nExperience with camera functionality, file uploads, or native bridging is a plus (AVFoundation, CoreImage)\nExperience with Twilio, S3, or analytics tools such as Sentry is a plus\nExperience with healthcare-related development or integrations is a plus\nPosition\nThis is a full-time remote position. We’re used to working as a dispersed team, so you must be cool with collaborating online and a lot over text. We’re flexible on schedules, but at least 4 hours of overlap with a core of your team is mandatory.\nTo apply: https://weworkremotely.com/remote-jobs/entermotion-mobile-developer-react-native",
    "url": "https://weworkremotely.com/remote-jobs/entermotion-mobile-developer-react-native",
    "source": "WeWorkRemotely",
    "date": "2025-11-27T18:34:59.539Z",
    "expires": "2025-12-04T18:34:59.539Z",
    "id": "live_WeWorkRemotely_1764268499539_3"
  },
  {
    "title": "Didactica AI: Full Stack Engineer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: \n    \nURL: https://www.didactica.ai\n\n\nSummary:\nWe're a stealth-mode edtech startup building an AI-first tutoring platform. Founder is a serial entrepreneur with successful exits.\nThe Product:\nReal-time interactive tutoring platform with text/voice chat, AI-powered instruction, visual diagrams, and multimedia content presentation.\nMust-Have Skills:\n+ 3+ years React & TypeScript\n+ Node.js backend expertise\n+ Real-time applications (WebSockets/Socket.io)\n+ RESTful APIs or GraphQL\n+ Modern deployment practices (CI/CD, containerization)\nNice to Have:\n+ Next.js, AI/LLM API integration (OpenAI, Claude)\n+ Voice/speech technologies (Web Speech API, STT/TTS)\n+ Canvas/SVG manipulation\n+ PostgreSQL/Firebase/Supabase, Tailwind CSS\nWe Need:\nSelf-directed problem solvers who thrive in fast-paced environments, communicate well, and are passionate about educational impact. Experience taking projects from concept to production is essential.\n\nDeliverables:\n\nDevelop real-time interactive tutoring features\n\nIntegrate AI-powered instruction tools\n\nImplement text/voice chat functionalities\n\nBuild an AI engine for creating visual diagrams and multimedia content\n\nEnsure seamless deployment with CI/CD practices\n\nTo apply: https://weworkremotely.com/remote-jobs/didactica-ai-full-stack-engineer",
    "url": "https://weworkremotely.com/remote-jobs/didactica-ai-full-stack-engineer",
    "source": "WeWorkRemotely",
    "date": "2025-11-27T18:34:59.539Z",
    "expires": "2025-12-04T18:34:59.539Z",
    "id": "live_WeWorkRemotely_1764268499539_4"
  },
  {
    "title": "Trojan Holdings Limited: Senior Webflow Developer / Full-Stack Web Developer (Contract)",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Queenstown, New Zealand\n    \nURL: https://trojanholdings.co.nz\n\n\n\n\nRemote, you must be able to work with New Zealand Time Zone (GMT+12 / GMT+13) a minimum of 5 hours per day. Contract 6 to 8 months.\nWe are looking for a senior web developer contractor with expert-level Webflow skills and a strong software engineering background to contribute to a complex multi-site project. You will collaborate closely with other developers, playing a key role in technical decision-making within the group.\nAbout the Role: \nYou will help deliver three interconnected websites powered by a large shared component library, leveraging modern Webflow toolkits such as Relume and Finsweet libraries. The project involves managing style guides, extensive custom JavaScript and CSS development, and integrating external APIs with Webflow. \nKey Responsibilities: \nWork collaboratively with other developers, contributing to technical decisions as part of a team \nDevelop and maintain a large shared library of Webflow components using Relume and Finsweet tools \nImplement and maintain three distinct style guides connected to the shared design system \nWrite advanced custom JavaScript and CSS code to extend Webflow functionality \nIntegrate external applications and APIs with Webflow sites \nKeep technical documentation thorough and up to date for all developments and workflows \nApply software engineering best practices including modular design, code inheritance, and variables \nYour Profile: \n3 to 5+ years professional web development experience, including strong Webflow expertise\nProven track record delivering complex Webflow websites in production, with demonstrated experience using Relume and Finsweet libraries\nAdvanced JavaScript and CSS skills with custom coding and integration experience \nExperience with front-end development frameworks such as Alpine.js and React.js \nStrong software engineering principles knowledge and ability to make sound technical decisions collaboratively \nExcellent documentation skills, committed to maintaining clear and current records \nAbility to quickly onboard onto Webflow workflows and work independently within a team \nFluent English communication and remote collaboration skills \nAvailability aligned with New Zealand time zones (GMT+12 / GMT+13) is required \nTo Apply: \nClick apply and send your CV and links to production Webflow websites you have shipped, including an explanation of the custom or advanced features you implemented on those projects. Additionally, include links and descriptions of non-Webflow web projects you have delivered in production.\nApplications without links to production websites you have shipped and without explanation of the custom or advanced features you have implemented on those projects won't be considered.\nIf you are a skilled senior web developer eager to contribute your Webflow and engineering expertise as part of a collaborative team and work during New Zealand hours, we want to hear from you! \nTo apply: https://weworkremotely.com/remote-jobs/trojan-holdings-limited-senior-webflow-developer-full-stack-web-developer-contract",
    "url": "https://weworkremotely.com/remote-jobs/trojan-holdings-limited-senior-webflow-developer-full-stack-web-developer-contract",
    "source": "WeWorkRemotely",
    "date": "2025-11-27T18:34:59.539Z",
    "expires": "2025-12-04T18:34:59.539Z",
    "id": "live_WeWorkRemotely_1764268499539_5"
  },
  {
    "title": "encentive: DevOps Engineer (w/m/d)",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Germany Hamburg\n\n\nUnsere Mission\nBei encentive entwickeln wir flexOn – ein intelligentes Energiemanagementsystem, das industrielle Anlagen mithilfe von KI steuert.\nWir sammeln Echtzeitdaten von Anlagen, prognostizieren deren Verhalten, kombinieren diese mit externen Faktoren wie Wetter und Energiepreisen und optimieren so gleichzeitig Kosten und CO₂-Emissionen.\nGestalte die Zukunft der Energie: Entscheidend wird nicht nur sein, weniger Energie zu verbrauchen, sondern diese zum richtigen Zeitpunkt einzusetzen – so können volatile erneuerbare Energien aus Wind und Sonne optimal integriert werden.\nMit unserer KI-gestützten flexOn-Plattform helfen wir industriellen Stromverbrauchern, ihren Energieeinsatz aktiv zu flexibilisieren – also Strom genau dann zu nutzen, wenn er besonders grün und kostengünstig ist.\nUnser Ziel: die Dekarbonisierung des Energiesystems vorantreiben und gleichzeitig die Kosten unserer Kund:innen deutlich senken.\nHeute ist flexOn ein Tool von Ingenieur:innen für Ingenieur:innen.\nMorgen – mit dir – wird daraus ein Produkt, das Kund:innen begeistert, echten Mehrwert liefert und neue Standards in der Energiebranche setzt.\nDeine Mission\nSorge für stabile Service Deployments und stelle sicher, dass unsere Systeme jederzeit zuverlässig und performant laufen.\nUnterstütze unser Data Science Team bei MLOps-Prozessen, damit Machine-Learning-Modelle effizient, sicher und skalierbar in die Produktion gelangen.\nDokumentiere und erweitere unsere Cloud-Infrastruktur, um eine zukunftssichere Basis für Wachstum, Innovation und hohe Verfügbarkeit zu schaffen.\nAufgaben\nAutomatisiere und professionalisiere Cloud-Resource-Deployments (z. B. mithilfe von Infrastructure-as-Code-Tools).\nBaue unsere Kubernetes-Cluster weiter aus und stelle eine stabile, skalierbare Container-Infrastruktur sicher.\nPlane und begleite Cloud-Migrationen in neue Umgebungen, um zukunftssichere Architekturen zu schaffen.\nStrukturiere CI/CD-Pipelines neu, um Deployments effizienter, stabiler und sicherer zu gestalten.\nEntwickle ein Datenbank-Migrationskonzept, das reibungslose Übergänge und hohe Datenintegrität gewährleistet.\nQualifikation\nMust-haves\n3+ Jahre Erfahrung mit Kubernetes – du beherrschst den Betrieb und Ausbau von Clustern.\nFundierte Erfahrung mit Terraform oder vergleichbaren Infrastructure-as-Code-Tools.\nErfahrung in AWS-Cloud-Umgebungen – von Compute über Storage bis hin zu Netzwerkservices.\nPraxis im Umgang mit ArgoCD für GitOps-basierte Deployments.\nNice-to-haves\nErfahrung in der Softwareentwicklung mit Go (Golang) – um auch tiefer in unsere Tool- und Service-Entwicklung einzusteigen.\nBenefits\nEchter Impact: Du leistest ab Tag eins einen spürbaren Beitrag im Kampf gegen den Klimawandel.\nUnternehmerischer Freiraum: Flache Hierarchien, maximale Verantwortung und Gestaltungsfreiheit – deine Ideen sind nicht nur willkommen, sondern entscheidend für die Weiterentwicklung von encentive.\nModernes Arbeitsumfeld: Inspirierende Büros im Herzen von Berlin-Mitte und in der Hamburger Sternschanze – zentral gelegen, bestens angebunden und voller Leben.\nFlexibilität: Hybrides Arbeiten & flexible Arbeitszeiten – du entscheidest, wie du deine Produktivität am besten entfaltest.\nNachhaltige Mobilität: Wir übernehmen dein Deutschlandticket, damit du bequem und klimafreundlich unterwegs bist.\nGesundheit & Wohlbefinden: Zugang zu Wellpass mit hunderten Fitness- und Wellness-Angeboten deutschlandweit.\nTeamgeist: Mehrere Offsites pro Jahr an spannenden europäischen Locations – für Inspiration, Strategie und echten Teamzusammenhalt.\nLern- & Entwicklungskultur: Wir unterstützen dich durch Mentoring, Weiterbildungen und den Zugang zu einem starken Gründer- und Investorennetzwerk.\nDeine Chance\nWenn du die Zukunft der Energiebranche mitgestalten und ein Produkt auf das nächste Level bringen möchtest, freuen wir uns auf deine Bewerbung.\nBewirb dich jetzt bei encentive – und werde unsere:r neue:r DevOps Engineer (w/m/d).\nBei encentive sind Diversität, Chancengleichheit und Inklusion keine Schlagworte, sondern gelebte Praxis. Wir freuen uns über Bewerbungen von Menschen aller Geschlechter, Altersgruppen, Hintergründe, Religionen, sexuellen Orientierungen und Identitäten sowie von Menschen mit Behinderungen.\nTo apply: https://weworkremotely.com/remote-jobs/encentive-devops-engineer-w-m-d",
    "url": "https://weworkremotely.com/remote-jobs/encentive-devops-engineer-w-m-d",
    "source": "WeWorkRemotely",
    "date": "2025-11-27T18:34:59.539Z",
    "expires": "2025-12-04T18:34:59.539Z",
    "id": "live_WeWorkRemotely_1764268499539_6"
  },
  {
    "title": "Boldr: Technical Support Advocate (Web App/SaaS)",
    "company": "WeWorkRemotely",
    "description": "Headquarters: South Africa\n    \nURL: http://boldrimpact.com\n\n\nDescription\n\nA LITTLE BIT ABOUT Boldr\n\n \nBoldr is the first global B-Corp dedicated to delivering world-class Client experiences while creating access to dignified, meaningful work in communities around the world.\n We are a global team, united by our desire to connect diverse people with common values for boldr impact. \n We employ just over a thousand team members across five countries and we want to employ over 5,000 people by 2027, if not sooner.\n \n\nLET’S START WITH OUR VALUES\n\n \nMeaningful connections start with AUTHENTICITY\n We do our best work by being CURIOUS\n We grow by remaining DYNAMIC\n Our success combines AMBITIOUS VISION with OPERATIONAL EXCELLENCE \n At the heart of great partnerships we’ll always find EMPATHY\n \n\nWHAT IS YOUR ROLE\n\nAs a Technical Support Specialist, you will be on the frontlines of Gamma’s customer support operations. Your role is to ensure that users feel supported, empowered, and confident while navigating Gamma’s platform. You’ll provide timely assistance through chat and email using Intercom, troubleshoot technical issues, and guide customers to make the most out of Gamma’s innovative tools.\n\n\n\nWHY DO WE WANT YOU\n\nWe are currently looking for impact-driven individuals who are passionate in helping Boldr grow and achieve our Purpose. We expect our Team to become our ultimate partners to success by always giving their 110% in everything, sharing their talents and quirks, and championing our core values: Curious, Dynamic and Authentic.\n\nWHAT WILL YOU DO\n \nRespond to customer inquiries via chat and email support channels using the Intercom platform.\n Provide technical troubleshooting by diagnosing and resolving users issues related to presentations, website building, account management, and platform functionality.\n Guide users through Gamma’s features, including AI content generation, template customization, publishing, and collaboration tools.\n Provide accurate, timely solutions with a professional and empathetic tone.\n Log customer interactions, track recurring issues, and contribute to knowledge base improvements.\n Escalate complex technical issues to tier 2 support or development teams\n Educate users on platform capabilities and best practices for creating presentations and websites\n Maintain high standards of response time, accuracy, and customer satisfaction.\n \nWHAT WE’LL LIKE ABOUT YOU\n\n YOU ARE…\n\n\nCurious and authentic, just like us! #beboldr \n\n An analytical and critical thinker, with an eye for even the most minute of details\n Passionate about client satisfaction\n \n\nYOU HAVE…\n\n \n2 years of SaaS customer or technical support experience, preferably in technology or saas environments\n Familiarity with help desk or ticketing systems (Intercom experience a plus).\n Familiarity with website-building tools, content management systems, or presentation software \n Strong technical aptitude for troubleshooting digital platforms and web-based apps.\n Excellent written communication skills with the ability to explain technical concepts clearly. \n Comfortable navigating multiple software applications simultaneously.\n Strong collaboration and verbal communication skills for internal teamwork.\n Patience, empathy, and active listening skills to understand customer needs.\n Organization and efficiency in time management and an ability to juggle many ongoing initiatives with grace.\n Strong organizational and time management skills with the ability to juggle multiple projects.\n Proficiency for data analysis and process/operations improvement.\n Detail-oriented with a proactive approach to problem-solving.\n Ability to work collaboratively within a team and adapt to changing project requirements.\n \n\nNICE TO HAVE…\n\n \nExperience supporting creative professionals, small businesses, or startups.\n Knowledge of presentation software (Gamma, PowerPoint, Google Slides, Canva).\n Familiarity with AI-powered tools or generative platforms.\n \n\nTo apply: https://weworkremotely.com/remote-jobs/boldr-technical-support-advocate-web-app-saas",
    "url": "https://weworkremotely.com/remote-jobs/boldr-technical-support-advocate-web-app-saas",
    "source": "WeWorkRemotely",
    "date": "2025-11-27T18:34:59.539Z",
    "expires": "2025-12-04T18:34:59.539Z",
    "id": "live_WeWorkRemotely_1764268499539_7"
  },
  {
    "title": "Software Engineer - Remote",
    "company": "CodeCraft Inc",
    "description": "New Software Engineer position available. Remote work with competitive compensation and benefits. Apply now for immediate consideration.",
    "url": "https://stackoverflow.com/jobs/1764268500203_0",
    "source": "StackOverflow",
    "date": "2025-11-27T18:35:00.203Z",
    "expires": "2025-12-04T18:35:00.203Z",
    "id": "fallback_StackOverflow_1764268500203_0"
  },
  {
    "title": "Mobile Developer - Remote",
    "company": "AppInnovators",
    "description": "New Mobile Developer position available. Remote work with competitive compensation and benefits. Apply now for immediate consideration.",
    "url": "https://stackoverflow.com/jobs/1764268500203_1",
    "source": "StackOverflow",
    "date": "2025-11-27T18:35:00.203Z",
    "expires": "2025-12-04T18:35:00.203Z",
    "id": "fallback_StackOverflow_1764268500203_1"
  },
  {
    "title": "Data Scientist - Remote",
    "company": "Analytics Pro",
    "description": "New Data Scientist position available. Remote work with competitive compensation and benefits. Apply now for immediate consideration.",
    "url": "https://stackoverflow.com/jobs/1764268500203_2",
    "source": "StackOverflow",
    "date": "2025-11-27T18:35:00.203Z",
    "expires": "2025-12-04T18:35:00.203Z",
    "id": "fallback_StackOverflow_1764268500203_2"
  }
]