[
  {
    "title": "CompanyCam: Senior Software Engineer (React/React Native)",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Lincoln, Nebraska\n    \nURL: https://companycam.com/\n\n\n \nThe Role\nWe’re looking for a sharp, driven, problem-solving Senior Software Engineer (React/React Native) to join our engineering team.\nAs a Senior Software Engineer, you’ll work alongside other engineers, designers, and product managers to tackle everything from huge company initiatives to modest but important bug fixes. While your primary focus will be frontend development, we value engineers who are T-shaped, bringing deep expertise in one area while being comfortable contributing in others. Whether that means leading the way on web and mobile, diving into backend code, or lending an extra set of eyes in discovery, you’ll collaborate with your teammates to move work forward.\nMost importantly, you’ll actively contribute to the evolution of the culture and processes of a growing engineering team, especially our client engineering discipline (this is what we call the frontend web and mobile disciplines collectively). We want devs with opinions on patterns, code organization, and processes to help make sure our codebases scale healthily, and an interest in mentoring to help make sure our devs do too.\nWorking At CompanyCam\nOur engineering team is remote-first, spanning every time zone in the United States. We welcome people from all backgrounds and really don't care whether or not you have a CS degree or even a high school diploma. All that matters is that you're not an a**hole and you're good at what you do.\nAt CompanyCam we’re driven to produce work with meaningful outcomes. That means not just dumping features and “improvements” but being able to reflect and learn from our outputs. We’re actively working to center our work on continuous discovery habits (CDH) as outlined by Teresa Torres.\nOur teams are made up of a product manager, a product designer, a tech lead and an appropriate number of engineers for the scope of your team. We take a flexible approach, pulling from Agile, Scrum, Kanban, and even Shape Up. Rather than being overly prescriptive, we provide guardrails and just enough constraints to keep teams moving. Each team is expected to collaborate, iterate, and refine their best practices to produce high-quality work.\nWhat You’ll Do\nDesign, implement and deliver complex, cross-cutting features and systems in React and React Native, and occasionally in Ruby on Rails.\nLead efforts to address technical debt and system reliability, proactively identifying areas for refactoring or optimization.\nInfluence and evolve the architecture and system design, anticipating future needs and driving long-term improvements across services and applications.\nSet and uphold high standards for code quality, testing coverage, and documentation, mentoring others to do the same.\nDrive improvements to internal tooling to enhance developer experience and system resilience.\nFacilitate technical discussions and decision-making, helping the team navigate trade-offs and align on best solutions.\nAct as a point of escalation for complex technical challenges, supporting team members in unblocking progress.\nPartner closely with product managers, designers, and engineers, shaping feature direction by identifying technical opportunities, risks, and trade-offs early in discovery.\nWhat You’ll Bring\nMust-haves\nThese are our non-negotiables:\nShow up: give us your best and have the courage to do difficult but necessary stuff.\nGrow up: be humble, take responsibility, learn continuously, and have a growth mindset.\nDo good: treat your co-workers and customers the way you want to be treated.\n5+ years of experience working as a professional developer. (Not all years of experience are created equal, so this one isn't set in stone).\nAdvanced proficiency in React and Redux, or an equivalent JS framework and state management library, with experience guiding architectural decisions and best practices for frontend systems.\nExperience with React Native or native iOS or Android.\nExperience contributing across the full stack, including front-end, back-end, and data layers.\nDemonstrated experience in leveraging artificial intelligence (AI) to build, enhance, or optimize tools and features within products, driving innovation and improving user experience.\nAbility to handle complex tasks and ambiguous problems without guidance.\nUnderstanding of business trade-offs and ability to effectively communicate the risks and benefits of various technical approaches.\nStrong collaboration skills with the ability to lift up the team by providing mentorship and proactive feedback.\nYou live and work permanently in the U.S. (We’re not set up to hire outside the U.S.).\nNice-to-haves\nYou’ll encounter the following technologies with varying frequency — experience with them is a plus, but not required:\nGraphQL & REST\nApollo & TanStack Query\nRuby on Rails\nAndroid Studio & Xcode\nNative mobile development (Java, Objective-C, Kotlin, Swift)\nSnowflake\nExperience integrating with large language models (e.g., OpenAI, Gemini)\nBenefits and Compensation\nThis is a salaried position at CompanyCam. Our salary range is $175,000 - $200,000 per year and is based on experience. We also offer meaningful equity and other benefits.\nCompanyCam is an equal-opportunity employer committed to respect, inclusion, and growth. We work hard, take responsibility, and support each other. Great ideas come from all backgrounds, and we carefully consider every applicant without regard to personal characteristics or traits. Even if your work experience doesn’t align perfectly, we encourage you to apply. What really matters to us is your potential, your passion, and your commitment to learning, innovation, and contributing meaningfully to our team.\nFor any accommodations or technical issues related to the online application or interview process, please email jobs@companycam.com and we’ll respond promptly. Please do not include any medical or health information in your message.\nTo apply: https://weworkremotely.com/remote-jobs/companycam-senior-software-engineer-react-react-native",
    "url": "https://weworkremotely.com/remote-jobs/companycam-senior-software-engineer-react-react-native",
    "source": "WeWorkRemotely",
    "date": "2025-12-11T02:06:28.418Z",
    "expires": "2025-12-18T02:06:28.418Z",
    "id": "live_WeWorkRemotely_1765418788418_0"
  },
  {
    "title": "Chipcolate: Senior Engineer - Fullstack",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Milan\n    \nURL: https://chipcolate.com\n\n\nJob Summary\nChipcolate is hiring a Senior Engineer - Fullstack (Node + React) to craft end-to-end features for our high-throughput financial platform. You’ll write clean TypeScript on both server and client, design performant Postgres schemas, and ship delightful UIs that make complex agent activity feel effortless.\nSalary: €80.000 – €100.000 gross / year\nLocation: Remote within ± 4 hours of Central European Time\nEmployment type: Full-time, permanent\nDISCLAIMER\nAny application not matching the requirements will be automatically discarded and you won't hear back from us. Mind our time, do not apply if you are outside the expected timezone and if you don't have the required seniorship.\nPlease input your GitHub profile as portfolio in the application form. The profile image is not required.\nResponsibilities\nDesign, implement and test REST services in Node.js (Bun, TypeScript) running on containerized infra.\nModel and optimize datasets in Postgres (including partitioning, indexes, materialized views).\nBuild responsive front-ends in React with modern tooling (vite, shadcn-ui, tailwind).\nUse React Query / TanStack Query for data-fetching, caching and optimistic updates.\nOwn end-to-end features: requirements → architecture → code → CI/CD → observability dashboards.\nCollaborate with SREs to keep our HA, multi-region stack secure and performant.\nExperience & Qualifications\nMust-have\n5+ years building production applications.\nSolid SQL skills and deep understanding of Postgres internals (query planner, locking, tuning).\nReact expertise: hooks, context, component composition, performance profiling.\nProficiency with TypeScript, Git, CI pipelines and Docker.\nComfortable taking a user story from Figma wireframe to deployed feature.\nNice-to-have\nWorked on OLAP / analytical workloads (e.g. column-store extensions, DuckDB, ClickHouse).\nHands-on with React Query or comparable client caching libraries.\nFamiliarity with event-driven architectures (Kafka, NATS, RabbitMQ).\nExperience with Supabase (self-hosted) on the backend\nExperience instrumenting apps with OpenTelemetry and Grafana.\nNo degree required—show us shipped code, OSS commits, or anything that proves you can build.\nBenefits\nFlexible hours & fully remote\nFast growing environment\nFun and innovative application domain\n24 days paid leave + local public holidays\nCompetitive salary\nHome-Office Budget\nCompany Laptop\nA special benefit discussed during the process\nApplication Process\nApply online with a CV and GitHub profile.\nCultural chat and Technical deep-dive with our CTO (60 min, system-design & live problem-solving).\nOffer within 7 working days or final interview.\nReady to make high-stakes infrastructure feel effortless? Apply today—let’s engineer reliability together.\nAbout Us\nChipcolate is an Italian company of hardcore engineers focusing on orchestrating any scaling fleet, from edge devices, to agents, to servers. Historically we worked on embedded systems, web applications and 3D printing. At this time, we are working on scaling a fleet of autonomous agents providing high-throughput financial services. We operate in a quite unstructured and flexible way, that’s the only way to get speed and quality. We are engineering and first principles thinking driven.\nLearn more: chipcolate.com · LinkedIn (@chipcolate) · GitHub (https://github.com/chipcolate)\n \nTo apply: https://weworkremotely.com/remote-jobs/chipcolate-senior-engineer-fullstack",
    "url": "https://weworkremotely.com/remote-jobs/chipcolate-senior-engineer-fullstack",
    "source": "WeWorkRemotely",
    "date": "2025-12-11T02:06:28.418Z",
    "expires": "2025-12-18T02:06:28.418Z",
    "id": "live_WeWorkRemotely_1765418788418_1"
  },
  {
    "title": "Bitovi: Applied AI Engineer Consultant ",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Chicago\n    \nURL: https://bitovi.com\n\n\nJOIN OUR TEAM!\nBitovi helps companies create better web applications.\nWe are seeking candidates to help build production-ready Intelligent Automations and Agentic AI solutions for our diverse portfolio of enterprise clients. We guide our clients in building things the \"right way\": maintainable, scalable, tested, and documented.\nBitovians are consultants who are knowledgeable and proficient communicators, helping enterprise clients make informed decisions for their applications.\nWHO YOU ARE\nWe are looking for a candidate with the following attributes: \nPassion for using and building AI tools and solutions\nProven ability to deliver real-world solutions and platforms\nAbility to lead and be an integral part of a team\nStrongly motivated and able to work autonomously\nAccepting of suggestions and constructive feedback\nDriven to continuously learn and improve\nEnjoys solving complex problems\nSpecific experience:\nDeveloping automation tools at the enterprise level\nBuilding workflow automation using tools such as n8n or Rivet\nStrong working knowledge of TypeScript or Python, and LangChain\nPractical use of multiple AI models and content modalities\nLeveraging vector databases and advanced RAG techniques\nUtilizing tool calling and other advanced model features\nWorking directly with clients or other stakeholders\nOther Skills we value:\nSome exposure to cloud deployments and management, including AWS, Docker, and Kubernetes\nDeep understanding of CI/CD pipelines, including GitHub actions, TravisCI, and CodeBuild\nObservability techniques, including logging, metrics, and tracing.\nAutomated testing, including unit and integration testing, performance testing, and benchmarking\nFine-tuning models or building custom models\nDeploying open-source models to production environments\nDesigning and building robust feedback systems for reinforcement learning\n \nHOW TO APPLY:\nPlease share a resume and LinkedIn profile and answer the additional questions. Yes, we read through all the answers!   At this time, we are placing a preference on candidates Nearshore who can work a minimum of 6 hours of overlap with the Eastern Time Zone.\n \nPlease note that we are not interested in working with recruiters. All job offers are contingent on passing a background check.\nTo apply: https://weworkremotely.com/remote-jobs/bitovi-applied-ai-engineer-consultant",
    "url": "https://weworkremotely.com/remote-jobs/bitovi-applied-ai-engineer-consultant",
    "source": "WeWorkRemotely",
    "date": "2025-12-11T02:06:28.418Z",
    "expires": "2025-12-18T02:06:28.418Z",
    "id": "live_WeWorkRemotely_1765418788418_2"
  },
  {
    "title": "Stellar AI: Senior Software Engineer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: London\n    \nURL: https://joinstellar.ai/\n\n\n\nWe are seeking experienced Software Engineers to contribute to projects across a wide range of technologies and programming languages, including JavaScript, Python, Go, C++, Ruby, and more.\nThis is an open-ended contract opportunity, structured around project-based work with no set schedules or minimum time or task commitments. Contributors who work with us decide which available projects they'd like to work on, when they work, and how much they contribute, which makes it an excellent option for those seeking flexible and high-impact work.\nIn this role, you will help advance AI research by understanding complex systems, exploring large codebases, and developing approaches to verify the correctness of software behavior.\nCompensation\n$70 per hour after passing the qualification\nFully remote\nProject based work, no minimum time or task commitments\nResponsibilities\nRapidly build context in large, multi-module codebases\nAnalyze feature implementations for correctness and edge cases\nProduce clear, structured documentation of findings and rationale\nRequirements\nBachelor's degree in Computer Science or a related field\nAt least 2 years of experience as a Software Engineer\nExcellent written communication skills\nAbility to clearly explain complex technical concepts\nLocation\nRemote in the US, UK, Canada, Europe, Australia, or New Zealand\nTo apply: https://weworkremotely.com/remote-jobs/stellar-ai-senior-software-engineer",
    "url": "https://weworkremotely.com/remote-jobs/stellar-ai-senior-software-engineer",
    "source": "WeWorkRemotely",
    "date": "2025-12-11T02:06:28.418Z",
    "expires": "2025-12-18T02:06:28.418Z",
    "id": "live_WeWorkRemotely_1765418788418_3"
  },
  {
    "title": "Close: Senior Software Engineer - Backend/Python - USA Only (100% Remote)",
    "company": "WeWorkRemotely",
    "description": "Headquarters: USA\n    \nURL: http://www.close.com\n\n\nAbout Us\nClose is a bootstrapped, profitable, 100% remote, ~100 person team of thoughtful individuals who prioritize taking ownership and making a meaningful impact. We’re eager to make a product our customers fall in love with over and over again.\n \nWe 💛 small scaling businesses. Since 2013, we’ve been building a CRM that focuses on better communication, without the hassle of manual data entry or a complex UI. We are out to supercharge sales productivity with the most modern, thoughtfully designed, all-in-one, communication-focused CRM. \n \nOur backend tech stack consists primarily of Python Flask web apps with our TaskTiger scheduler handling many of the backend asynchronous task processing chores. Our data stores include MongoDB, PostgreSQL, Elasticsearch, and Redis. The underlying infrastructure runs on AWS using a combination of managed services like EKS, MSK, RDS and ElasticCache and non-managed services running on EC2 instances. We have CI/CD pipelines that build Docker images, run automated tests and deploy to Kubernetes clusters. We also use these images in our local development environment allowing coding locally against all of our services. We have a well-documented public API that is consumed by our front-end JavaScript app as well as numerous integrations. Our infrastructure is heavily automated using Terraform, Ansible and other AWS tools.\n \nOur product development process is inspired by Shape Up. We love open sourcing our code and ideas on our GitHub and on The Making of Close, our behind-the-scenes Product & Engineering blog. Check out our open source projects like SocketShark, TaskTiger, LimitLion and ciso8601.\n \n \nAbout the Role\nYou will be joining one of our six cross-functional teams. These are the CRM, Admin & Onboarding, Conversations, Messaging & Scheduling, Automations & Integrations and Data Insights teams. You will be regularly collaborating with other backend & frontend engineers, product managers, designers, and other teams here at Close.\n \n \nAbout You\nWe’re looking for high achieving, full-time Software Engineers to join our engineering team. Someone who has a good understanding in web technologies and wants to help design, implement, launch, and scale major systems and user-facing features.\n \nYou're comfortable working in a fast-paced environment with a small and talented team where you're supported in your efforts to grow professionally. You're able to manage your time well, communicate effectively, and collaborate in a fully distributed team.\n\n\nCome help us with projects like...\nConceiving, designing, building, and launching new user-facing features\nImplementing new AI features to turbocharge our customers’ daily tasks\nImproving the performance and scalability of our GraphQL and REST API\nImproving how we sync millions of sales emails and calendar events each month\nWorking with Twilio's API, WebSockets, and WebRTC to improve our calling features\nBuilding user-facing analytics features that provide actionable insights based on sales activity data\nImproving our Elasticsearch-backed powerful search features\nImproving our internal messaging infrastructure using streaming technologies like Kafka and Redis \nBuilding new and enhancing existing integrations with other SaaS platforms like Google’s G Suite, Zapier, and web conferencing providers\nEnhancing our web app with real-time updates powered by GraphQL Subscriptions\nLeveraging the latest AI LLMs from providers like OpenAI, Groq and AssemblyAI\n\nHelp manage our ever growing data processing needs…\nBillions of Mongo documents\nMillions and millions of rows of PostgreSQL data\n55 Terabytes of logs / month\n500 billion OTEL spans over the last 30 days\n10+ million events / day\nTens of thousands of docker containers\n7 million minutes of call recordings / month\nPetabytes / month of network traffic\n\nRequirements...\nSenior 1 & 2 level candidates should have 5+ years of experience building modern back-end systems. Staff level candidates should have 8+ years of experience. Mid-level candidates should have ~3 years of similar experience and be eager to level up with the right opportunity.\nProfessional Python experience is preferred but a working knowledge of Python with additional experience in other languages is acceptable if you have a desire to work with Python.\nYou have built web APIs that were Internet facing or supported other high volume loads.\nYou have hands-on production experience working with MongoDB, PostgreSQL, Elasticsearch, or similar data stores. \nYou have experience designing, scaling, debugging, and optimizing systems to make them fast and reliable. \nYou have participated in code reviews and provided overall code quality suggestions to help maintain the structure and quality of the codebase. \nYou care about the craftsmanship of the code and systems you produce.\nLocated in the USA (lower 48 timezones).\n\nBonus point if you have\nContributed open source code related to our tech stack.\nLed small project teams building and launching features.\nBuilt B2B SaaS products.\nImplemented features that leveraged AI to deliver unimaginable new product capabilities.\nWorked with complex architectures that support multiple APIs (e.g. REST, GQL, WebSockets) as well as async task and event processing frameworks.\n\n🌏 Why Close?\nWatch our most recent culture video featuring our annual team retreat in Italy\n100% remote company\n5 weeks PTO + Winter & Summer Holiday Breaks with 2 additional PTO days for every year with the company\n1 month paid sabbatical every 5 years\nPaid parental leave\nMedical, Dental, Vision with HSA option (US residents)\n401k matching at 6% (US residents)\nDependent care FSA (US residents)\nOur story and team 🚀\n\nOur Values\nBuild a house you want to live in -- Examine long-term thinking and action\nNo BS -- Practice transparency and honesty, especially when it’s hard\nInvest in each other -- Build successful relationships with your coworkers and customers \nDiscipline equals freedom -- Keep your word to yourself and others\nStrive for greatness -- Constantly challenge yourself and others \n\nHow We Work Together\nProductivity, Quality & Impact: We don’t track hours. We trust you’re an adult and know best how to prioritize, meet your goals and contribute at a high level. \nAsynchronous communication & collaboration: We have team members all over the world. We don’t expect anyone to work untraditional hours, that means our default is async. Most teams have 2-5 hours of internal meetings weekly. \nAppreciation for Deep Work: *During your normal work day, not after a day of meetings*. \nAutonomy & Freedom: Create a work environment that is sustainable for you. We place a high amount of trust and responsibility with our team members from the start. \n \nWe are looking for US-based Software Engineers to join our team. Base salary range for Senior I & II is $140,000 to $210,000.\nTo apply: https://weworkremotely.com/remote-jobs/close-senior-software-engineer-backend-python-usa-only-100-remote-1",
    "url": "https://weworkremotely.com/remote-jobs/close-senior-software-engineer-backend-python-usa-only-100-remote-1",
    "source": "WeWorkRemotely",
    "date": "2025-12-11T02:06:28.418Z",
    "expires": "2025-12-18T02:06:28.418Z",
    "id": "live_WeWorkRemotely_1765418788418_4"
  },
  {
    "title": "Valory AG: Senior Python Engineer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Zug, Switzerland\n    \nURL: https://olas.network\n\n\nJoin the original agent-to-agent protocol in crypto, defining how developers build AI agents in crypto, AI and beyond.\nOur Mission\nOlas is the platform that enables true co-ownership of AI. Launched in 2021 as one of the first Crypto x AI projects, today, Olas powers the largest AI agent economies with millions of transactions. Learn more at olas.network.\nOur Products\nWith Olas’ Pearl, the first “AI Agent App Store”, any consumer with a laptop can use AI agents they truly own. With Olas’ Mech Marketplace, the “AI Agent Bazaar”, businesses can put their AI agent up for hire to earn crypto and tap into other AI agents’ services. Today, Olas’ AI Agents serve diverse use cases - from prediction markets and asset management to influencer agents - autonomously creating valuable outcomes. The OLAS utility token provides access to the platform’s benefits and coordinates agent interactions in entire AI Agent economies.\nOur Team\nValory is the team you’d be joining, working on Olas (the open-source technology governed by the Olas DAO). Valory is VC-backed team of engineers, researchers and commercial executors that raised its own successful Seed round and co-created Olas, executing a successful public token launch and subsequent $13.8m raise for the Olas DAO. We believe Artificial General Intelligence will likely be agentic and must be co-owned. Read more about our values.\nThe Role\nWe’re looking for an exceptional Senior Python Engineer with a passion for decentralized finance and emerging autonomous technologies. You have deep experience designing and building complex, high-performance systems, from architecture to implementation, and thrive in environments where ownership and technical excellence drive every decision. You’re fluent in modern, open-source Python frameworks and have a proven record of shipping production-grade systems at scale. You enjoy shaping architecture, mentoring peers, and solving problems that don’t have playbooks yet.\nAt Valory, you’ll join a world-class team pioneering the next evolution of DeFi: building autonomous on-chain agents that manage digital assets without human intervention. You’ll help push the frontier where AI meets decentralized finance, working on BabyDegen - our cutting-edge DeFi agent and one of the first of its kind.You are excited to work in line with our values, constantly pushing boundaries as the original agent project in the rapidly-expanding AI agent space.\nMain Duties\nDevelop the BabyDegen family in line with the product roadmap set by the Product Manager\nDrive the development of the BabyDegen family, translating the product vision and roadmap into robust, production-ready systems.\nLead technical design in collaboration with the Product Manager, ensuring new components integrate cleanly and efficiently within a complex, multi-system architecture.\nRapidly learn and contribute to Valory’s agents and agent frameworks, taking ownership of adding, maintaining and improving performant, production-grade agents.\nChampion code quality through comprehensive testing, rapid debugging, and continuous performance optimization\nCollaborate across functions to lead the design and integration of machine learning features, shaping Valory’s next generation of autonomous products.\nProduce thorough, high-quality documentation of experiments, outcomes, and design decisions, ensuring knowledge is shared effectively across the organization.\nLead by example, providing feedback (including code reviews), learning via others’ feedback, and supporting fellow team members to elevate the entire team.\nTake full ownership of your work - from implementation to stakeholder communication - ensuring every change meets expectations and delivers measurable value before considering a task done.\nStay ahead of the curve on DeFi, crypto, and AI developments - we move fast and iterate even faster.\nRequirements\n4+ years of hands-on experience writing production-level Python (or 2+ years Python and 2+ years in a compiled language such as C++/Go/Rust).\nDeep understanding of Python frameworks (Django, Flask, FastAPI) and modern engineering practices - linting, auto-formatting, type checking, and automated testing.\nExcellent communication and collaboration skills; you thrive in a high-autonomy, high-trust environment.\nProven ability to design and ship complex, distributed systems or high-throughput backends.\nAlignment with our values, including mission over ego, clarity through writing and pushing the autonomous edge.\nInterest in and keenness to dive into emerging areas like AI agents and decentralized systems.\nBonus: Open-source contributions or Web3 development experience, familiarity with multi-agent systems or reinforcement learning concepts, demonstrated passion for DeFi, cryptoeconomics, or automation.\nLocation: Hybrid - mostly working from home with regular in-person team meetups, eg multiple times a month, in the London office.\nEqual Opportunity\nWe are an equal opportunity workplace. We want folks who add diversity on as many axes as possible to bring their expertise, encourage applicants from all backgrounds to apply, and are committed to promoting equality of opportunity. We prohibit discrimination or harassment based on protected characteristics (including gender, race, ethnicity, colour, religion, creed, sex, sexual orientation, national origin, age, disability or marital status). We also respect the wishes of individuals to protect their anonymity online and encourage individuals who operate under pseudonyms to apply.\nThe Opportunity\nCompetitive compensation, accounting for benefits.\nHybrid - Valory has been a distributed team from day one, with biannual in-person meetups and an emerging London office.\nBe part of a pioneering project pushing the boundaries of Web3 - with technology adaptable across finance, media, data, and identity.\nWork with a world-class team of engineers, researchers, and product leaders building at the intersection of AI, autonomy, and DeFi.\nCollaborate with leading projects and our global community of agent developers, shaping the next generation of the internet and finance.\nHelp define how developers build AI agents - setting new standards for AI and crypto ecosystems.\nPlease note\nWe do not accept applications without a personalized note explaining your interest in and suitability for this particular role with us.\nCompensation varies based on the type of engagement. Independent contractors may have higher rates than employees due to differences in tax and benefit structures.\nTo apply: https://weworkremotely.com/remote-jobs/valory-ag-senior-python-engineer",
    "url": "https://weworkremotely.com/remote-jobs/valory-ag-senior-python-engineer",
    "source": "WeWorkRemotely",
    "date": "2025-12-11T02:06:28.418Z",
    "expires": "2025-12-18T02:06:28.418Z",
    "id": "live_WeWorkRemotely_1765418788418_5"
  },
  {
    "title": "Weflow: Senior / Principal Software Engineer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Berlin\n    \nURL: https://www.getweflow.com\n\n\n\nAbout Weflow\nOur mission is to help revenue teams run a repeatable, efficient, and predictable revenue process - instead of wasting time with non-selling activities, internal meetings, or cleaning CRM data.\nWith the rise of AI, we are creating a system that auto-captures & attributes data, provides insights, and run automations & alerts to drive sales performance.\n200+ fast-growing companies like BenchSci, Abridge, BluSky, TvScientific, Autorabit, IDnow, and many more use Weflow to improve team productivity, deal execution, and revenue predictability.\nBacked by Gradient Ventures and Cherry Ventures.\n\nTasks\nAs Senior/Principal Engineer, you’ll play a key role in shaping how Weflow's Revenue AI Platform evolves.\nYou’ll lead the development of deep integrations, build complex AI-driven workflows, and support a rapidly expanding customer base.\nAs Senior/Principal Engineer, you’ll play a key role in shaping how Weflow's Revenue AI Platform evolves.  If you enjoy solving tough engineering problems at scale: let's talk!\n \nRequirements\n5+ years of experience in software development.\nExpert-level proficiency in React + Typescript / Next.js, Node.js, PostgreSQL.\nExperience with AWS services and cloud architecture.\nExperience with Agile methodologies and CI/CD practices.\nSolid understanding of software design patterns and architectural distributed computing principles.\nExperience with DevOps (and actually enjoying doing it) is a big plus.\nExperience with working in SaaS product companies.\nLiving within the European Union or close to it is preferred to optimize for time zone differences.\n \nBenefits\nWeflow offers competitive pay + equity\n100% Remote - Enjoy the freedom to work from anywhere within your country of residence.\nAnnual Paid Leave (PTO).\nAnnual Company Off-Site with all expenses paid.\n\nWorking at Weflow\nWeflow is an an equal opportunity employer. \nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, or protected veteran status.\nTo apply: https://weworkremotely.com/remote-jobs/weflow-senior-principal-software-engineer",
    "url": "https://weworkremotely.com/remote-jobs/weflow-senior-principal-software-engineer",
    "source": "WeWorkRemotely",
    "date": "2025-12-11T02:06:28.418Z",
    "expires": "2025-12-18T02:06:28.418Z",
    "id": "live_WeWorkRemotely_1765418788418_6"
  },
  {
    "title": "Proton.ai: Senior Backend Engineer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Cambridge, MA \n    \nURL: https://proton.ai\n\n\n\nAbout Us:\n\n\nThe wholesale distribution industry is ready for a revolution, and Proton is leading the charge. The world relies on distributors to sell nearly every physical product, but despite its massive contribution to the global economy, this industry has been left behind in terms of technology. Proton is changing that. With AI-powered sales software, we’re breaking through the complexity of selling millions of products and making it easier for distributors to anticipate customer needs. Our mission is to bring the distribution industry into the modern age and the results speak for themselves. Distributors using Proton see 10x ROI, faster new hire ramp-up, and happier sales teams.\n\n\nIn 2022, we raised a $20M Series A backed by Felicis Ventures (investors in Twitch, Shopify, Opendoor, and many others) and Battery Ventures. This year, we’re laser-focused on driving customer growth. If you’re excited about the opportunity to wear multiple hats, and continuously learn and experiment, now’s the time to join the Proton team.\n\n\nThe Role:\n\n\nProton is looking for an experienced Senior Backend Engineer to join our fast-growing SaaS team! Reporting directly to the Director of Engineering, the Senior Backend Engineer will drive the technical development of the Proton.ai product and platform. In this role, you will be working with the engineering team to help us build a scalable, customizable, performant and secure application.\n\n\nWe're looking for someone technical with a deep understanding and curiosity of modern tech stacks and systems that will help us choose and implement solutions that benefit the future of our engineering.  \n\n\nProton collaborates with Oyster HR to hire international employees as full time (long term) contractors within our company. \n\n\n\nGross Salary range is $50,000 - $70,000  USD annually, based on experience level. \n\n\n\n \n\n\n\nWhat you’ll do: \n\n\nFeature Development:  Spearhead the backend coding of new features while helping the Product team understand complexity and tradeoffs. Developing across the entire full stack of our product, driving features from idea to production and rapidly delivering value to our customers that makes a real impact.  \nTeam Collaboration: Be part of a cross-functional team, including software engineering, infrastructure, backend, frontend, and devops, to provide architectural guidance, making sure the stack decisions being made support our future growth. \nEnterprise Customizability: Leverage your experience with enterprise applications to tailor our solutions to the unique needs of our corporate customers.\nPerformance and Reliability: Share your expertise in building high-performance, reliable applications, contributing to end-to-end architecture and data flow discussions.\n\n\n You'll be a great fit for this role if: \n\n\nProven experience as a principal engineer or similar in startup environments, with a focus on building scalable SaaS solutions. 7+ years of experience building and deploying scalable SaaS applications\n5+ years of experience with backend technologies preferably Python or Go, but C# or Java are acceptable\nTrack record of successful product architecture decisions and system improvements with a large focus on secure coding practices and standards to meet the needs of enterprise class customers and their data.\nDeep understanding of cloud-native technologies and concepts such as cloud providers, databases, application performance, scalability and security\nCuriosity for new technologies. You’re someone who actively seeks to stay informed about the latest frameworks, software advancements, and tools utilized by industry peers. You like contrasting and comparing technologies to find why one fits better for certain use-cases than the other. \nExperience with enterprise applications is highly preferred.\nExceptional communication skills for conveying complex technical concepts to diverse stakeholders.\n\n\n\n\nCurrent Tech Stack\n\n\n\nBackend \n\n\nElasticsearch & Redis as the main databases\nActively migrating to SQL as primary database \nAPI service in Python running in Kubernetes \nDaily pre-computations run in Airflow \nMachine learning \n AI models - neural networks \n Machine Learning Eng focused on experimenting with ways to improve existing models, building new models - training and developing models and deploying them \n\n\nFrontend \n\n\nVue.js 3/Nuxt 3\nMigrating Vue Component frameworks from ElementPlus/iView to Vuetify\nDocker and kubernetes to deploy \nGithub Actions for CI\n\n\n\nWhile we have a well-established tech stack, we welcome highly skilled developers who are passionate about learning and expanding their skill set. Don't have experience with everything listed here, but eager to learn? If so, we encourage you to apply!\n\n\nBenefits:\n\n\nCompetitive Salaries + Company Stock Options - we want to pay you well (and equitably!) and make you feel like an owner.  \nFlexible Schedule - we think high levels of autonomy, responsibility, and working asynchronously foster an amazing workplace.\nBiannual Company Paid Off-sites - time for us to be together, brainstorm, and make magic happen.\n\n\nTo apply: https://weworkremotely.com/remote-jobs/proton-ai-senior-backend-engineer",
    "url": "https://weworkremotely.com/remote-jobs/proton-ai-senior-backend-engineer",
    "source": "WeWorkRemotely",
    "date": "2025-12-11T02:06:28.418Z",
    "expires": "2025-12-18T02:06:28.418Z",
    "id": "live_WeWorkRemotely_1765418788418_7"
  },
  {
    "title": "Software Engineer - Remote",
    "company": "CodeCraft Inc",
    "description": "New Software Engineer position available. Remote work with competitive compensation and benefits. Apply now for immediate consideration.",
    "url": "https://stackoverflow.com/jobs/1765418789029_0",
    "source": "StackOverflow",
    "date": "2025-12-11T02:06:29.029Z",
    "expires": "2025-12-18T02:06:29.029Z",
    "id": "fallback_StackOverflow_1765418789029_0"
  },
  {
    "title": "Mobile Developer - Remote",
    "company": "AppInnovators",
    "description": "New Mobile Developer position available. Remote work with competitive compensation and benefits. Apply now for immediate consideration.",
    "url": "https://stackoverflow.com/jobs/1765418789029_1",
    "source": "StackOverflow",
    "date": "2025-12-11T02:06:29.029Z",
    "expires": "2025-12-18T02:06:29.029Z",
    "id": "fallback_StackOverflow_1765418789029_1"
  },
  {
    "title": "Data Scientist - Remote",
    "company": "Analytics Pro",
    "description": "New Data Scientist position available. Remote work with competitive compensation and benefits. Apply now for immediate consideration.",
    "url": "https://stackoverflow.com/jobs/1765418789029_2",
    "source": "StackOverflow",
    "date": "2025-12-11T02:06:29.029Z",
    "expires": "2025-12-18T02:06:29.029Z",
    "id": "fallback_StackOverflow_1765418789029_2"
  }
]