[
  {
    "title": "Million View Club: Full Stack Developer - YouTube Education Platform",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Amsterdam\n    \nURL: https://app.millionviewclub.com/\n\n\nAbout Million View Club\nThe Million View Club (MVC) is the premier education and community platform for YouTube creators and their teams, co-founded with Mario Joos (ex-MrBeast Retention Director). We deliver elite curriculum, live workshops, and tools that help creators consistently grow their channels and build scalable media businesses.\nThe Role\nWe’re seeking an experienced Full Stack Developer to take ownership of the MVC web platform. As we expand access to a broader creator audience, this role is critical in preserving our design-driven brand identity while enabling scalable growth.\nYou’ll work with a world-class team that has built and scaled VC-backed education products, running continuous experiments around onboarding, pricing, and growth. This role requires equal parts design sensibility, analytical rigor, and execution speed — building beautiful interfaces while testing and iterating quickly to remove friction and drive conversions.\nTech Stack\nFrontend: Next.js 14 (App Router), TypeScript/JavaScript, Tailwind CSS, React Context API, TanStack Query, Mux Player\nBackend & Infra: Supabase (Postgres with RLS), Stripe (subscriptions, trials, webhooks), Storyblok CMS, Zapier, Vercel\nDesign: Custom components, complex hover states, animations, Schibsted Grotesk & Neue Haas Grotesk\n\nWhat You’ll Work On\nImmediate priorities:\nRefine UI/UX for a smoother onboarding experience\nOptimize performance (Core Web Vitals, video playback, responsiveness)\nRun growth experiments (trial conversions, onboarding flows, pricing tests)\nEnhance mobile experience and accessibility\n\nOngoing responsibilities:\nShip pixel-perfect UI with sophisticated interactions\nMaintain subscription flows and database policies\nContinuously test and iterate on onboarding and pricing models\nCollaborate with product, design, and growth to identify and eliminate friction\n\nWho You Are\n5+ years full-stack experience (React, Next.js expertise required) \nStrong design eye — comfortable implementing complex, non-standard layouts\nExperienced in growth engineering, CRO, or A/B testing frameworks\nProficient with TypeScript, Tailwind, Stripe, PostgreSQL\nObsessed with speed, performance, and reducing user friction\nBonus if you have: Supabase, Storyblok, Mux, or educational platform experience\nWhy This Role is Unique\nThis isn’t a typical CRUD app or agency build. MVC is a platform where design craft meets growth engineering:\nYou’ll run rapid experiments with real impact on thousands of creators\nYou’ll help simplify complex education content for mainstream audiences\nEvery feature you ship will directly reduce drop-offs and improve conversions\n\nApplication\nPlease include:\nPortfolio of design-heavy web apps you’ve built\nExamples of complex UI/animations\nExperience with subscription-based platforms\nYour availability and preferred working arrangement\n\nCompensation: Competitive, based on experience.\nLocation: Remote-friendly with flexible hours.\nTo apply: https://weworkremotely.com/remote-jobs/million-view-club-full-stack-developer-youtube-education-platform",
    "url": "https://weworkremotely.com/remote-jobs/million-view-club-full-stack-developer-youtube-education-platform",
    "source": "WeWorkRemotely",
    "date": "2025-11-06T18:36:54.759Z",
    "expires": "2025-11-13T18:36:54.759Z",
    "id": "live_WeWorkRemotely_1762454214759_0"
  },
  {
    "title": "DynamiCare Health: Full-Stack Engineer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Boston, MA, USA\n    \nURL: https://dynamicarehealth.com\n\n\nRole Details & Compensation:\nAnnual salary range: $95,000–$115,000, plus equity\nUnlimited PTO policy and a flexible work schedule\nThis position is 100% remote, and applicants must be located in the United States.\nWhile the majority of your work will be performed during regular business hours, this role may occasionally require availability outside typical business hours.\nPlease note: DynamiCare Health does not currently offer medical benefits. While we plan to make this a benefit soon, it is not available at this time.\nRemote - Full time\nMust be physically located in the USA\nMust be authorized to work in the USA with no sponsorship required\n \nAbout Us\nDynamiCare Health is a digital therapeutics startup that helps people overcome addiction. In 8 peer-reviewed publications, DynamiCare increased quit rates for opioids, stimulants, alcohol, and tobacco by 2-4x compared to typical treatment. DynamiCare has won FDA Breakthrough Status and is already breaking into U.S. healthcare system reimbursement with partners that include the State of Rhode Island, Allegheny County of Pennsylvania, BCBS of Massachusetts, Horizon BCBSNJ, Spring Health, and Cityblock Health. \nWe understand that recovery isn't one-size-fits-all, which is why our platform provides the flexibility and continuous support needed for sustainable behavior change. We're transforming addiction care and helping more people reclaim their lives from substance use disorders. Through the Digital Recovery Platform, DynamiCare is bringing proven therapeutic approaches into the digital age, making recovery support available whenever and wherever our members need it most.\n \nAbout the job\nWorking as a Full-Stack Engineer at DynamiCare, you'll join a fully remote Agile team to design, build, and maintain secure, evidence-based applications. Since we're a small business, you'll have the opportunity to wear many different hats related to DevOps, Security, and other engineering-related fields. \nAs the primary developer at DynamiCare, you'll have ownership over the codebase, making this a huge opportunity for impact. There will also be room for growth in terms of leadership as the team expands, with potential to shape practices, mentor future developers, and take on greater responsibility in technical decision-making.\nWe are currently striving to expand our user base and increase retention rates, with a Series A funding round on the horizon. We use a Ruby on Rails application, which powers multiple subdomains and includes a REST API that supports our member-facing React Native mobile app, as well as an Analytics application utilizing ActionView, React, and Stimulus.\nWe believe DynamiCare is a great place to work. You'll collaborate in real time to make informed product decisions and play an active role in shaping the company's direction every day. We value your time and mental well-being, and we offer flexibility in working hours and time off. While there may be times when you need to jump in to resolve a critical bug, we strive to stay calm, focus on the root cause, and improve our workflows rather than place blame.\nHere are some examples of the work you might be doing at DynamiCare:\nMonitoring and responding to mobile and server package vulnerabilities, applying patches promptly, and evaluating whether they pose any risk to our users.\nRefactor Rails models to enhance feature development and data processing efficiency.\nImprove our appointment tracking features to include recurring appointments.\nMaintaining a probability engine used to schedule substance tests, ensuring functionality by writing a comprehensive suite of unit and integration tests.\nBuilding new serializers in Rails to help export data in XLSX or CSV format so that our team has insights on key metrics.\nCreating and maintaining new background jobs to improve the scalability and performance of our application.\nEnsuring data security, privacy, and compliance with HIPAA.\n \nAbout you\nWe’re seeking a candidate with a passion for technology and a motivation to make the world a better place.\nYour primary responsibilities will include full-stack development, DevOps, and maintaining strong data security across our platform. You should have at least three years of experience with our core frameworks: Ruby on Rails and React Native. Experience deploying and managing applications using CircleCI, Aptible, and AWS is especially valuable.\nExperience working within the confines of HIPAA and 42 CFR Part 2 is a strong plus, given the sensitive nature of our work. We’re also looking for someone familiar with Agile development, particularly Scrum and sprint-based workflows. Proficiency with collaboration and project management tools like Asana, Confluence, and Jira is important for staying aligned with the team.\nEven though you’re experienced, we don’t expect you to hit the ground running on day one. We value thoughtful onboarding and provide you with the time and support needed to learn our systems and processes. Strong communication is essential here, whether you're debugging code, collaborating with designers, or explaining technical concepts to non-technical teammates. \nWe also foster a collaborative environment where every voice is heard, and respectful dialogue and constructive feedback are encouraged. Our shared goal is to build a product that helps people recover from addiction, and we believe that happens best when everyone works together with openness and clarity.\nA Computer Science degree or equivalent is not required for this position. If you have the chops and the skills needed to do the job well, that’s all that matters.\nWhile you’ll report to our Director of IT & Engineering, we strongly believe in autonomy here at DynamiCare. It’s vital that you know how to manage your time, and we trust that you will as well. Investing the time and effort here will help advance your career and expose you to new and exciting challenges.\nThis position is remote and operates on Eastern Time. You’re free to work wherever you succeed the most: whether it be at home or in a coffee shop. We are hiring from anywhere in the United States.\n \nTech Stack\nMobile\n\nReact Native using Expo\nSDK Integrations\nServer \n\nRuby on Rails\nAWS\n\nS3\nQuickSight\nAptible\nPostgreSQL\nData Security\n\nHIPAA Compliance\nDevOps\n\nGitHub\nCircleCI\nDocker\nDatadog\nSentry\n \nHow to apply\nPlease submit your application with a resume, a GitHub link, and a cover letter that tells us who you are and what you can offer to DynamiCare, as well as our company’s role in your career and future.\nInterview Process\nWe aim to make a hiring decision by August 31, 2025. All interviews will be conducted over Zoom. The process includes four stages:\nInitial Screening – A brief call to learn more about your background and interest in the role.\nInterview with Direct Manager – A deeper discussion about your experience and technical alignment with the team.\nInterview with CEO and Head of Product Design – Focused on company vision, product thinking, and cross-functional collaboration.\nCoding Challenge – A live technical exercise to evaluate your problem-solving skills and coding approach.\nWe value your time and strive to keep the process efficient, respectful, and transparent. You can expect each interview stage to be scheduled approximately 24–48 hours apart during business days.\nTo apply: https://weworkremotely.com/remote-jobs/dynamicare-health-full-stack-engineer",
    "url": "https://weworkremotely.com/remote-jobs/dynamicare-health-full-stack-engineer",
    "source": "WeWorkRemotely",
    "date": "2025-11-06T18:36:54.759Z",
    "expires": "2025-11-13T18:36:54.759Z",
    "id": "live_WeWorkRemotely_1762454214759_1"
  },
  {
    "title": "Lemon.io: Senior Full-stack Developer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: New York, NY\n    \nURL: https://lemon.io\n\n\nAre you a talented Senior Developer looking for a remote job that lets you show your skills and get decent compensation? Look no further than Lemon.io — the marketplace that connects you with hand-picked startups in the US and Europe.\nWhat we offer:\nThe rate depends on your seniority level, skills and experience. We've already paid out over $11M to our engineers.\nNo more hunting for clients or negotiating rates — let us handle the business side of things so you can focus on what you do best.\nWe'll manually find the best project for you according to your skills and preferences.\nChoose a schedule that works best for you. It’s possible to communicate async or minimally overlap within team working hours.\nWe respect your seniority so you can expect no micromanagement or screen trackers.\nCommunicate directly with the clients. Most of them have technical backgrounds. Sounds good, yeah?\nWe will support you from the time you submit the application throughout all cooperation stages.\nMost of our projects involve working in a fast-paced startup environment. We hope you like it as much as we do.\nThrough our community, we will connect you with the best developers from more than 50 countries.\nRequirements for the Senior React & Python Position:\n4+ years of software development experience.\n3+ years of commercial experience with React.js and Python.\nExperience with AWS, GCP, or Azure is required.\nExperience with Next.js, Node.js, Django, TypeScript, or AI is a strong plus.\nRequirements for the Senior Node & React Position:\n5+ years of software development experience.\n5+ years of commercial experience with React.js and Node.js.\nExpertise in Next, TypeScript, and AWS, or in Next, Tailwind, and SQL, is a must.\nOther requirements:\nStrong technical skills: as a Senior Developer, you are expected to be able to create projects from scratch and have a deep understanding of application architecture.\nClear and effective communication in English — advanced ability to discuss business tasks, justify decisions, and communicate issues. Good self-presentation is also essential for upcoming client calls.\nStrong self-organizational skills — ability to work full-time remotely with no supervision.\nReliability — we want to trust you and expect that you won’t let us and the client down.\nAdaptability and Flexibility — the ability to onboard the project promptly after accepting it and start delivering results quickly.\nSounds good for you? Apply now and join the Lemon.io community!\nNOT YOUR TECH STACK?\nWe have different projects for Senior Developers, so if you have 4+ years of commercial experience in software development and you are fluent with Node & Python, Swift & SwiftUI, Unreal Engine, Data Engineering, WordPress, Blockchain, Svelte & TypeScript, Svelte & Node, Svelte & Python, or Shopify & JavaScript, Golang, PHP & Vue, Rust, MLOps, we would be happy to communicate and provide you with a project that matches your experience. Just apply, and we will share more details with you.\nIf your experience matches our requirements, be ready for the next steps:\nVideoAsk — watch a short video about our startup, up to 10 minutes\nComplete your profile on our website\n30-minute screening call\nTechnical interview\nFeedback\nMagic Box (we are looking for the best project for you).\nWe do not provide visa assistance, and our cooperation model does not include the benefits typically offered with direct hire.\nP.S. We work with developers from 50+ countries in different regions: Europe, LATAM, the U.S (if you are an owner of W-9 ben form), Canada, Asia (Japan, Singapore, South Korea, Philippines, Indonesia), Oceania (Australia, New Zealand, Papua New Guinea), and the the UK. However, we have some exceptions.\nAt the moment, we don’t have a legal basis to accept applicants from the following countries:\nEuropean: Iceland, Liechtenstein, Kosovo, Belarus, Russia, and Serbia.\nLatin America: Cuba and Nicaragua\nMost Asian countries and Africa.\nWe expand and shorten the list of exemptions regularly.\nWe do not provide visa assistance, and our cooperation model does not include the benefits typically offered with direct hire.\nDo you represent a company with engineers who match the description and want to collaborate with us through staff augmentation? Then register here.\n \nTo apply: https://weworkremotely.com/remote-jobs/lemon-io-senior-full-stack-developer-5",
    "url": "https://weworkremotely.com/remote-jobs/lemon-io-senior-full-stack-developer-5",
    "source": "WeWorkRemotely",
    "date": "2025-11-06T18:36:54.759Z",
    "expires": "2025-11-13T18:36:54.759Z",
    "id": "live_WeWorkRemotely_1762454214759_2"
  },
  {
    "title": "Rhizome AI: Product Engineer / AI Engineer (Contractor)",
    "company": "WeWorkRemotely",
    "description": "Headquarters: New York, NY\n    \nURL: http://rhizomeai.com\n\n\nAs a Product Engineer, you'll work across our full stack to improve the user experience and expand our platform's capabilities. Your work will directly impact how life science companies navigate regulatory requirements.\nWhat You'll Work On\nEnhancing UI/UX across our platform\nIntegrating new datasets to expand regulatory coverage\nImproving our data ingestion pipelines\nImprove our RAG pipeline’s document retrieval\nImprove our answer generation pipeline \nBuilding internal apps that help domain experts tune our agentic capabilities\nOpportunity to engage directly with customers (if interested)\nOpportunity to work on AI engineering projects (if interested)\nTech Stack\nNext.js (Pages Router)\nReact\nTailwind CSS\nPostgreSQL\nDigital Ocean\nPython + Fastapi \nRequirements\n4+ years of relevant software engineering experience\nStrong experience with our tech stack\nHigh ownership mindset and ability to work independently\n5 hours of overlap with GMT-5 (Eastern Time) required\nFully remote\nAble and willing to travel for a 1 week offsite every 1-3 months\nOur Work Culture\nAsync, written-first communication with minimal meetings\nShip quickly and iterate\nHigh autonomy and trust\nCompensation & Commitment\n$30 - $60/hour depending on experience\nInitially 20 hours/week with potential to scale to 40 hours/week\nContractor position\nTo apply: https://weworkremotely.com/remote-jobs/rhizome-ai-product-engineer-ai-engineer-contractor",
    "url": "https://weworkremotely.com/remote-jobs/rhizome-ai-product-engineer-ai-engineer-contractor",
    "source": "WeWorkRemotely",
    "date": "2025-11-06T18:36:54.759Z",
    "expires": "2025-11-13T18:36:54.759Z",
    "id": "live_WeWorkRemotely_1762454214759_3"
  },
  {
    "title": "ZSA: C and Rust dev with a love of keyboards, quality, and small teams",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Kitchener-Waterloo, Ontario, Canada\n    \nURL: https://zsa.io\n\n\nAre you an embedded C programmer who also enjoys system programming in Rust? Do you like working as part of a small team with deep technical expertise and having lots of impact on hardware development? And finally, do you enjoy a good keyboard?\nIf so, I'd love to talk to you. I'm Erez, and I run ZSA. We make nice keyboards (the ErgoDox EZ, Moonlander, and Voyager) and we've got lots of ideas. We're also passionate about open-source and have been contributing to the QMK open-source keyboard project for many years, and have open-sourced other work as well.\nWe're small, bootstrapped, and fully remote. We're a company of grownups — no invasive monitoring, and meetings only as needed, no exhausting daily video standups. \nWe do use a kanban system and create detailed work items, so requirements are not going to shift under your feet. We also listen to what you think. Our process is collaborative, and the right person for this role will have a big impact on our small business, and possibly on the keyboard community far outside of ZSA as well.\nIf this sounds interesting, the link goes to a Typeform I'd love for you to fill out. We don't look at resumes, but the Typeform isn't boring, I promise. Check it out, and thank you for your time! ❤️\nTo apply: https://weworkremotely.com/remote-jobs/zsa-c-and-rust-dev-with-a-love-of-keyboards-quality-and-small-teams",
    "url": "https://weworkremotely.com/remote-jobs/zsa-c-and-rust-dev-with-a-love-of-keyboards-quality-and-small-teams",
    "source": "WeWorkRemotely",
    "date": "2025-11-06T18:36:54.759Z",
    "expires": "2025-11-13T18:36:54.759Z",
    "id": "live_WeWorkRemotely_1762454214759_4"
  },
  {
    "title": "DesignFiles: Remote Front-End Rails Developer",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Remote\n    \nURL: https://designfiles.co\n\n\nAt DesignFiles, we’re looking for a Front-End Rails Developer with strong JavaScript and UI skills to help shape and improve the creative tools at the heart of our platform.\nAbout Us:\nAt DesignFiles, we’re building the go-to platform for interior designers to manage every part of their business—from concept to completion. More than 5,500 customers already rely on our tools, and our remote team of 30+ is growing. If you care about building great products that solve real problems, we’d love to meet you.\nWhat You'll Do:\nHelp guide the evolution of our Design/Presentation Editor into a modern, Canva-style experience that supports moodboards, room mock-ups, client presentations, reusable templates, and more.\nBuild intuitive, high-performance UI components for core editing interactions: drag-and-drop, layering, resizing, grouping, alignment, snapping, canvas navigation, and on-canvas text/image editing.\nCollaborate closely with product and design to translate complex user needs into seamless creative workflows.\nShape the architecture and structure of our editor so it's fast, scalable, and easy to maintain as it grows.\nContribute to a high-quality, design-forward experience that feels just as good as tools like Canva or Figma — but purpose-built for interior designers.\nParticipate in team rituals like daily standups, sprint planning, and retrospectives.\nWhat We're Looking For:\nStrong vanilla JavaScript skills, including DOM/event handling, canvas or SVG rendering, and performance optimization.\nExperience building or contributing to visual editors, creative tools, or browser-based design software is a strong plus.\nDeep understanding of CSS, with hands-on experience using Tailwind or a similar utility-first framework.\nProficient with Stimulus.js, Turbo, Hotwire, ViewComponents, and the modern Rails front-end stack.\n3+ years of hands-on Ruby on Rails development experience.\nTakes full ownership of features from concept to deployment—driving high-quality, scalable implementations.\nFluent English and clear, professional communication skills.\n \nThis is a full-time, 40-hour/week remote contract role. We’re specifically seeking candidates (not agencies) based within ±2 hours of Central European Time (CET).\nIf you’ve built or contributed to browser-based editors or creative tools—and care about crafting fast, intuitive, design-friendly experiences—we’d love to talk.\n \nTo apply: https://weworkremotely.com/remote-jobs/designfiles-remote-front-end-rails-developer",
    "url": "https://weworkremotely.com/remote-jobs/designfiles-remote-front-end-rails-developer",
    "source": "WeWorkRemotely",
    "date": "2025-11-06T18:36:54.759Z",
    "expires": "2025-11-13T18:36:54.759Z",
    "id": "live_WeWorkRemotely_1762454214759_5"
  },
  {
    "title": "DesignFiles: Remote Growth Engineer (Full-Stack Rails)",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Remote\n    \nURL: https://designfiles.co\n\n\nAt DesignFiles, we’re looking for a Growth Engineer with strong full-stack Rails experience to join our product engineering team.\nAbout Us:\nAt DesignFiles, we’re building the go-to platform for interior designers to manage every part of their business—from concept to completion. More than 5,500 customers already rely on our tools, and our remote team of 30+ is growing. If you care about building great products that solve real problems, we’d love to meet you.\nWhat You'll Do:\nAs a Growth Engineer, you’ll sit at the intersection of engineering, product, and growth. You’ll ship features and run experiments that directly impact customer activation, retention, and monetization. Your work won’t just be about building—it’ll be about measuring, iterating, and optimizing.\nRun experiments that improve activation, retention, and monetization.\nCollaborate with product, design, and marketing to test and refine onboarding flows, funnels, and client engagement touchpoints.\nUse data to uncover friction points in the user journey and ship small, high-impact improvements.\nTake ownership of experiments end-to-end: scope, build, ship, measure, and iterate.\nRefine existing features to boost adoption and stickiness.\nContribute to a culture of clean code, rapid iteration, and measurable outcomes.\nParticipate in team rituals like daily standups, sprint planning, and retrospectives.\nWhat We're Looking For:\n5+ years of hands-on Ruby on Rails experience with strong full-stack skills.\nProficiency with JavaScript, Stimulus.js, CSS, RSpec, SQL, Docker, Unix Shell.\nExperience with A/B testing, growth-focused engineering, and/or optimizing onboarding funnels.\nStrong problem-solving skills and ability to self-unblock.\nFluent English and solid communication skills.\nTeam-oriented and comfortable with collaboration, idea-sharing, and code reviews.\n\nThis is a full-time, 40-hour/week remote contract role. We’re specifically seeking candidates (not agencies) based within ±2 hours of Central European Time (CET).\nIf you’ve got a portfolio of high-impact experiments or user-facing improvements you’ve shipped and iterated on, we’d love to talk.\n \nTo apply: https://weworkremotely.com/remote-jobs/designfiles-remote-growth-engineer-full-stack-rails",
    "url": "https://weworkremotely.com/remote-jobs/designfiles-remote-growth-engineer-full-stack-rails",
    "source": "WeWorkRemotely",
    "date": "2025-11-06T18:36:54.759Z",
    "expires": "2025-11-13T18:36:54.759Z",
    "id": "live_WeWorkRemotely_1762454214759_6"
  },
  {
    "title": "Apexver: Quantitative Research Team Lead",
    "company": "WeWorkRemotely",
    "description": "Headquarters: Cayman\n    \nURL: http://apexver.com\n\n\nLocation: Remote\nCompensation: Base Salary €180,000 / year + performance bonus up to 100%\nTeam: Quantitative Research & Trading Strategy\n \nRole Overview\nAs the Quantitative Research Team Lead, you will head a team of quants and researchers dedicated to developing trading strategies, improving alpha models, and optimizing execution. This role is both hands-on research and strategic leadership: you will drive model development, oversee research pipelines, and mentor team members while shaping Apexver’s research roadmap.\nYou will partner with traders, engineers, and data scientists to push the boundaries of what’s possible in high-frequency and systematic trading.\nKey Responsibilities\nLeadership & Strategy\nLead, mentor, and grow a team of quantitative researchers.\nDefine research priorities, align with trading and technology strategy, and ensure results deliver measurable alpha.\nInstill best practices for model development, testing, and deployment.\nResearch & Innovation\nDevelop and refine alpha models, statistical arbitrage signals, and systematic trading strategies.\nExplore large-scale datasets to identify patterns, anomalies, and predictive signals.\nPartner with engineers to translate research into robust, production-ready systems.\nCollaboration & Execution\nWork closely with traders and risk managers to integrate models into execution pipelines.\nCollaborate with infrastructure teams to optimize simulation environments, backtesting frameworks, and data feeds.\nBalance short-term opportunities with long-term research initiatives.\nQualifications\nRequired:\n7+ years of experience in quantitative research / systematic trading, with at least 2+ years in a leadership capacity.\nAdvanced degree (PhD strongly preferred, MSc acceptable) in Mathematics, Physics, Computer Science, Statistics, or related quantitative discipline.\nDeep experience with time-series analysis, probability, statistics, and machine learning methods.\nStrong programming skills in Python (for research) and familiarity with C++ (for production alignment).\nProven track record of delivering profitable trading strategies or alpha models.\nStrong leadership, communication, and ability to align a multi-disciplinary team.\nNice to Have:\nBackground in high-frequency trading (HFT) or market-making.\nExpertise in market microstructure, execution algorithms, or exchange connectivity.\nExperience managing petabyte-scale datasets and distributed research pipelines.\nComfort with risk management frameworks and capital allocation.\nWhy Join Apexver?\nCompensation & upside: €180k base salary + up to 100% performance bonus.\nImpact: Shape the research direction of a fast-growing proprietary trading firm.\nCollaboration: Work alongside elite engineers and traders on high-stakes challenges.\nInnovation: Freedom to test ideas quickly, deploy models, and iterate in production.\nCulture: Flat, collaborative, and meritocratic environment where best ideas win.\nApplication\nIf you are excited to lead a world-class research team, love solving problems where milliseconds and insights matter, and want to directly impact the future of Apexver’s trading business — we’d love to talk to you.\n \nTo apply: https://weworkremotely.com/remote-jobs/apexver-quantitative-research-team-lead",
    "url": "https://weworkremotely.com/remote-jobs/apexver-quantitative-research-team-lead",
    "source": "WeWorkRemotely",
    "date": "2025-11-06T18:36:54.759Z",
    "expires": "2025-11-13T18:36:54.759Z",
    "id": "live_WeWorkRemotely_1762454214759_7"
  },
  {
    "title": "Software Engineer - Remote",
    "company": "CodeCraft Inc",
    "description": "New Software Engineer position available. Remote work with competitive compensation and benefits. Apply now for immediate consideration.",
    "url": "https://stackoverflow.com/jobs/1762454215322_0",
    "source": "StackOverflow",
    "date": "2025-11-06T18:36:55.322Z",
    "expires": "2025-11-13T18:36:55.322Z",
    "id": "fallback_StackOverflow_1762454215322_0"
  },
  {
    "title": "Mobile Developer - Remote",
    "company": "AppInnovators",
    "description": "New Mobile Developer position available. Remote work with competitive compensation and benefits. Apply now for immediate consideration.",
    "url": "https://stackoverflow.com/jobs/1762454215322_1",
    "source": "StackOverflow",
    "date": "2025-11-06T18:36:55.322Z",
    "expires": "2025-11-13T18:36:55.322Z",
    "id": "fallback_StackOverflow_1762454215322_1"
  },
  {
    "title": "Data Scientist - Remote",
    "company": "Analytics Pro",
    "description": "New Data Scientist position available. Remote work with competitive compensation and benefits. Apply now for immediate consideration.",
    "url": "https://stackoverflow.com/jobs/1762454215322_2",
    "source": "StackOverflow",
    "date": "2025-11-06T18:36:55.322Z",
    "expires": "2025-11-13T18:36:55.322Z",
    "id": "fallback_StackOverflow_1762454215322_2"
  }
]